[
    {
        "JobTitle": "GM - Marketing Demand Management & Tech Interface",
        "Company": "Vodafone Idea",
        "Location": "Mumbai, Maharashtra",
        "Description": "Job Req ID: 46304\nLocation:\n\nMumbai, IN\n\nFunction: Marketing/Digital\nAbout:\n\nVodafone Idea Limited is an Aditya Birla Group and Vodafone Group partnership. It is India’s leading telecom service provider. The Company provides pan India Voice and Data services across 2G, 3G and 4G platform. With the large spectrum portfolio to support the growing demand for data and voice, the company is committed to deliver delightful customer experiences and contribute towards creating a truly ‘Digital India’ by enabling millions of citizens to connect and build a better tomorrow. The Company is developing infrastructure to introduce newer and smarter technologies, making both retail and enterprise customers future ready with innovative offerings, conveniently accessible through an ecosystem of digital channels as well as extensive on-ground presence. The Company is listed on National Stock Exchange (NSE) and Bombay Stock Exchange (BSE) in India.\n\nWe're proud to be an equal opportunity employer. At VIL, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected and empowered to reach their potential and contribute their best.\n\nVIL's goal is to build and maintain a workforce that is diverse in experience and background but uniform in reflecting our Values of Passion, Boldness, Trust, Speed and Digital. Consequently, our recruiting efforts are directed towards attracting and retaining best and brightest talents. Our endeavour is to be First Choice for prospective employees.\n\nVIL ensures equal employment opportunity without discrimination or harassment based on race, colour, religion, creed, age, sex, sex stereotype, gender, gender identity or expression, sexual orientation, national origin, citizenship, disability, marital and civil partnership/union status, pregnancy, veteran or military service status, genetic information, or any other characteristic protected by law.\n\nVIL is an equal opportunity employer committed to diversifying its workforce.\n\nJob Purpose\n\nThis role drives the prioritisation of network investments for the organization with a view to optimizing RoI based on demand projections and driving Smartphone market share in the industry\n5G Site planning—Identify towns and sites for rollout ensuring maximization of revenue\nTo smoothen the customer experience and better commercial extraction across touch points for mobile broadband, VoLTE through Automation\nWork with technology partners like Facebook for more customer and network insights for higher ROI on investments and Business prioritization\nManage Data portfolio and identify opportunities along with business case development\n\nKey Result Areas/Accountabilities\n\nLead the commercially prioritised network rollout in collaboration with Network, Finance and Circle teams\nTranslate Commercial Strategy input into Mobile Network Investments for revenue maximization and customer retention\nOwn the 3G Refarming programme on behalf of Corporate Marketing\nDrive network experience management for Data in collaboration with the Network team.\nBy understanding the pain points of customer journeys for mobile broadband and VoLTE services smoothen them out by coordinating with various stakeholders and automation\nUsing analytics predict the geographies where telecom industry would grow faster to rest and ensure the organization is well placed to major share of the growth\nCoordinate with network planning team to align the technological investments are in line with business needs\nTo prepare the annual operating plan for mobile broadband vertical\nTrack the achievement against the AOP and highlight if any course correction or intervention required\n\nCore Competencies, Knowledge, Experience\n\nStrong stakeholder management. Competent and confident in relationship building\nProven ability to manage and work with cross-functional teams in a matrix\n\nenvironment\n\nProject management experience, experience leading and executing multiple projects\nStrong in business analytics and working with large data sets\nUnderstanding of telecom networks and related technologies\nGood understanding of the eco-system enabling Internet adoption\n(Devices, Content, Networks and Pricing)\nMBA and/or Engineering background will have added advantage\nhowever not necessary\nAn Innovation mindset\n\nMust have technical / professional qualifications\n\nMBA and/or Engineering background will have added advantage however not necessary\n\nVodafone Idea Limited (formerly Idea Cellular Limited)\nAn Aditya Birla Group & Vodafone partnership",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=300b22b79bd9b2bf",
        "JobType": [],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Assistant Manager Kitchen Stewarding",
        "Company": "Marriott International, Inc",
        "Location": "Mumbai, Maharashtra",
        "Description": "Additional Information\nJob Number25022853\nJob CategoryFood and Beverage & Culinary\nLocationJW Marriott Mumbai Sahar, IA Project Road, Mumbai, Maharashtra, India, 400099\nScheduleFull Time\nLocated Remotely?N\nPosition Type Management\n\nJOB SUMMARY\n\nAssists in the management of the daily kitchen utility operations and staff. Areas of responsibilities include dish room operations, night cleaning, back dock cleaning and maintenance, banquet plating and food running. Strives to continually improve guest and employee satisfaction while maintaining the operating budget.\n\nCANDIDATE PROFILE\n\nEducation and Experience\n\n• High school diploma or GED; 3 years experience in the procurement, food and beverage, culinary, or related professional area.\n\nOR\n\n• 2-year degree in Hotel and Restaurant Management, Hospitality, Business Administration, or related major; 1 year experience in the procurement, food and beverage, culinary, or related professional area.\n\nCORE WORK ACTIVITIES\n\nAssisting in Managing Day-to-Day Operations\n\n• Orders and manages necessary supplies. Verifies that workers have supplies, equipment, tools, and uniforms necessary to do their jobs.\n\n• Schedules events, programs, and activities, as well as the work of others.\n\n• Monitors the inflow of ordered materials and the maintenance of current materials.\n\n• Conducts china, glass and silver inventories.\n\n• Controls inventories of food, equipment, smallware, and liquor, and report shortages to designated personnel.\n\n• Inspects supplies, equipment, and work areas in order to verify efficient service and conformance to standards.\n\n• Investigates reports and follows-up on employee accidents.\n\n• Manages all equipment, china, glass and silver (e.g., adequate clean supplies of each).\n\n• Follows loss prevention policies to prevent accidents and control costs.\n\n• Enforces proper cleaning routines for serviceware, equipment, floors, etc.\n\n• Enforces proper use and cleaning of all dish room machinery.\n\n• Verifies all food holding and transport equipment is in working order.\n\n• Verifies compliance with all applicable laws and regulations.\n\n• Verifies compliance with food handling and sanitation standards.\n\n• Informs and/or updates the executives, the peers and the subordinates on relevant information in a timely manner.\n\nAssisting in Leading Kitchen Team\n\n• Utilizes interpersonal and communication skills to lead, influence, and encourage others; advocates sound financial/business decision making; demonstrates honesty/integrity; leads by example.\n\n• Assists with management of employees and management of all day-to-day operations. Understands employee positions well enough to perform duties in employees' absence.\n\n• Verifies and assists with maintaining the productivity level of employees.\n\n• Serves as a role model to demonstrate appropriate behaviors.\n\n• Achieves and exceeds goals including performance goals, budget goals, team goals, etc.\n\n• Celebrates successes by publicly recognizing the contributions of team members.\n\n• Encourages and builds mutual trust, respect, and cooperation among team members.\n\n• Communicates performance expectations in accordance with job descriptions for each position.\n\n• Establishes and maintains open, collaborative relationships with employees.\n\n• Participates in the management of department's controllable expenses to achieve or exceed budgeted goals.\n\n• Strives to improve service performance.\n\n• Solicits employee feedback.\n\n• Understands the impact of department's operation on the overall property financial goals and objectives.\n\nEnsuring Exceptional Customer Service\n\n• Attends meetings and communicates with executive, peers, and subordinates as an effort to improve quality of service.\n\n• Manages day-to-day operations, verifies that the quality, standards and meeting the expectations of the customers on a daily basis.\n\n• Emphasizes guest satisfaction during all departmental meetings and focuses on continuous improvement.\n\nAssisting in Managing and Conducting Human Resource Activities\n\n• Provides guidance and direction to subordinates, including setting performance standards and monitoring performance.\n\n• Assists with recruiting, interviews, hiring and promoting employees in the organization.\n\n• Trains employees in safety procedures.\n\n• Provides feedback to individuals based on observation of service behaviors.\n\n• Reviews employee satisfaction results to identify and address employee problems or concerns.\n\n• Verifies that property policies are administered fairly and consistently.\n\n• Verifies that utility staff is properly trained regarding sanitation, equipment handling and chemical usage.\n\n• Participates in employee progressive discipline procedures.\n\nMarriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law.\n\nMarriott Hotels strive to elevate the art of hospitality, innovating at every opportunity while keeping the comfort of the oh-so-familiar all around the globe. As a host with Marriott Hotels, you will help keep the promise of “Wonderful Hospitality. Always.” by delivering thoughtful, heartfelt, forward-thinking service that upholds and builds upon this living legacy. With the name that’s synonymous with hospitality the world over, we are proud to welcome you to explore a career with Marriott Hotels. In joining Marriott Hotels, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you.\n\nJW Marriott is part of Marriott International's luxury portfolio and consists of more than 100 beautiful properties in gateway cities and distinctive resort locations around the world. JW believes our associates come first. Because if you’re happy, our guests will be happy. JW Marriott associates are confident, innovative, genuine, intuitive, and carry on the legacy of the brand’s namesake and company founder, J.Willard Marriott. Our hotels offer a work experience unlike any other, where you’ll be part of a community and enjoy true camaraderie with a diverse group of co-workers. JW creates opportunities for training, development, recognition and most importantly, a place where you can pursue your passions in a luxury environment with a focus on holistic well-being. Treating guests exceptionally starts with the way we take care of our associates. That’s The JW Treatment™. In joining JW Marriott, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=c94af1aa5c014bac",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Creative Copywriter",
        "Company": "Kaftanize Retails",
        "Location": "Andheri, Mumbai, Maharashtra",
        "Description": "Job Title: Creative Copywriter\n\nLocation: Andheri East, Mumbai\n\nCompany: Kaftanize\n\nAbout Us:\n\nAt KAFTANIZE, we believe that fashion is more than just clothing—it's an expression of individuality and creativity. We are a cutting-edge fashion brand known for our innovative designs and commitment to quality. We are currently seeking a talented Creative Copywriter to join our dynamic team and help us tell our brand story through compelling and engaging content.\n\n\n\nJob Description:\n\nAs a Creative Copywriter, you will be responsible for crafting captivating copy that resonates with our target audience and enhances our brand identity. You will work closely with our marketing and design teams to create engaging content for various platforms, including our website, social media, email / whatsapp campaigns, and marketing materials.\n\nKey Responsibilities:\n\n- Develop creative and persuasive copy for product descriptions, promotional materials, social media posts, and email newsletters.\n\n- Collaborate with the marketing team to create and execute content strategies that align with brand goals and campaigns.\n\n- Conduct research to ensure content is relevant, on-trend, and resonates with our target audience.\n\n- Edit and proofread all copy to maintain high standards of quality and consistency in brand voice.\n\n- Brainstorm and contribute ideas for marketing campaigns, promotions, and new product launches.\n\n- Monitor and analyze content performance metrics to optimize future copy and engagement strategies.\n\n- Stay up-to-date with industry trends, competitor activities, and emerging digital marketing strategies.\n\nQualifications:\n\n- Bachelor’s degree in English, Communications, Marketing, or a related field.\n\n- Proven experience as a copywriter, preferably in the fashion or lifestyle sectors.\n\n- Exceptional writing, editing, and proofreading skills with a strong portfolio of work.\n\n- Ability to adapt tone and style to suit different platforms and audiences.\n\n- Strong understanding of digital marketing and social media trends.\n\n- Excellent communication and collaboration skills.\n\n- Passion for fashion and a keen eye for detail.\n\nWhat We Offer:\n\n- Opportunity to work with a creative and passionate team in the fashion industry.\n\n- A collaborative and dynamic work environment.\n\n- Flexibility in work hours.\n\n- Potential for career growth and development within the company.\n\n- Employee discounts on our products.\n\nHow to Apply:\n\nIf you’re ready to bring your creativity to KAFTANIZE and help shape our brand voice, we’d love to hear from you! Please submit your resume, a cover letter, and a portfolio showcasing your writing samples.\n\n\n\nApplication Deadline: 17.02.2025\n\nJoin us at KAFTANIZE and help us tell our story through your words! We look forward to reviewing your application!\n\nJob Types: Full-time, Fresher\n\nPay: ₹13,945.88 - ₹30,000.00 per month\n\nSchedule:\n* Day shift\n\n\n\nAbility to commute/relocate:\n* Andheri, Mumbai, Maharashtra: Reliably commute or planning to relocate before starting work (Required)\n\nExperience:\n* Copywriting: 1 year (Required)\n\nLanguage:\n* English (Required)\n\nWork Location: In person\n\n\nApplication Deadline: 17/02/2025",
        "Salary": "₹167,351 - ₹360,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=9609ce4cddd497d2",
        "JobType": [
            "Fresher",
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Continental Chef (Only From Mumbai)",
        "Company": "Ala mode Banquet Juhu",
        "Location": "Juhu, Mumbai, Maharashtra",
        "Description": "We seek a talented, experienced Continental Chef to lead our kitchen and create exceptional culinary experiences. The ideal candidate should have a strong command of culinary techniques, and be able to inspire and motivate a team.\n\n*Key Responsibilities:*\n* *Menu Development:* Create and develop innovative, seasonal continental menus showcasing your culinary expertise.\n* *Kitchen Management:* Oversee all kitchen operations, including food preparation, plating, and sanitation.\n* *Team Leadership:* Manage and mentor a team of kitchen staff, providing training, guidance, and support.\n* *Quality Control:* Ensure the highest standards of food quality and presentation.\n* *Cost Control:* Manage food costs and inventory efficiently to maximize profitability.\n\n*Qualifications and Skills:*\n* *Culinary Education:* Culinary degree or equivalent experience.\n* *Experience:* Minimum 5 years of experience as a Continental Chef in a high-volume restaurant.\n* *Technical Skills:* Strong command of classical French and European cooking techniques.\n* *Creativity:* Ability to develop innovative and creative dishes.\n* *Leadership:* Strong leadership skills and ability to motivate and inspire a team.\n* *Organization:* Excellent organizational and time management skills.\n\n*Additional Requirements:*\n* *Passion for Food:* A genuine passion for food and a commitment to excellence.\n* *Flexibility:* Ability to work in a fast-paced environment and adapt to changing demands.\n* *Communication:* Excellent communication skills, both verbal and written.\n\nJob Type: Full-time\n\nPay: ₹40,000.00 - ₹50,000.00 per month\n\nSchedule:\n* Day shift\n\n\n\nEducation:\n* Higher Secondary(12th Pass) (Preferred)\n\nExperience:\n* Chef: 5 years (Preferred)\n* total work: 5 years (Preferred)\n\nWork Location: In person",
        "Salary": "₹480,000 - ₹600,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=a6fef9935ce49098",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Office Executive",
        "Company": "Divya jyot projects LLP",
        "Location": "Mulund West, Mumbai, Maharashtra",
        "Description": "Job Title: Office Assistant Company Overview: Our company is seeking an organized and efficient office assistant to join our team. We are a dynamic and fast-paced company with a strong focus on client satisfaction. Our office assistant will play a vital role in ensuring the smooth operation of our office and supporting the work of our agents. Job Description: As an office assistant, you will be responsible for a variety of administrative tasks to support our real estate operations. This includes: Answering and directing phone calls, emails, and other inquiries Greeting clients and visitors to the office Maintaining and organizing files and records Assisting with scheduling appointments and meetings Managing inventory and ordering office supplies as needed Assisting with HR tasks such as scheduling interviews, maintaining employee records, and processing paperwork Requirements: High school diploma or equivalent; associate’s or bachelor’s degree preferred 3+ years of experience in an administrative or office support role; real estate experience a plus Strong organizational and time management skills Excellent communication and interpersonal skills Proficiency in Microsoft Office (Word, Excel, PowerPoint, Outlook) Ability to work independently and as part of a team Professional and positive attitude We offer a competitive salary and benefits package, as well as opportunities for growth and advancement within the company. If you are a self-motivated, detail-oriented individual with a passion for real estate, we encourage you to apply for this exciting opportunity.\n\nJob Type: Full-time\n\nPay: ₹22,000.00 - ₹35,000.00 per month\n\nSchedule:\n* Day shift\n\n\n\nExperience:\n* Management: 3 years (Required)\n\nWork Location: In person",
        "Salary": "₹264,000 - ₹420,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=5f7c2b2ace385067",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Customer Success Manager",
        "Company": "ekincare",
        "Location": "Mumbai, Maharashtra",
        "Description": "Overview:\n\nA key, client-facing role that needs high energy and passion for growing business and making an impact by building strong relationships with the clients, win their trust, by being a consultant of employee wellness and wellbeing.\n\nAs a Client Success Manager, you will work closely with our clients to help them adopt all areas of our product while delivering insights and recommendations that result in measurable client value. With the help of supporting teams at ekincare, you will ensure high customer engagement and achieve defined success metrics.\n\nRole: Customer Success Manager\nDesignation: Associate Manager\nLocation: Bangalore, Mumbai, Pune\nReporting to: Regional Head – Customer Success\n\nResponsibilities:\n\nDevelop and manage clients portfolios\nSustain business growth and profitability by maximizing value\nBe the bridge and the only source of the information exchange between the client and the organization\nAnalyze customer data to improve customer experience\nHold product demonstrations for customers\nEvaluate and improve tutorials and other communication infrastructure\nHandle and resolve customer requests and complaints\nEnsure client satisfaction and retention\nCollaborate cross-functionally with Sales, Marketing, Product, and Operations teams seamlessly to achieve customer satisfaction\nMinimize customer churn\nAid in product design and development\n\nThe successful applicant:\n\nMinimum 2 years of relevant experience is must\nMBA graduate/Masters pursuing from any university/business school/ top college\nExcellent communication and presentation skills\nProject Management Ability and a Proactive Approach\nShould be open and to work in the field for in-person client meetings/events\n\nCareer opportunities and benefits:\n\nPlay a key role in a successful high-growth startup\nBe at the forefront of new-age health-tech\nEnjoy attractive compensation, incentives, esops, health and fitness membership benefits\n\nAbout Company:\n\nJoin the fastest-growing health benefits platform in India. ekincare is a Series B funded startup, Operating in one of the few industries with tailwinds from COVID-19. We are at the intersection of health & insure-tech, targeting South East Asia's multi-billion-dollar corporate health benefits market. Trusted by 100s of companies like LinkedIn, Nike, Netflix, Airbnb, S&P Global, D'Mart etc., our predictive and personalized platform helps employers administer their health benefits efficiently, reduce health care costs by 20% and increase employees' engagement. Recognized for our innovations by NASSCOM (10 most innovative start-ups), Google for startups.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=3de0020c58926f17",
        "JobType": [],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Systems Administrator, RES",
        "Company": "Halliburton",
        "Location": "Mumbai, Maharashtra",
        "Description": "We are looking for the right people — people who want to innovate, achieve, grow and lead. We attract and retain the best talent by investing in our employees and empowering them to develop themselves and their careers. Experience the challenges, rewards and opportunity of working for one of the world’s largest providers of products and services to the global energy industry.\n\nJob Duties and Qualifications\nUnder general supervision, is responsible for complete system administration duties for global Real Estate management system(s), including end user support. Maintains data integrity and consistency within the system by monitoring various data fields based on defined criteria. Responsible for the integrity of hard copy files where necessary. Designs, publishes, and maintains standard systems reports, and workflows. Performs routine maintanence processes to assure both system and data integrity. Job tasks, correctly performed, impact indirectly on efficiency, and Real Estate Services (RES) operations. Skills are typically acquired through 3 years of experience in data management which includes experience in general real property areas. Undergraduate degree in business administration is preferred but not required.\n\nHalliburton is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, disability, genetic information, pregnancy, citizenship, marital status, sex/gender, sexual preference/ orientation, gender identity, age, veteran status, national origin, or any other status protected by law or regulation.\n\nLocation\n\nOberoi Garden City, Mumbai, Monaghan, 400063, India\n\nJob Details\n\nRequisition Number: 196604\nExperience Level: Entry-Level\nJob Family: Support Services\nProduct Service Line: Real Estate Services\nFull Time / Part Time: Full Time\n\nAdditional Locations for this position:\n\nCompensation Information\nCompensation is competitive and commensurate with experience.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=9229e456b7b81eee",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "HR Executive",
        "Company": "Astitva Multipurpose Services (OPC) Pvt. Ltd.",
        "Location": "Vikhroli, Mumbai, Maharashtra",
        "Description": "*Key & Responsibilities *\n\n*Team Leadership:*\n* Lead and mentor a team of HR professionals, fostering a collaborative and high- performance culture.\n* Set clear performance goals and provide regular feedback to team members.\n\n*Recruitment Strategy:*\n* Collaborate with HR Recruiters to develop effective sourcing and selection strategies that attract top talent in the industry.\n\n*Training and Development:*\n* Work with HR Trainers to design and implement comprehensive training programs that ensure employees are equipped with the necessary skills to excel in their roles.\n* Focus on compliance training and client specific training to meet industry standards and client requirements.\n\n*Payroll Management:*\n* Ensure accurate and timely payroll processing by overseeing the HR Payroll team, with a keen understanding of industry specific compensation structures.\n* Address payroll related inquiries promptly and ensure compliance with all relevant regulations.\n\n*Policy Development:*\n* Develop and enforce HR policies and procedures that align with industry standards and comply with legal requirements, particularly within the context of government contracts.\n* Stay informed about changes in employment law and industry regulations to ensure organizational compliance.\n\n*Employee Relations:*\n* Promote a positive work environment through effective employee relations strategies, addressing concerns and managing conflict resolution.\n* Facilitate communication between management and staff, ensuring transparency and engagement.\n\n*Performance Management:*\n* Oversee the performance appraisal process, collaborating with department heads to align individual performance with organizational goals.\n* Implement performance improvement strategies to enhance overall employee productivity and satisfaction.\n\n*Reporting and Analytics:*\n* Analyze HR metrics and trends to inform decision making and improve HR initiatives.\n* Prepare comprehensive reports for senior management regarding HR activities, challenges, and opportunities.\n\n*Education & Experience*:\n* A bachelor’s degree in Human Resources, Business Administration, or a related field (required). A master’s degree is a plus.\n* 1 - 3 years of HR experience .\n\nJob Type: Full-time\n\nPay: ₹23,000.00 - ₹25,000.00 per month\n\nSchedule:\n* Day shift\n* Morning shift\n* Night shift\n* Rotational shift\n\n\n\nLanguage:\n* English (Preferred)\n\nWork Location: In person\n\n\nApplication Deadline: 12/02/2025",
        "Salary": "₹276,000 - ₹300,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=5af007a4a3777ca8",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Mgr, Property- Management",
        "Company": "Halliburton",
        "Location": "Mumbai, Maharashtra",
        "Description": "We are looking for the right people — people who want to innovate, achieve, grow and lead. We attract and retain the best talent by investing in our employees and empowering them to develop themselves and their careers. Experience the challenges, rewards and opportunity of working for one of the world’s largest providers of products and services to the global energy industry.\n\nJob Duties and Qualifications\n\nUnder broad direction, plans and manages the operation and maintenance of a small/medium-sized Real Estate Services (RES) Major Property Location (MPL) site, which may include office, laboratory, manufacturing, and/or warehouse facilities in multiple buildings, often in a campus setting. Develops, recommends, and, when approved, executes expense budget and capital plan for the site. Supervises through subordinate leaders a staff of up to 20 technical and craft employees with experience in facilities operation and maintenance. Also supervises outsourced services such as food services, janitorial, landscaping, and maintenance to achieve desired results. Serves as principal RES contact for all levels of corporate, business unit, and Shared Services employees at the site. Job role has budgetary type of accountabilities or directly impacts a revenue center's viability or its quality of service via personal contributions. Job role contributes directly to value creation. Skills are typically acquired through Completion of an undergraduate degree in business administration, architecture, or engineering and minimum of 5 years of experience in property management which includes experience in direct operations and maintenance of office and manufacturing facilities as well as successful internal relations and management experience.\n\nPROPERTY MANAGEMENT\n\nManage Facility, office / general administration, facility management and maintenance across locations\nConduct inspections and audits, update licenses and permits and liaise with government bodies for compliance and permits for facility operations\nIdentify and mitigate facility risks, manage contracts/vendors and agreements to ensure adherence with company business practice and policies\nMaintain a secure environment by controlling access to the facility through use of appropriate security measures\nOversee property management activities\nImplement sustainable practices, ensure workplace safety, and oversee security measures\nKnowledge, Skills, and Abilities\nGeneral Administration / Facility Management\nVendor Management\nCompliance and Risk Management\nBudgeting/Forecasting\nFacility Security management\nStrategic Planning\nOperational Efficiency\nStakeholder Collaboration\n\nExperience: 5 to 10 years\n\nWork Location: Kakinada- Andhra Pradesh\n\nEducation: Minimum Graduate\n\nHalliburton is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, disability, genetic information, pregnancy, citizenship, marital status, sex/gender, sexual preference/ orientation, gender identity, age, veteran status, national origin, or any other status protected by law or regulation.\n\nJob Details\n\nRequisition Number: 194296\nExperience Level: Experienced Hire\nJob Family: Support Services\nProduct Service Line: Real Estate Services\nFull Time / Part Time: Full Time\n\nCompensation Information\nCompensation is competitive and commensurate with experience.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=1f3dde5301cef6c1",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Housekeeping Supervisor",
        "Company": "Talent Corner HR Services Private Limited",
        "Location": "Powai, Mumbai, Maharashtra",
        "Description": "*Job Role:*\n\n· Take care of in-room housekeeping & common area cleaning both (in-room is prime, common area is small).\n\n· Staff planning, room allocation, workload & shift management, staff duty rosters.\n\n· Daily briefing, setting daily goals, effective supervision.\n\n· Daily / Periodic / Surprise room inspections.\n\n· Laundry management.\n\n· Maintain highest quality control.\n\n· Handling guest communication for day-to-day tasks, guest grievances, troubleshooting.\n\n· Checkout room inspection, reporting missing items or damages promptly, lost &found.\n\n· In-room inspection for upkeep of all amenities and facilities, reporting the issues, faults promptly.\n\n· Stock management, optimum procurement and stock-keeping of supplies in timely manner.\n\n· Implement continuous improvement, setting highest standards for hygiene, cleanliness, and property upkeep, and maintain that in long term.\n\n· Develop and implement better cleaning protocols and standards.\n\n· Hiring, training, and nurturing of staff.\n\n· Prepare / improve process manuals, SOPs.\n\n· Data record keeping in real time, prepare daily/weekly reports, management reporting.\n\n*Skills:*\n\n· Prior experience in Housekeeping in Hospitality Industry is must.\n\n· Experience of In-room housekeeping in hotels or any Residential facilities is preferred (but not mandatory).\n\n· Excellent knowledge of cleaning techniques, materials, and tools.\n\n· Conversational English skills (verbal and written).\n\n· Basic knowledge of MS Excel, Word, hands-on with general PC and software usage.\n\n· Multi-tasking, good in team management.\n\nJob Types: Full-time, Permanent\n\nPay: ₹20,000.00 - ₹25,000.00 per month\n\nBenefits:\n* Health insurance\n* Provident Fund\nSchedule:\n* Rotational shift\n\n\n\nApplication Question(s):\n* How much experience you have in Housekeeping:\n* Your current salary per month:\n* Your expected salary per month:\n* Are you ok for Powai location:\n\nWork Location: In person",
        "Salary": "₹240,000 - ₹300,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=6f8e47139b165de1",
        "JobType": [
            "Permanent",
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "PR Manager ( Female )",
        "Company": "Advent Recruiters",
        "Location": "CBD Belapur, Navi Mumbai, Maharashtra",
        "Description": "*PR and communication*\n\n*Key Deliverables :-*\n\n● Public Relations (PR) Manager to design and implement marketing strategies that cultivate our relationships with the media, engage our target audience and boost our brand awareness.\n\n● Set objectives for the PR team and monitor team members’ performance Maximize brand presence on various channels (e.g. web, TV and social media) Cultivate and maintain relationships with media and influential professionals.\n\n● Arrange interviews and press releases to promote our company and its products/services Ensure brand consistency in all advertising efforts Organize PR events to increase awareness.\n\n● Assign tasks and projects to the PR team Track and influence media coverage Report on PR campaigns’ results Manage sensitive issues to maintain the company's good reputation.\n\n● Excellent communication and presentation skills with confidence to serve as the company’s spokesperson Creative abilities\n\n● Team management skills-\n\n● Establish media relations by engaging with journalists representing key media organizations Crisis management and protecting the image of the organization.\n\n*Key capabilities :-*\n\n● Post Graduate in Mass communications/ PR/ Journalism\n\n● Proficient in Marathi, Hindi, English – verbal and written communication\n\n● People management\n\n● Positive attitude\n\n● Crisis management\n\n● Leadership skills and presentation skills\n\n● Solid experience coordinating successful PR campaigns\n\n● Expertise in different social networks, including Facebook and Twitter\n\nJob Type: Full-time\n\nPay: ₹50,000.00 - ₹67,000.00 per month\n\nSchedule:\n* Day shift\n\n\n\nApplication Question(s):\n* Where do you stay in Mumbai ?\n* What is your current CTC ?\n\nExperience:\n* total work: 6 years (Required)\n\nWork Location: In person",
        "Salary": "₹600,000 - ₹804,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=a69b4976bee5b68f",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "PR Executive",
        "Company": "Pink Sky HR Services",
        "Location": "Andheri, Mumbai, Maharashtra",
        "Description": "WFO- 5 days\n\nLocation: Andheri\n\n*Job Summary:*\n\nWe are seeking a passionate and trend-savvy *PR Executive* to join our beauty and fashion PR team. The ideal candidate will be responsible for creating and implementing PR strategies that enhance brand visibility, engage with influencers, and drive media coverage. This role requires a strong understanding of the beauty and fashion industry, excellent communication skills, and the ability to manage multiple projects.\n\n*Key Responsibilities:*\n* *Media Relations*: Cultivate and maintain relationships with beauty and fashion editors, journalists, and influencers to secure media placements and endorsements.\n* *Press Materials*: Write, edit, and distribute press releases, media kits, product sheets, and other PR materials that highlight new product launches, brand milestones, and events.\n* *Influencer Engagement*: Identify, build, and manage relationships with beauty and fashion influencers and brand ambassadors to amplify campaigns and promote products.\n* *Event Coordination*: Plan and execute brand events, such as product launches, fashion shows, and influencer meet-and-greets, ensuring they align with brand objectives and create media buzz.\n* *Trend Monitoring*: Stay up-to-date with beauty and fashion trends, competitor activities, and consumer insights, incorporating these into PR strategies.\n* *Digital PR*: Work with the social media team to develop online campaigns that support PR objectives, engage audiences, and monitor brand mentions.\n* *Product Placements*: Strategize product placements in media outlets, influencer content, and editorial pieces to drive brand awareness.\n* *Brand Storytelling*: Create and pitch compelling stories that resonate with audiences and reinforce brand values in beauty and fashion.\n* *Reporting and Analytics*: Track, analyze, and report on media coverage, campaign performance, and engagement to assess the impact of PR initiatives.\n\n*Key Qualifications:*\n* *Experience*: 2+ years of PR experience, preferably in beauty, fashion, lifestyle, or a related field.\n* *Education*: Bachelor’s degree in Public Relations, Communications, Fashion Marketing, or a related field.\n* *Communication Skills*: Strong written and verbal communication skills with a flair for storytelling and brand voice.\n* *Industry Knowledge*: Deep understanding of beauty and fashion trends, consumer preferences, and media landscape.\n* *Influencer Relations*: Experience working with beauty and fashion influencers, with a network of industry contacts being a plus.\n* *Organizational Skills*: Strong project management skills, attention to detail, and ability to juggle multiple tasks and meet deadlines.\n* *Social Media Insight*: Familiarity with social media platforms (Instagram, TikTok, YouTube) and how they can support PR efforts.\n* *Creativity*: Ability to develop creative PR concepts that resonate with audiences and differentiate the brand.\n\nJob Types: Full-time, Permanent\n\nPay: ₹13,572.60 - ₹60,853.92 per month\n\nSchedule:\n* Day shift\n\n\n\nExperience:\n* total work: 1 year (Preferred)\n\nWork Location: In person",
        "Salary": "₹162,871 - ₹730,247 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=89721dd6e2efd1bc",
        "JobType": [
            "Permanent",
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Steward",
        "Company": "Prince Cuisines Pvt. ltd.",
        "Location": "Charni Road, Mumbai, Maharashtra",
        "Description": "*Job Title: - Steward*\n\n*Location: - Outlet*\n\n*Salary: - 15000 PM to 18000 PM (Depending on candidates interview and current salary)*\n\n*Number of candidates: - 2*\n\n*Job Summary:*\n\nA Restaurant Steward is responsible for maintaining cleanliness and order in the dining and kitchen areas of a restaurant. This role involves managing table settings and ensuring that the restaurant environment meets hygiene and service standards.\n\n*Job Responsibilities:*\n* Cleaning and setting tables and placing seasonal decorations, candles, and table cloths.\n* Welcoming customers, seating them, serving them water or refilling their glasses, and delivering beverages from the bartender.\n* Keeping menus clean and presenting them to customers.\n* Stocking wait staff serving stations with napkins, utensils, trays, and condiments, and assisting the wait staff with all aspects of service.\n* Clearing tables and preparing them for the next customers.\n* Assisting in cleaning and opening or closing tasks.\n* Scraping food from dirty dishes, pots, pans, plates, flatware, and glasses, washing dirty dishes, and putting them away.\n* Assisting with sweeping, mopping, and polishing the restaurant, bar, kitchen, and equipment.\n* Assisting with unloading and storing stock.\n\n*Skills & Requirements:*\n* A high school diploma or equivalent.\n* Must meet the age limit for serving alcoholic beverages.\n* A friendly, polite, and courteous nature.\n* Strong customer service and team working skills.\n* Physical stamina to work long hours on your feet.\n* The flexibility to work shifts, nights, weekends, and holidays.\n* Strong communication and organizational skills.\n\nJob Types: Full-time, Permanent\n\nPay: ₹15,000.00 - ₹18,000.00 per month\n\nBenefits:\n* Provident Fund\nSchedule:\n* Rotational shift\n* Weekend availability\nSupplemental Pay:\n* Yearly bonus\n\n\n\nApplication Question(s):\n* Do you have experience of clearing tables and preparing them for next customer?\n* Do you have experience of cleaning and opening or closing tasks?\n* Do you have experience of scraping food from dirty dishes, pots, pans, plates, flatware, and glasses, washing dirty dishes, and putting them away?\n\nEducation:\n* Secondary(10th Pass) (Preferred)\n\nExperience:\n* Steward: 3 years (Required)\n\nWork Location: In person",
        "Salary": "₹180,000 - ₹216,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=bf7b94a05961cda9",
        "JobType": [
            "Permanent",
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Content Creator and Strategist",
        "Company": "YDigital",
        "Location": "Bandra, Mumbai, Maharashtra",
        "Description": "*Candidate having experience atleast 1+ yrs OR fresher but willing to learning ability\\*\\**\n\n\n\nA \"content creator and strategist\" role combines the responsibilities of developing a comprehensive content strategy, including identifying target audiences, setting content goals, and planning content distribution, with the hands-on creation of engaging content across various digital platforms, such as blog posts, social media updates, videos, and infographics, all while aligning with the brand voice and marketing objectives; essentially, they both plan the content roadmap and actively produce content to execute the strategy.\n\n\n\n*Required Skills:*\n\n\n\nStrong writing and editing skills\n\nUnderstanding of SEO principles\n\nVisual storytelling abilities\n\nData analysis and reporting skills\n\nProject management and organizational skills\n\nCreativity and ability to generate engaging content ideas\n\nKnowledge of social media platforms and marketing strategies\n\nProficiency with content management systems (CMS)\n\nJob Type: Full-time\n\nPay: ₹10,000.00 - ₹30,000.00 per month\n\nBenefits:\n* Cell phone reimbursement\nSchedule:\n* Day shift\nSupplemental Pay:\n* Performance bonus\n\nWork Location: In person",
        "Salary": "₹120,000 - ₹360,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=443100a3e26e935f",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "HR Manager",
        "Company": "Amigo Academy PVT LTD",
        "Location": "Ghatkopar, Mumbai, Maharashtra",
        "Description": "Role & responsibilities\n\nWe are seeking an experienced and dedicated HR Manager to join our HR Team. In this role, you will be responsible for full cycle recruitment efforts as well as providing operational HR support to the organization. The position requires a strategic mindset, strong interpersonal skills and a talent for identifying top performers.\n\nKey Responsibilities:\n\nRecruitment and Onboarding:\n\nDevelop and implement effective recruitment strategies to attract top talent\n\nCraft compelling job descriptions and postings for all vacancies\n\nSource and screen candidates through various channels (Job portals, social media, employee referrals etc.)\n\nCoordinate and participate in multi-stage interviews with the recruiters\n\nExtend job offer and negotiate compensation packages\n\nMaintain accurate candidate tracking and reporting metrics\n\nBuild and nurture a talent pipeline for future hiring needs\n\nEmployee Relations:\n\nOversee administration of employee benefits programs\n\nAdminister HR policies and procedures across the employee lifecycle\n\nHandle employee onboarding and off boarding process\n\nCoordinate and conduct new hire orientation and training programs\n\nAttendance and Leave Management:\n\nOversee the attendance and leave management system\n\nEnsure accurate tracking of employee attendance ad leave balances\n\nPayroll Processing:\n\nAssist in payroll process, ensuring accuracy and timeliness\n\nUtilize payroll software to maintain records and process payments\n\nPerformance Management:\n\nSupport performance management processes (Feedback, appraisals)\n\nAssist the organization in setting department wise performance goals and monitoring employee progress\n\nHR Compliance:\n\nMaintain accurate and up to date employee records and data\n\nEnsure legal compliance with labor laws and regulations\n\nEmployee Grievance Handling:\n\nAssist with employee relation issues, grievances and provide conflict resolutions\n\nProvide HR guidance and supports to the employees as needed\n\nFoster a positive working environment by promoting open communication an d addressing the employee issues promptly\n\nEmployee Engagement:\n\nOrganize and participate in employee engagement activities\n\nImplement initiatives to enhance employee satisfaction and retention\n\nPreferred candidate profile\n\nBachelors degree, MBA in HR\n\nMinimum 8-10 years of experience in recruitment and HR operations\n\nStrong knowledge of recruitment best practices, employment laws and HR policies\n\nExcellent verbal and written communication skills\n\nAbility to multi task and prioritize in a fast paced environment\n\nStrong problem solving and decision making capabilities\n\nHigh level of professionalism, discretion and ethical conduct\n\nJob Types: Full-time, Permanent\n\nPay: ₹500,000.00 - ₹600,000.00 per month\n\nBenefits:\n* Cell phone reimbursement\n* Provident Fund\nSchedule:\n* Day shift\n* Morning shift\n\n\n\nAbility to commute/relocate:\n* Ghatkopar, Mumbai, Maharashtra: Reliably commute or planning to relocate before starting work (Required)\n\nApplication Question(s):\n* Kindly let us know your Current CTC, Expected CTC & Notice Period\n\nEducation:\n* Master's (Required)\n\nExperience:\n* HR: 8 years (Required)\n* Team management: 4 years (Required)\n\nWork Location: In person",
        "Salary": "₹6,000,000 - ₹7,200,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=005367571c7cd92a",
        "JobType": [
            "Permanent",
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Office Assistant",
        "Company": "Clark Rubbers Limited",
        "Location": "Vikhroli, Mumbai, Maharashtra",
        "Description": "*Key Responsibilities:*\n* Answer phone calls, direct inquiries, and take messages as necessary.\n* Greet and assist visitors in a friendly and professional manner.\n* Maintain office supplies inventory and reorder supplies when necessary.\n* Prepare and organize documents, correspondence, and reports.\n* Manage and distribute incoming and outgoing mail and packages.\n* Perform data entry and maintain organized records and files (both physical and digital).\n* Handle basic office equipment maintenance, such as printers, copiers, and fax machines.\n* Assist with office organization, ensuring a clean, safe, and welcoming workspace.\n* Provide administrative support to other departments as needed.\n* Help with onboarding new employees by preparing office spaces and equipment.\n* Assist in event planning and coordination for company meetings or social gatherings.\n\n*Qualifications:*\n* HSC or Graduation (required)\n* Proven experience as an office assistant.\n* Proficiency in Microsoft Office Suite (Word, Excel, PowerPoint, Outlook) or similar software.\n* Basic knowledge of office equipment (printers, scanners, phones).\n* Strong organizational and time-management skills.\n* Excellent verbal and written communication skills.\n* Attention to detail and problem-solving ability.\n* Ability to prioritize tasks and work efficiently in a fast-paced environment.\n* A friendly, positive attitude and strong interpersonal skills.\n* Ability to work independently and as part of a team.\n\nJob Types: Full-time, Part-time, Fresher\n\nPay: ₹8,000.00 - ₹10,000.00 per month\n\nSchedule:\n* Day shift\nSupplemental Pay:\n* Overtime pay\n\n\n\nEducation:\n* Higher Secondary(12th Pass) (Preferred)\n\nExperience:\n* Microsoft Office: 1 year (Preferred)\n* total work: 1 year (Preferred)\n\nLanguage:\n* Hindi (Preferred)\n* English (Preferred)\n\nWork Location: In person",
        "Salary": "₹96,000 - ₹120,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=b218f8486281cf6f",
        "JobType": [
            "Part-time",
            "Fresher",
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Front office Manager- Automobile Industry",
        "Company": "Jiza Hiring Solutions",
        "Location": "Mumbai, Maharashtra",
        "Description": "Education: Degree/Diploma in Automobile Engineer\n\nA Front Office Manager in the automotive industry is responsible for overseeing the day-to-day operations of a dealership's reception area, managing customer interactions, handling administrative tasks, ensuring smooth check-in and check-out processes, and maintaining a professional image, while primarily focusing on providing excellent customer service to potential and existing car buyers throughout their dealership experience. Key responsibilities may include:\n* *Customer Service:*\n* Greeting and welcoming customers upon arrival, providing initial information about dealership services.\n* Answering phone calls, scheduling appointments, and managing customer inquiries.\n* Addressing customer concerns and complaints promptly and professionally.\n* Managing customer flow, ensuring efficient check-in and check-out procedures.\n* *Administrative Tasks:*\n* Maintaining accurate customer records and data entry\n* Managing appointment schedules and follow-up communication\n* Preparing and distributing necessary paperwork and documents\n* Handling incoming and outgoing mail and packages\n* Monitoring office supplies and ordering replacements\n* *Team Management:*\n* Supervising and training front desk staff, including receptionists and service advisors\n* Assigning tasks and ensuring efficient workflow\n* Monitoring staff performance and providing feedback\n* *Operational Management:*\n* Maintaining a clean and organized front office environment\n* Ensuring compliance with dealership policies and procedures\n* Monitoring and managing front office budget\n* Reporting key metrics and performance data to management\n\nRequired Skills and Qualifications:\n* Excellent communication and interpersonal skills\n* Strong customer service orientation\n* Ability to multitask and prioritize effectively\n* Proficiency in Microsoft Office Suite\n* Knowledge of automotive dealership operations and procedures\n* Previous experience in a customer service role, preferably within the automotive industry\n* Leadership and supervisory skills\n\nJob Type: Full-time\n\nPay: ₹50,000.00 - ₹55,000.00 per month\n\nBenefits:\n* Cell phone reimbursement\n* Health insurance\n* Paid sick time\n* Provident Fund\n\n\n\nLanguage:\n* English (Preferred)\n\nWork Location: In person",
        "Salary": "₹600,000 - ₹660,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=0574e680f1e5dcd4",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Senior Research Analyst - Infra & Utilities",
        "Company": "Emkay",
        "Location": "Mumbai, Maharashtra",
        "Description": "Department\n\nInstitutional Research\n\nJob posted on\n\nJan 06, 2025\n\nEmployment type\n\nFull Time\n\n· An ideal candidate would –\n\no Use skills as a seasoned and experienced professional with a full understanding of industry practices and organizational policies and procedures\n\no Someone who can write independently and provides major contribution to Key Thematic reports.\n\no Provides Research coverage in Power on regular basis with excellent modelling and valuation skills\n\no Releases periodic research notes\n\no Regularly voted at several top domestic institution funds.\n\no responsible for active interaction with top management of power companies and advising institutional clients on investment opportunities\n\no Works with Corporate Access to arrange roadshows, one-on-one meeting and concalls for institutional investors with management of power sector.\n\no Handles client requests and provides useful insights during morning meetings with Sales and liaisons with company IR\n\nTeam management ability:\n\n· Mentors the associates to enrich their experience with Emkay and understanding of the sector with excellent managerial skills.\n\n· This role will require collaborative work approach with other members of the Institutional Research, Sales and Sales Trading teams.\n\n· Candidate should be willing to travel within India and outside India as required.\n\nOrganizational Relationships\n\n______________________________________________________________________________________\n\n· Institutional Research, Corporate access, Institutional Sales and Sales Trading and other business entities of Emkay\n\nSkills\n\n-\n\n· Strong financial and analytical skills\n\n· Ability to work under tight deadlines\n\n· Strong interpersonal skills\n\n· Ability to work in a team oriented environment\n\n· Strong written and verbal communication\n\nQualification\n\n-\n\n· MBA from premier institute or Chartered Accountant with CFA\n\nExperience\n\n-\n\n· Minimum 7-10 years of relevant work experience in Institutional Research.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=dca3e2f414ee27ca",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Lead - Digital Marketing",
        "Company": "SnapFind",
        "Location": "Mumbai, Maharashtra",
        "Description": "*Required Skills: Proficiency with Digital Marketing Tools (Google Analytics, SEO, Ads platforms and etc), Strong Analytical & Data-Driven Thinking, Excellent Communication & Stakeholder Management, Creative Problem-Solving & Innovation, Basic Web Development/UX Knowledge*\n\n*Experience: 10-15 years*\n\n*Salary: 15-20 LPA*\n\n*Note: Need local candidate from Mumbai and nearby location.*\n\n*- Candidate should be from Media, advertisement or Entertainment industry only.*\n\n*Age Criteria: Candidate age should not be more than 39 years*\n\n*Key Responsibilities:*\n\n*-* Oversee organization’s digital ecosystem including website, social media channels (50+ branded pages)\n- *Plan, strategize and execute all digital marketing*, including social media, influencers marketing, SEO/SEM, email, and display advertising campaigns.\n- *Drive revenue* through digital product monetization, sponsorship packages, and strategic partnerships while optimizing ROI across initiatives.\n- Create network of digital and tech agencies for specific projects. Manage these relationships effectively to ensure *high-quality deliverables and cost-efficiency.*\n- *Lead and mentor the digital marketing team* while fostering innovation, staying updated with industry trends, and managing external partnerships.\n- *Design and implement* innovative digital products and solutions that can be monetized through client partnerships\n- Work closely with the sales team to address digital queries, provide strategic digital solutions to clients, and participate in client meetings to offer digital expertise to drive revenue growth.\n- *Measure and report performance* of all *digital marketing campaigns,* and *assess against goals (ROI and KPIs)*\n- Brainstorm new and creative growth strategies\n- *Collaborate with internal* cross functional teams on multiple campaigns\n- *Collaborate* with agencies and other vendor partners\n- Evaluate emerging technologies.\n- Provide thought leadership and perspective for adoption where appropriate.\n\n*Key Requirements:*\n- *10+ years of experience in digital marketing*. Agency experience is preferred\n- Have a *postgraduate degree* in *Marketing, Business Administration* or related field.\n- *Expert proficiency in digital marketing tools* including Google Analytics, Search Console, SEO tools, social media management platforms, and digital advertising platforms (Google/Meta Ads).\n- *Strong understanding *of marketing automation, CRM systems, AI/ML applications, content management systems, email marketing platforms, and *basic web development/UX principles*\n- *Excellent communication skills* (both verbal and written) with the ability to articulate complex ideas clearly and persuasively.\n- Creative solution thinker with a passion for *digital innovation.*\n- *Strong analytical skills*, data-driven thinking, and a results-oriented approach.\n- Up-to-date with the latest trends and best practices in online marketing and measurement.\n- Strategic thinker with strong business acumen and negotiation skills.\n- *Strong stakeholder management* abilities, including experience collaborating effectively with sales teams.\n- *Adaptable and quick to learn new technologies *with an enthusiasm for continuous learning and professional growth.\n\n- Strong understanding of *marketing automation, CRM systems, AI/ML applications, and email marketing platforms.*\n\nJob Type: Full-time\n\nPay: ₹1,500,000.00 - ₹2,000,000.00 per year\n\n\n\nExperience:\n* total work: 10 years (Required)\n\nLocation:\n* Mumbai, Maharashtra (Required)\n\nWork Location: In person",
        "Salary": "₹1,500,000 - ₹2,000,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=147c16d052eb09a2",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Project Manager & Scrum Master - Bangalore | Mumbai - 9 to 12 Years",
        "Company": "Capgemini",
        "Location": "Mumbai, Maharashtra",
        "Description": "Job Description\n\nMinimum 9+ years of IT software Project Management experience\nAt least 3+ years Scrum Master experience\nShould have experience in facilitating daily stand-up, iteration planning, sprint review, and sprint retrospective\nShould be able to manage the engineering development projects and facilitates sprint releases\nShould have the experience to create or analyze business requirements documents and project timelines\nProactively identify and eliminate impediments and facilitate the flow\nMaintain team data in project management software like JIRA, to support estimates and execution\nStrong oral and written communication skills; excellent problem solving and analytical skills.\nShort Description\nProven ability to drive project planning and execution process and add value beyond just a task-oriented doer or project manager\nFamiliarity with systems development lifecycle (SDLC)\nGuides and coaches the Scrum Team on how to use Agile practices and principles to deliver high quality products and services to our customers.\nGets team to a high performing level by recognizing areas of strength and improvement and employing appropriate coaching and development techniques.\nResponsible for ensuring Scrum is understood and the team adheres to Scrum theory, practice, and guidelines.\nCoaches the Scrum team in self-organization, cross-functional skillset, domain knowledge and communicates effectively, both internally and externally working within the Scrum team.\nWorks with Scrum Team, as well as internal and external stakeholders, to influence and drive decision making and support organizational project or product teams.\nResolves team impediments with other Scrum Masters to increase the effectiveness of the application of Scrum in the organization.\nEnsure to work on different metrics reports, weekly, monthly and maintain project artifacts.\nFacilitates and supports all scrum events: Sprint Planning, Daily Scrum, Sprint Review, and Sprint Retrospective.\nTrack overall project progress and keep informed all key stakeholders",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=4c2db885bba7eda8",
        "JobType": [
            "Permanent"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Sales Manager",
        "Company": "Marconix Sales Solutions Pvt. Ltd.",
        "Location": "Mumbai, Maharashtra",
        "Description": "*Sales Manager I*\n* *Description: *Way of Working - Office/Field - Employees will work full-time from their base location\n* *Role:* Sales Manager\n* *Salary: *CTC upto 4.4LPA (Including PLI)\n\n*Job Responsibilities:*\n* Serve as the primary point of contact for assigned client accounts, understanding their goals, needs, and challenges.\n* Develop account strategies to overcome the challenges and action plans to meet client objectives and maximize account growth as per the target\n* Conduct regular F2F business reviews with clients, discussing performance, identifying areas for improvement, and presenting new opportunities.\n* Track and analyze account performance, sales data, account funnel, and market trends to identify opportunities and challenges.\n* Drive business growth for newly onboarded partners by working on their basic hygiene and health metrics\n* Deliver Incremental Revenue from the assigned clients through monetization and commercial improvements.\n* Deliver incremental share for all assigned clients by strategic planning to dominate market share.\n* Maintaining a strong relationship with client, sales team and delivering best-in-class business NPS.\n* Collaborate with internal teams to coordinate and deliver exceptional service to clients, addressing any issues or concerns promptly.\n* Generate leads and proactively approach potential clients, presenting our value proposition and securing new partnerships.\n\n*Desired Candidate:*\n* Graduate/PG with excellent communication skills.\n* Good working knowledge and experience of sale (Field/inside) activities and all online marketing channels\n* Confident, Pleasing and a go-getter personality\n* Effective communication skills\n* Attitude & Aptitude for Sales\n* Should be a team player, working alongside people from all walks of life.\n* Analytical, good Excel skills.\n\n*Leadership and Influencing skills:* Identify, builds, and use a wide network of contacts with people at all levels, internally and externally. Achieves a good result through a well-planned approach.\n\n*Initiative & Flexibility:* Recognizes the need to adapt to change & implement appropriate solutions. Be able to identify opportunities and recommend/influence change to increase the effectiveness and success of campaigns.\n\n*Creativity & Initiative:* Demonstrate creativity & originality in their work and have the personal drive and initiative to bring about change and help drive the business forward.\n\n_Being the face of Marconix in the market and standing up for the values we believe in._\n\n*Key Skills Required:*\n* P&L Understanding\n* Market Research and Intelligence\n* Customer Lifetime Value\n* Business Development\n* Data Logic\n* Data Interpretation\n* Data Visualization\n* MS Excel\n* Data Analysis\n* Result Orientation\n* Managing Relationships\n* Conflict Management\n* Problem-Solving\n\n\"We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regards to race, colour, religion, sex, disability status, or any other characteristic protected by the law\"\n\nJob Types: Full-time, Permanent\n\nPay: Up to ₹440,000.00 per year\n\nSchedule:\n* Day shift\nSupplemental Pay:\n* Performance bonus\n\n\n\nExperience:\n* Sales Leader: 3 years (Required)\n* Sales Planning: 2 years (Required)\n* Sales Team management: 3 years (Required)\n\nLanguage:\n* English (Preferred)\n\nWork Location: In person",
        "Salary": "₹440,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=125304b9d0806637",
        "JobType": [
            "Permanent",
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Field Sales for Smart Automation Solutions",
        "Company": "Marconix Sales Solutions Pvt. Ltd.",
        "Location": "Mumbai, Maharashtra",
        "Description": "*Field Sales for Smart Automation Solutions*\n* *CTC* :INR 360000 - 400000 LPA. (Including PLI)\n* *Should join by*: Immediate\n* *Industry Type:* Home Automation & AV, Building Automation\n\n_We are seeking a dynamic and results-oriented Business Development Executive (BDE) to join our team. As a BDE focused on field sales for smart automation solutions, you will be responsible for driving revenue growth by identifying, acquiring, and managing new business opportunities. You will work closely with customers, prospects, and internal teams to understand their needs and provide tailored home automation solutions. This position requires a strong sales acumen, excellent communication skills, and a deep understanding of the home automation industry._\n\n*Responsibilities:*\n* Identify and prospect potential customers in the residential sector who could benefit from smart automation solutions.\n* Build and maintain strong relationships with key decision-makers, architects, builders, contractors, and other relevant stakeholders in the industry.\n* Conduct in-depth consultations with customers to understand their requirements, pain points, and objectives for smart automation.\n* Present and demonstrate our smart automation solutions effectively, showcasing their features, benefits, and value proposition.\n* Develop and execute sales strategies and plans to achieve sales targets and revenue goals.\n* Prepare and deliver compelling sales proposals, negotiate contracts, and close deals.\n* Collaborate with internal teams, including engineering, installation, and support, to ensure seamless project delivery and customer satisfaction.\n* Stay up-to-date with industry trends, technologies, and competitors to identify new market opportunities and maintain a competitive edge.\n* Provide regular sales forecasts, reports, and updates to the sales manager or senior management.\n* Attend trade shows, conferences, and industry events to network and promote our home automation solutions.\n\n*Qualifications and Requirements:*\n* Should have a minimum of 1+ years of relevant experience and 2+ years of total work experience.\n* Bachelor's degree in Business, Sales, Marketing, or a related field. Relevant certifications will be a plus.\n* Proven track record of achieving sales targets and driving revenue growth in the home automation industry or a similar field.\n* Strong understanding of smart automation technologies, including smart lighting, security systems, HVAC control, and audio/video integration.\n* Excellent interpersonal and communication skills, both verbal and written.\n* Ability to build and maintain relationships with clients and key stakeholders.\n* Self-motivated and results-driven with a proactive approach to sales.\n* Solid presentation and negotiation skills, with the ability to persuade and influence others effectively.\n* Exceptional problem-solving and decision-making abilities.\n* Experience with CRM software and sales tools for pipeline management and reporting.\n* Willingness to travel extensively within the assigned territory.\n* Sales experience with an electrical background is an added advantage.\n* Should have experience with selling automation / smart automation products.\n\n*Skills & Experience profile:*\n* *Must Have:* Growth Oriented, Positive Attitude, Excellent Communication, Persistent Follow-up; Experience in selling technology solution (Min. 1 Years).\n* *Good to Have:* Aggressive Sales Approach, Computer & Internet Knowledge; Experience in Home Automation or Home Theatre industry. Good Written and verbal Communication.\n\nCTC :INR 360000 - 500000 LPA.\n\nShould join by: Immediate\n\nIndustry Type: Home Automation & AV, Building Automation\n\nJob Types: Full-time, Permanent\n\nPay: Up to ₹400,000.00 per year\n\nSchedule:\n* Day shift\nSupplemental Pay:\n* Performance bonus\n\n\n\nExperience:\n* Field sales: 2 years (Required)\n\nWork Location: In person",
        "Salary": "₹400,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=d250657892a666ac",
        "JobType": [
            "Permanent",
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Assistant Sales Manager (Reactive)",
        "Company": "Marriott International, Inc",
        "Location": "Mumbai, Maharashtra",
        "Description": "Additional Information\nJob Number25022839\nJob CategorySales & Marketing\nLocationJW Marriott Mumbai Sahar, IA Project Road, Mumbai, Maharashtra, India, 400099\nScheduleFull Time\nLocated Remotely?N\nPosition Type Management\n\nJOB SUMMARY\n\nThe position assists with the soliciting and handling of sales opportunities. Ensures business is turned over properly and in a timely fashion for proper service delivery. Assists in leading all day-to-day activities related to sales with a focus on building long-term, value-based customer relationships that enable achievement of sales objectives. Achieves personal sales goals.\n\nCANDIDATE PROFILE\n\nEducation and Experience\n\n• 2-year degree from an accredited university in Business Administration, Marketing, Hotel and Restaurant Management, or related major; 2 years experience in the sales and marketing or related professional area.\n\nOR\n\n• 4-year bachelor's degree in Business Administration, Marketing, Hotel and Restaurant Management, or related major; no work experience required\n\nCORE WORK ACTIVITIES\n\nBuilding Successful Relationships that Generate Sales Opportunities\n\n• Works collaboratively with off-property sales channels to ensure sales efforts are coordinated, complementary and not duplicative.\n\n• Builds and strengthens relationships with existing and new customers to enable future bookings. Activities include participating on sales calls, entertainment, FAM trips, trade shows, etc.\n\n• Develops relationships within community to strengthen and expand customer base for sales opportunities.\n\n• Assists with managing and developing relationships with key internal and external stakeholders.\n\n• Provides accurate, complete and effective turnover to Event Management.\n\nManaging Sales Activities\n\n• Participates in sales calls with members of sales team to acquire new business and/or close on business.\n\n• Supports the operational aspects of business booked (e.g., generating proposal, writing contract, customer correspondence).\n\nUsing Knowledge of Market Trends and Target Customer Information to Maximize Revenue\n\n• Identifies new business to achieve personal and location revenue goals.\n\n• Understands the overall market - competitors’ strengths and weaknesses, economic trends, supply and demand etc. and knows how to sell against them.\n\n• Assists in closing the best opportunities for the location based on market conditions and location needs.\n\n• Gains understanding of the location’s primary target customer and service expectations; serves the customer by understanding their business, business issues and concerns, to offer better business solution.\n\nProviding Exceptional Customer Service\n\n• Supports the company’s service and relationship strategy, driving customer loyalty by delivering service excellence throughout each customer experience.\n\n• Services our customers in order to grow share of the account.\n\n• Executes and supports the company’s customer service standards.\n\n• Provides excellent customer service consistent with the daily service basics of the company.\n\n• Sets a positive example for guest relations.\n\n• Interacts with guests to obtain feedback on product quality and service levels.\n\nMarriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law.\n\nMarriott Hotels strive to elevate the art of hospitality, innovating at every opportunity while keeping the comfort of the oh-so-familiar all around the globe. As a host with Marriott Hotels, you will help keep the promise of “Wonderful Hospitality. Always.” by delivering thoughtful, heartfelt, forward-thinking service that upholds and builds upon this living legacy. With the name that’s synonymous with hospitality the world over, we are proud to welcome you to explore a career with Marriott Hotels. In joining Marriott Hotels, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you.\n\nJW Marriott is part of Marriott International's luxury portfolio and consists of more than 100 beautiful properties in gateway cities and distinctive resort locations around the world. JW believes our associates come first. Because if you’re happy, our guests will be happy. JW Marriott associates are confident, innovative, genuine, intuitive, and carry on the legacy of the brand’s namesake and company founder, J.Willard Marriott. Our hotels offer a work experience unlike any other, where you’ll be part of a community and enjoy true camaraderie with a diverse group of co-workers. JW creates opportunities for training, development, recognition and most importantly, a place where you can pursue your passions in a luxury environment with a focus on holistic well-being. Treating guests exceptionally starts with the way we take care of our associates. That’s The JW Treatment™. In joining JW Marriott, you join a portfolio of brands with Marriott International. Be where you can do your best work, begin your purpose, belong to an amazing global team, and become the best version of you.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=17cb37f3232e7075",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Accountant, Sr",
        "Company": "Halliburton",
        "Location": "Mumbai, Maharashtra",
        "Description": "We are looking for the right people — people who want to innovate, achieve, grow and lead. We attract and retain the best talent by investing in our employees and empowering them to develop themselves and their careers. Experience the challenges, rewards and opportunity of working for one of the world’s largest providers of products and services to the global energy industry.\n\nJob Duties and Qualifications\nUnder general supervision, applies knowledge of the company&aposs business systems, business processes and controls, including policies and procedures, relative to the location and department assigned. Demonstrates understanding of organizational structure and core businesses of the company and industry. Performs activities involving complex accounting reports and accounting analyses with related spreadsheets and applications input. Prepares and posts journal vouchers for complex accounting transactions. Reviews and monitors financial transactions for accuracy and timeliness. Researches and resolves complex accounting issues and transactions including related internal controls. Prepares, analyzes, and distributes financial results including variance explanations. Participates in multi-functional teams and develops project management skills. Demonstrates knowledge in moderately complex aspects of general accounting, internal controls, company policy, financial analysis and reporting, forecasting, and financial applications, as well as intermediate levels of proficiency with industry and company acumen. Minimum of three (3) years of experience in accounting related roles required. Requires completion of an undergraduate degree in accounting, business, or related field. Knowledge of US GAAP or country-specific accounting principles required.\n\nHalliburton is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, disability, genetic information, pregnancy, citizenship, marital status, sex/gender, sexual preference/ orientation, gender identity, age, veteran status, national origin, or any other status protected by law or regulation.\n\nLocation\n\nSanta Janabai Road, Mumbai, Monaghan, 400057, India\n\nJob Details\n\nRequisition Number: 190640\nExperience Level: Experienced Hire\nJob Family: Support Services\nProduct Service Line: [[division]]\nFull Time / Part Time: Full Time\n\nAdditional Locations for this position:\n\nCompensation Information\nCompensation is competitive and commensurate with experience.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=4f3728f240ca0256",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Business Development Manager (BDM)",
        "Company": "Pactech solutions llp",
        "Location": "Mumbai, Maharashtra",
        "Description": "*Company Name: Pactech Solutions LLP *\n\n*Job Title: Business Development Manager - Sales Coordination*\n\n*Job Location: Goregaon west *\n\n*Department: Business Development / Sales*\n\n*Company Description*\n\nPactech Solutions is a premier engineering marketing organization in Mumbai, India, specializing in providing packaging solutions to Pharma, FMCG, Cosmetics & allied sectors. The company focuses on delivering customized and value-based solutions to meet customer needs, with a strong emphasis on customer-centricity. Our team of engineers is dedicated to developing tailored packaging solutions that address specific customer requirements.\n\n*Job Overview:*\n\nWe are looking for a motivated and proactive Business Development Manager with a strong focus on Sales Coordination to help drive our sales efforts and business growth. The role will involve not only identifying new business opportunities but also working closely with the sales team to ensure smooth operations, effective lead conversion, and timely execution of sales plans. The ideal candidate will have a blend of business development and sales coordination experience, exceptional organizational skills, and the ability to work cross-functionally to support sales initiatives.\n\n*Key Responsibilities:*\n\nBusiness Development:\n\nIdentify new business opportunities and build a strong sales pipeline through research, outreach, and networking.\n\nCultivate relationships with potential clients, partners, and key stakeholders to generate new leads and business.\n\nConduct market research to identify trends, competitors, and customer needs in the industry.\n\nCreate customized proposals, presentations, and pitches to potential clients.\n\nNegotiate contracts, pricing, and terms in alignment with business objectives.\n\nSales Coordination:\n\nServe as the primary liaison between the sales team and other departments (marketing, operations, product, etc.) to ensure seamless execution of sales strategies.\n\nCoordinate and track sales activities, ensuring that all leads, opportunities, and sales processes are effectively managed and followed up.\n\nEnsure all customer requirements, documents, and sales materials are provided promptly and accurately.\n\nOversee the preparation of sales presentations, proposals, quotes, and contracts in collaboration with the sales team.\n\nMonitor sales performance and provide support to the sales team in closing deals and managing accounts.\n\nTrack sales targets, performance, and KPIs to ensure sales goals are met.\n\nAssist with post-sales coordination, ensuring smooth transitions for customers from sales to account management or support teams.\n\nOrganize sales meetings, internal updates, and briefings to ensure alignment on sales objectives.\n\nAdministrative Support:\n\nMaintain and update customer information, sales pipeline, and opportunities in CRM software.\n\nCoordinate sales documentation, reporting, and administrative tasks to streamline the sales process.\n\nPrepare and submit regular reports on sales activity, progress, and results to management.\n\nSchedule and organize sales meetings, presentations, and client follow-ups.\n\n*Required Qualifications:*\n\nBachelor’s degree in Business Administration, Marketing, Sales, or a related field. An MBA is a plus.\n\n3-5 years of experience in business development, , or a similar role.\n\nJob Type: Full-time\n\nPay: ₹300,000.00 - ₹900,000.00 per year\n\nBenefits:\n* Health insurance\n* Life insurance\n* Paid sick time\n* Provident Fund\nSchedule:\n* Day shift\n* Fixed shift\n* Monday to Friday\nSupplemental Pay:\n* Overtime pay\n* Performance bonus\n\n\n\nLanguage:\n* English (Required)\n\nWork Location: In person",
        "Salary": "₹300,000 - ₹900,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=fa9826643ace887a",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Senior Business Development Manager",
        "Company": "Eye Mantra Hospital",
        "Location": "Mumbai, Maharashtra",
        "Description": "*Job Description: *Senior Business Development Manager\n\n*Job Type*: Full-time\n\n*Location*: Mumbai\n\n*About MantraCare*:\nMantraCare is a leading organization in the wellness and mental health industry, providing Employee Assistance Programs (EAP), wellness solutions, and therapeutic services to corporate clients worldwide. We are committed to delivering innovative and high-quality services to enhance employee well-being and organizational success.\n\n*Job Overview*:\nWe are looking for an experienced and motivated sales professional to join our team. This role involves identifying new business opportunities, managing client relationships, and driving sales for MantraCare’s wellness programs. The ideal candidate will be passionate about promoting mental health and wellness services, with a strong ability to network, build relationships, and close deals.\n\n*Key Responsibilities*:\n\n· Identify and develop new business opportunities through cold calls, emails, LinkedIn reach outs and networking at corporate events to generate new business.\n\n· Qualify prospects by presenting and promoting MantraCare’s wellness services and converting discussions into long-term business relationships.\n\n· Conduct product presentations and demos, addressing client needs and concerns effectively.\n\n· Cultivate and nurture long-term relationships with existing clients to foster loyalty and to ensure upsell or cross-sell opportunities.\n\n· Meet and exceed monthly and quarterly sales targets, ensuring consistent business growth.\n\n· Manage the end-to-end sales cycle, ensuring that client expectations are met and projects are aligned with business objectives\n\n· Collaborate with the marketing and customer success teams to ensure smooth onboarding and service delivery.\n\n· Regular update of sales activities and customer interactions using CRM software.\n\n· Prepare and deliver sales reports, forecasts, and market insights to the management team.\n\n· Stay updated on industry trends and competitors to identify opportunities for growth.\n\n*Requirements*:\n\n· Master’s in Business Administration with 5-10 years of experience in B2B sales, preferably in wellness/healthcare/service industries.\n\n· Proven track record of successfully generating leads, securing partnerships, and achieving sales targets in a competitive environment.\n\n· Experience in creating and executing growth strategies that align with industry-specific trends.\n\n· Excellent communication, presentation, and negotiation skills.\n\n· Ability to build and maintain strong client relationships and work effectively with cross-functional teams.\n\nJob Type: Full-time\n\nPay: ₹70,000.00 - ₹100,000.00 per month\n\nWork Location: In person",
        "Salary": "₹840,000 - ₹1,200,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=aaa7420a2b521753",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Assistant to Community Head",
        "Company": "Lawyantra",
        "Location": "Lower Parel, Mumbai, Maharashtra",
        "Description": "Job Summary:\n\n\\*\\*Females Only\\*\\*\n\nWe are seeking a dynamic, presentable, and highly motivated female professional to join our team as the Assistant to the Head of the Community. This role requires a versatile individual who excels in sales, possesses excellent communication skills, and maintains a positive attitude. The ideal candidate will be a team player, hardworking, and capable of supporting the Head of the Community in driving initiatives, fostering relationships, and achieving organizational goals.\n\nKey Responsibilities:\n\nExcellent in Communication, Fluency in English:\n\nAssist in identifying and pursuing new business opportunities to grow the community.\n\nSupport the development and execution of sales strategies to meet revenue targets.\n\nCommunication and Coordination:\n\nDraft and manage correspondence, reports, and presentations.\n\nRepresent the organization professionally in meetings, events, and networking opportunities.\n\nAdministrative Support:\n\nOrganize and maintain records, files, and databases.=\n\nCommunity Engagement:\n\nAssist in planning and executing community events, workshops, and initiatives.\n\nEngage with community members to understand their needs and provide feedback to the Head of the Community.\n\nPromote a positive and inclusive community culture.\n\nTeam Collaboration:\n\nWork closely with other team members to ensure seamless operations and achieve organizational objectives.\n\nFoster a collaborative and supportive work environment.\n\nQualifications:\n\nEducation: Under Grad/ Grad\n\nSkills:\n\nStrong sales and negotiation skills.\n\nExcellent verbal and written communication skills.\n\nProficiency in Microsoft Office Suite (Word, Excel, PowerPoint) and CRM tools.\n\nAbility to multitask, prioritize, and manage time effectively.\n\nAttributes:\n\nPresentable and professional demeanor.\n\nPositive attitude and strong work ethic.\n\nTeam player with the ability to work independently.\n\nHardworking, proactive, and results-driven.\n\nWhy Join Us?\n\nOpportunity to work in a dynamic and growing organization.\n\nCollaborative and supportive work environment.\n\nCompetitive salary and benefits package.\n\nProfessional development and growth opportunities.\n\nJob Type: Full-time\n\nPay: ₹20,000.00 - ₹30,000.00 per month\n\nSchedule:\n* Day shift\n\nWork Location: In person",
        "Salary": "₹240,000 - ₹360,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=0067bce0520e6f37",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Consultant, Advisors & Consulting Services, Strategy & Transformation",
        "Company": "Mastercard",
        "Location": "Mumbai, Maharashtra",
        "Description": "Our Purpose\n\nMastercard powers economies and empowers people in 200+ countries and territories worldwide. Together with our customers, we’re helping build a sustainable economy where everyone can prosper. We support a wide range of digital payments choices, making transactions secure, simple, smart and accessible. Our technology and innovation, partnerships and networks combine to deliver a unique set of products and services that help people, businesses and governments realize their greatest potential.\n\nTitle and Summary\n\nConsultant, Advisors & Consulting Services, Strategy & Transformation\n\nAdvisors & Consulting Services\n\nServices within Mastercard is responsible for acquiring, engaging, and retaining customers by managing fraud and risk, enhancing cybersecurity, and improving the digital payments experience. We provide value-added services and leverage expertise, data-driven insights, and execution. Our Advisors & Consulting Services team combines traditional management consulting with Mastercard’s rich data assets, proprietary platforms, and technologies to provide clients with powerful strategic insights and recommendations. Our teams work with a diverse global customer base across industries, from banking and payments to retail and restaurants.\n\nThe Advisors & Consulting Services group has five specializations: Strategy & Transformation, Performance Analytics, Business Experimentation, Marketing, and Program Management. Our Strategy & Transformation consultants lead clients through impactful decision-making as they tackle strategic, tactical, operational, and transformational business challenges. They apply a broad set of problem-solving techniques to improve the client’s overall strategy, performance, and operations.\n\nPositions for different specializations and levels are available in separate job postings. Please review our consulting specializations to learn more about all opportunities and apply for the position that is best suited to your background and experience: https://careers.mastercard.com/us/en/consulting-specializations-at-mastercard\n\nRoles and Responsibilities\n\nClient Impact\n\n· Provide creative input on projects across a range of industries and problem statements\n\n· Contribute to the development of strategies and programs for regional and global clients by leveraging data and technology solutions to unlock client value\n\n· Collaborate with Mastercard team to understand clients’ needs, agenda, and risks\n\n· Develop working relationship with client analysts/managers, and act as trusted and reliable partner\n\nTeam Collaboration & Culture\n\n· Collaborate with senior project delivery consultants to identify key findings, prepare effective presentations, and deliver recommendations to clients\n\n· Independently identify issues in defined area of analysis, and structure and synthesize own analysis to highlight relevant findings\n\n· Lead internal and client meetings, and contribute to project management\n\n· Contribute to the firm's intellectual capital\n\n· Receive mentorship from consulting leaders for professional growth and development\n\nQualifications\n\nBasic qualifications\n\n· Undergraduate degree with work experience in consulting, corporate strategy, business intelligence, business line management, or product management\n\n· Relevant client or internal stakeholder management experience\n\n· Logical, structured thinking, and affinity for numerical analysis\n\n· Advanced Word, Excel, and PowerPoint skills\n\n· Ability to perform multiple tasks with multiple clients in a fast-paced, deadline-driven environment\n\n· Ability to communicate effectively in English and the local office language (if applicable)\n\n· Eligibility to work in the country where you are applying, as well as apply for travel visas as required by travel needs\n\nPreferred qualifications\n\n· Ability to identify problems, brainstorm and analyze answers, and implement the best solutions\n\n· Experience managing tasks or workstreams in a collaborative team environment with third parties\n\n· Relevant industry expertise\n\nCorporate Security Responsibility\n\nAll activities involving access to Mastercard assets, information, and networks comes with an inherent risk to the organization and, therefore, it is expected that every person working for, or on behalf of, Mastercard is responsible for information security and must:\n\nAbide by Mastercard’s security policies and practices;\n\nEnsure the confidentiality and integrity of the information being accessed;\n\nReport any suspected information security violation or breach, and\n\nComplete all periodic mandatory security trainings in accordance with Mastercard’s guidelines.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=4c229a871a108f53",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Customer Relationship Manager",
        "Company": "SM Group",
        "Location": "Vile Parle, Mumbai, Maharashtra",
        "Description": "Location: Vile-parle, Mumbai\n\nExperience: Minimum 5 years\n\nSalary: 5 – 6 LPA\n\nEmployment Type: Full-time\n\n*Job Overview:* We are looking for a *Customer Relationship Manager* (CRM) who is passionate about building strong client relationships and ensuring customer satisfaction. The ideal candidate should have hands-on experience with *CRM software, excellent communication skills, and a customer-first approach.*\n\n*Key Responsibilities:*\n\n*1. Client Relationship Management:*\n\n• Build and maintain strong relationships with customers, ensuring excellent service and satisfaction.\n\n*2. CRM Software Handling:*\n\n• Effectively use CRM tools to track customer interactions, manage databases, and improve customer engagement.\n\n*3. Customer Support & Query Resolution:*\n\n• Address customer concerns, provide timely responses, and enhance their overall experience.\n\n*4. Follow-ups & Retention:*\n\n• Ensure proactive follow-ups to maintain customer loyalty and satisfaction.\n\n*5. Collaboration:*\n\n• Work closely with sales, marketing, and support teams to improve customer relationships and business growth.\n\n*6. Reporting & Analysis:*\n\n• Generate and analyze customer data reports to improve service quality and customer engagement.\n\n*Qualifications & Skills:*\n\n• Bachelor’s Degree in Business Administration, Marketing, or a related field.\n\n• Proficiency in using *CRM tools* to manage customer interactions and data.\n\n• Strong *verbal and written communication* skills to engage with customers effectively.\n\n• Ability to resolve queries, handle customer concerns, and provide top-notch service.\n\n• Experience in *client retention, follow-ups, and ensuring customer satisfaction.*\n\n• Ability to handle multiple customers and tasks efficiently.\n\n• Work closely with sales, marketing, and support teams to enhance customer relationships.\n\nInterested candidates can share their updated profiles by *mentioning the subject line as the job role you are applying for – followed by your name at dynamic@smgroup.work Cc to Team.HiringDesk@gmail.com*\n\n*or call +918850220484/ +918104054571*\n\nIn email body kindly *mention your total years of experience, Current CTC, Expected CTC and Notice period.*\n\nJob Type: Full-time\n\nPay: From ₹41,666.00 per month\n\nSchedule:\n* Day shift\n\n\n\nExperience:\n* CRM: 5 years (Preferred)\n\nWork Location: In person\n\n*Speak with the employer*\n+91 8104054571",
        "Salary": "₹499,992 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=fa50facde625bb8f",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Executive - Marketing (ATL & BTL Campaigns)",
        "Company": "Probus Insurance Broker",
        "Location": "Andheri, Mumbai, Maharashtra",
        "Description": "Join our troop of passionate minds and get the chance to transform Insurance!!!\n\nStart securing India at Probus where you will have the opportunity to transform Insurance.\n\nWe are inviting people from different walks of life to make their career in the most rapidly growing InsurTech in India.\n\nAt Probus , we ensure to make long-term relationships with our employees, provide them opportunities to grow, make insurance fun and simple.\n\nIf you are looking for a dynamic, enriching, and challenging opportunities in your career, look no further.\nWhy join Probus ?\nRewards for innovative solutions\nColleagues will be your new friends\nFlexibility in taking leaves\nExecutive - Marketing (ATL & BTL Campaigns)\nJob Description.\n\n Executive - Marketing (ATL & BTL Campaigns)\n Location : Andheri\n\n Accountability :\n\n •Support In Preparing And Executing Monthly Marketing Calendar For Various ATL & BTL Campaigns. • Coordinating With The Sales Team For Regular Collateral Requirements. • Co-ordinate With Creative/digital Agencies For Smooth And Timely Execution Of Brand Campaigns And Daily Work. • Accountable For Creative Briefs, Agency Briefing And Execution Of Brand Campaigns. • Work Closely With Multiple Internal Stakeholders To Ensure That The Deliveries Of Their Requirement Is As Planned And Adheres To Our Brand Guidelines. • Perform Campaign Analysis Daily, Weekly, Monthly To Find Growth Opportunities And Refine Campaign Performance. Make Reports Based On Consumer, Market & Competitors And Generate Actionable Insights. • Ensure Legal Compliance And Approval On All Communications. • Come Up With New Ideas For Internal And External Campaigns That Would Appeal To Masses. • Maintain Tracker Of Daily Jobs, Creative Executions, Processing Of Bills, Record Of Approved Ads For Compliance.\n\n Key Skills :\n\n •Be Able To Multitask And Cater To The Requirements Of Multiple Stakeholders • Have Strong Creative & Aesthetic Inclination • Analytics And Insight Skill Especially While Planning Campaigns • Attention To Detail And Operational Excellence • Work As A Team Player • Agency & Vendor Management Experience • Drive Alignment, Interact Effectively\n\n Educational Qualification :\n Any Graduate\n\n Experience & Age :\n Experience - 1 Year & Above",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=3f9c72c41bf988c4",
        "JobType": [],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Fabric Co-ordinator",
        "Company": "Jainco Fashions Pvt Ltd",
        "Location": "Andheri East, Mumbai, Maharashtra",
        "Description": "Looking for a fabric co-ordinator / Junior Merchandiser in charge of following up on all fabric production orders by being in touch with weaving team, processing team and inspection/packing team.\n\nKey skills required -\n\n1. Basic experience of working with woven fabrics\n\n2. Strong data management and organization skills\n\n3. Hands on with Excel and Word\n\n4. Basic conversational/Email English proficiency\n\n\n\nWe are looking for self-driven, motivated people who thrive working with a degree of flexibility\n\nJob Type: Full-time\n\nPay: ₹20,000.00 - ₹30,000.00 per month\n\nBenefits:\n* Leave encashment\nSchedule:\n* Day shift\nSupplemental Pay:\n* Yearly bonus\n\n\n\nExperience:\n* total work: 3 years (Preferred)\n\nWork Location: In person",
        "Salary": "₹240,000 - ₹360,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=db0e5ae20123b5d4",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Operations Manager",
        "Company": "Jynara",
        "Location": "Mumbai, Maharashtra",
        "Description": "The Operations Manager will be responsible for overseeing daily operations at our manufacturing facilities, ensuring production targets are met, maintaining high-quality standards, and managing the workforce. This role involves hands-on leadership and frequent movement between factories to ensure consistent operational excellence.\n\nKey Responsibilities:\n* Factory Oversight:\n* Supervise and coordinate daily operations at the factory, ensuring adherence to production schedules and quality standards.\n* Monitor and optimize manufacturing processes to improve efficiency and reduce waste.\n* Team Management:\n* Manage and mentor factory employees, fostering a positive and productive work environment.\n* Conduct daily briefings, performance reviews, and implement staff training and development programs.\n* Inter-Factory Coordination:\n* Travel daily between multiple factory locations to ensure consistency in operations and address any emerging issues promptly.\n* Serve as the primary point of contact between factories and upper management.\n* Inventory Management:\n* Utilize inventory management software to track materials, manage stock levels, and forecast production needs.\n* Oversee inventory audits and maintain accurate records to support procurement and production planning.\n* Reporting & Continuous Improvement:\n* Generate regular operational reports, highlighting key performance indicators (KPIs) and areas for improvement.\n* Collaborate with cross-functional teams to implement process improvements and operational efficiencies.\n* Additional Duties:\n* Ensure compliance with company policies, health and safety regulations, and industry standards.\n* Address and resolve any operational issues that arise during production.\n\nRequired Qualifications:\n* Proven experience in operations management within a manufacturing environment, preferably in the clothing or textile industry.\n* Demonstrated leadership and team management skills.\n* Proficiency with inventory management software and a strong understanding of inventory control processes.\n* Ability and willingness to travel daily between factories.\n* Must be able to ride a bicycle for short commutes between factory locations.\n* Excellent organizational, communication, and problem-solving skills.\n* Ability to work under pressure and meet tight deadlines.\n\nPreferred Qualifications:\n* Bachelor’s degree in Operations Management, Business Administration, or a related field.\n* Experience in process optimization and lean manufacturing techniques.\n* Familiarity with health and safety regulations in a manufacturing setting.\n\nJob Type: Full-time\n\nPay: ₹35,000.00 - ₹40,000.00 per month\n\nSchedule:\n* Day shift\n\n\n\nAbility to commute/relocate:\n* Mumbai, Maharashtra: Reliably commute or planning to relocate before starting work (Required)\n\nWillingness to travel:\n* 25% (Preferred)\n\nWork Location: In person",
        "Salary": "₹420,000 - ₹480,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=f0d0524137495395",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Manager - Agile Business Analyst",
        "Company": "Genpact",
        "Location": "Mumbai, Maharashtra",
        "Description": "Genpact (NYSE: G) is a global professional services and solutions firm delivering outcomes that shape the future. Our 125,000+ people across 30+ countries are driven by our innate curiosity, entrepreneurial agility, and desire to create lasting value for clients. Powered by our purpose – the relentless pursuit of a world that works better for people – we serve and transform leading enterprises, including the Fortune Global 500, with our deep business and industry knowledge, digital operations services, and expertise in data, technology, and AI.\n\nInviting applications for the role of Manager, Agile Business Analyst\nIn this role, you will manage and analyze business requirements for various investment banking processes while overseeing project delivery. You will collaborate with stakeholders, manage timelines, and ensure compliance with regulatory requirements. Additionally, you will leverage Power BI for data visualization and reporting.\n\nResponsibilities\n• Lead the analysis and documentation of business requirements for investment banking processes\n• Implement and enhance controls and metrics to ensure project success and regulatory compliance\n• Collaborate with stakeholders across product lines to deliver detailed project requirements in line with regulatory, compliance, and control standards\n• Serve as the primary point of contact for gathering requirements and obtaining necessary approvals\n• Work with stakeholders and technology teams to define and implement controls across the investment banking lifecycle\n• Partner with technology teams to define functional and technical designs that support business processing requirements\n• Ensure common standards and best practices are implemented within the region and globally\n• Track and communicate project status to senior management and the wider team\n• Collaborate with the project team on test plan development, design test strategy, and manage the user acceptance testing (UAT) process\n• Develop and maintain an effective network of stakeholders to facilitate the quick integration of changes\n• Run steering meetings to ensure alignment and progress tracking\n• Provide regular updates to senior management on project status, risks, and issues\n• Mentor and guide junior team members to ensure their professional growth and project contribution\n• Utilize Power BI for data visualization and reporting to support decision-making processes\n\nQualifications we seek in you!\nMinimum Qualifications / Skills\n\n• Strong understanding of Agile methodologies (Scrum, Kanban)\n• Strong understanding of investment banking processes and directives\n• Extensive experience in business analysis within the financial services sector\n• Excellent written and verbal communication skills\n• Ability to multi-task and work in a fast-paced environment\n• Previous experience working in an Agile environment\n• Detail-oriented with the ability to adhere to strict timelines\n• Proficient in MS Excel, MS Word, and project management tools like JIRA\n• Basic knowledge of SQL for data analysis and reporting\n• Proficiency in Power BI for data visualization and reporting\n\nPreferred Qualifications/ Skills\n• Experience in data analysis and reporting\n• Familiarity with investment banking processes and reference data management\n• Strong problem-solving and analytical skills\n• Experience with Agile methodologies and tools\n• Knowledge of financial regulations and compliance requirements\n• Ability to work collaboratively with cross-functional teams\nGenpact is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, religion or belief, sex, age, national origin, citizenship status, marital status, military/veteran status, genetic information, sexual orientation, gender identity, physical or mental disability or any other characteristic protected by applicable laws. Genpact is committed to creating a dynamic work environment that values diversity and inclusion, respect and integrity, customer focus, and innovation. Get to know us at genpact.com and on LinkedIn, X, YouTube, and Facebook.\nFurthermore, please do note that Genpact does not charge fees to process job applications and applicants are not required to pay to participate in our hiring process in any other way. Examples of such scams include purchasing a 'starter kit,' paying to apply, or purchasing equipment or training.\n\nJobManager\nPrimary LocationIndia-Mumbai\nEducation LevelBachelor's / Graduation / Equivalent\nJob PostingFeb 7, 2025, 7:58:30 AM\nUnposting DateOngoing\nMaster Skills ListOperations\nJob CategoryFull Time",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=4529738d36e19fce",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Brand Head : Luxury Car",
        "Company": "Adinath Agencies",
        "Location": "Santa Cruz, Maharashtra",
        "Description": "*Job Summary:*\n\nThe Brand Head will be responsible for overseeing the development, management, and growth of the automobile brand. This role involves defining the brand’s identity, positioning, and long-term strategy, while ensuring consistency across all marketing and communication channels. The Brand Head will lead a cross-functional team to enhance brand equity, drive sales growth, and improve market share within the competitive automotive industry.\n\n*Key Responsibilities:*\n* *Brand Strategy and Development:*\n* Develop and implement the brand’s long-term strategy, vision, and positioning in the market.\n* Define key brand attributes, value propositions, and the brand voice to differentiate it in the competitive automobile industry.\n* Oversee market research to identify consumer insights, competitor analysis, and industry trends to inform brand strategy.\n* *Brand Positioning and Messaging:*\n* Lead the development of clear and compelling brand messaging for different audience segments (e.g., luxury, performance, eco-friendly vehicles).\n* Ensure all communication, advertising, and marketing campaigns are aligned with the brand’s strategic goals.\n* Oversee the creative development of marketing assets, including advertisements, digital content, product launches, and events.\n* *Marketing Campaigns and Execution:*\n* Lead the planning, development, and execution of integrated marketing campaigns to build brand awareness, loyalty, and demand generation.\n* Work with the digital marketing team to develop online campaigns, SEO strategies, and social media presence to enhance brand visibility.\n* Collaborate with product management and R&D teams to align new product launches with brand goals and messaging.\n* *Team Leadership and Collaboration:*\n* Lead and mentor the brand marketing team, fostering a creative, results-driven culture.\n* Collaborate with cross-functional teams, including sales, design, product development, and PR, to ensure cohesive brand experiences across all touchpoints.\n* Provide guidance and support to regional and national marketing teams for effective brand implementation.\n* *Sales and Market Share Growth:*\n* Work closely with the sales team to align marketing efforts with sales targets and promotional strategies.\n* Develop strategies to increase the brand’s market share and drive customer acquisition, retention, and loyalty.\n* Monitor key performance indicators (KPIs), sales data, and customer feedback to evaluate the brand's performance and make data-driven adjustments.\n* *Brand Equity and Consumer Loyalty:*\n* Develop and implement customer experience programs that enhance brand equity and create strong emotional connections with consumers.\n* Manage customer loyalty programs, brand partnerships, and ambassador relationships to strengthen brand affinity.\n* *Budget and P&L Management:*\n* Manage the brand’s marketing budget, ensuring efficient allocation of resources across campaigns and channels.\n* Track and report on the ROI of marketing campaigns and initiatives, adjusting strategies as needed to maximize returns.\n* *Brand Compliance and Quality Control:*\n* Ensure brand guidelines are adhered to across all marketing materials, campaigns, and product communications.\n* Oversee product packaging, retail presentations, and experiential marketing to ensure consistent brand presentation.\n\n*Qualifications:*\n* *Educational Background:*\n* Bachelor’s degree in Marketing, Business Administration, or a related field.\n* MBA or advanced degree in Marketing or a related discipline is a plus.\n* *Experience:*\n* Minimum of 8-10 years of experience in brand management, with at least 5 years in a senior or leadership role within the automobile or automotive industry.\n* Proven experience in managing large, complex brands and driving brand strategy in a competitive market.\n* Experience in managing large teams and working cross-functionally with sales, product development, and other departments.\n* *Skills & Competencies:*\n* Strong strategic thinking, with the ability to craft and execute brand strategies.\n* Expertise in marketing channels, digital platforms, and customer acquisition strategies.\n* Excellent leadership and team management skills.\n* Strong communication, negotiation, and interpersonal skills.\n* Data-driven decision-making abilities with a strong understanding of brand performance metrics and KPIs.\n* Knowledge of automotive industry trends, consumer behavior, and competitive landscape.\n\n*Work Conditions:*\n* Full-time, on-site or hybrid (depending on company policy).\n* Travel may be required for market visits, dealer events, and automotive exhibitions.\n\nJob Type: Full-time\n\nPay: ₹50,000.00 - ₹80,000.00 per month\n\nSchedule:\n* Day shift\n\nWork Location: In person",
        "Salary": "₹600,000 - ₹960,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=4d8d50271af4285a",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Operations Support Analyst",
        "Company": "IQVIA",
        "Location": "Thane, Maharashtra",
        "Description": "Core responsibilities:\n• Supports vendor payment process and the setup on the payment platform including review, monitor & approval of vendor budget\n• Update and maintain internal databases and systems of records (e.g. COUPA) tracking systems and project plans with project specific information\n• Demonstrate expert knowledge of all finance systems. Manage all aspects of the Project Finances including monthly expenses, invoices, and reconciliation.\n• Proactively identify Out of Scope (OOS) activities and implement and maintain change control log and processes\n• Demonstrate compliance with Vendor Management Plan and Purchase Order (PO) process\n• Actively contribute to the creation and finalization of Vendor Management Plan through understanding project requirements and third-party vendor impact\n• Actively contribute to establishment of project level Key Performance Indicators (KPIs), including assessing & documenting vendor performance\n• Supports any other Operations activities prioritized and agreed with Business Unit and Line Manager\n•\nBusiness Unit specific activities:\n• Communicates with IQVIA project teams on set up of studies\n• Provides support to Project Management admin activities such quoting, receivables and payables, billing and invoicing among others\n• Supports the creation, administration and cost control of POs\n• Proactively and on time provide data to PIC/PM on areas including cost, schedule, scope and change orders\n• Organize and partner with PIC/PM in managing internal project team and customer meetings including project status report, presentation material and minutes\n• Monitor project metrics & milestones and make required updates in IQVIA systems to ensure accurate and timely reporting is available\n• Ad-hoc project support as defined by PIC/PM\n• Support Commercial, Sales, Pricing and Finance departments to achieve their business goals\n\nIQVIA is a leading global provider of clinical research services, commercial insights and healthcare intelligence to the life sciences and healthcare industries. We create intelligent connections to accelerate the development and commercialization of innovative medical treatments to help improve patient outcomes and population health worldwide. Learn more at https://jobs.iqvia.com",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=26850778b5da6cc1",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Zonal Head Govt Business- West",
        "Company": "Hewlett Packard",
        "Location": "Mumbai, Maharashtra",
        "Description": "Job Summary\n• This role is responsible for strategically managing Government and Edutech, Enterprise accounts in the West region/ zone ensuring the organization's offerings align with client objectives and fostering professional development within the team. The role supports the implementation of strategic account plans, sets performance expectations, and reviews progress. The role manages sales pipeline activities, builds strong client relationships, fosters collaboration between teams, and enhances team efficiency.\n\nResponsibilities\n• Develops and communicates the overall strategy for the Government and Edutech, Enterprise accounts team, ensuring alignment with company objectives and long-term goals.\n• Assists in crafting and executing strategic account plans, providing insights, guidance, and help in navigating complex account dynamics.\n• Supports in setting performance expectations, goals, and targets for individual account managers, regularly reviewing progress and providing constructive feedback for improvement.\n• Demonstrates a deep understanding of the client’s industry and maps the organization’s capabilities that align with client business objectives.\n• Builds and monitors sales pipeline activities; leverages existing engagements for cross-sell, upsell, and growth opportunities.\n• Facilitates communication and collaboration between account managers and other internal teams (marketing, product, etc.) to optimize the value delivered to clients.\n• Establishes strong professional relationships with clients focusing on business management challenges and strategies.\n• Manages initiatives to improve team processes, account management methodologies, and overall efficiency, adapting strategies based on feedback and results.\n• Manages key partner relationships to strengthen overall solution capabilities and drive greater client value.\n• Identifies potential risks within the accounts managed by the team and collaborates on strategies to mitigate those risks.\n\nEducation & Experience Recommended\n• Four-year or Graduate Degree in Sales, Marketing, Business Administration, or any other related discipline or commensurate work experience or demonstrated competence.\n• Typically has 16+ years of job-related experience or 4-5 years of management experience, people manager, preferably in customer relationship management, account management, or a related field.\n\nPreferred Certifications\nNA\n\nKnowledge & Skills\n• Account Management\n• Business Development\n• Business Planning\n• Business To Business\n• Cross-Selling\n• Customer Relationship Management\n• Finance\n• Market Share\n• Marketing\n• Merchandising\n• Product Knowledge\n• Sales Management\n• Sales Process\n• Sales Prospecting\n• Sales Strategy\n• Sales Territory Management\n• Salesforce\n• Selling Techniques\n• Upselling\n• Value Propositions\n\nCross-Org Skills\n• Customer Centricity\n• Prioritization\n• Resilience\n• Team Management\n• Strategic Thinking\n\nImpact & Scope\n• Impacts function and leads projects requiring understanding of multiple disciplines or areas of HP.\n\nComplexity\n• Uses managerial concepts and company objectives to resolve issues in creative and effective ways.\n\nDisclaimer\n• This job description describes the general nature and level of work performed in this role. It is not intended to be an exhaustive list of all duties, skills, responsibilities, knowledge, etc. These may be subject to change and additional functions may be assigned as needed by management.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=e7e260657a5b1957",
        "JobType": [],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Studio Manager",
        "Company": "Tweak And Turn Consultations",
        "Location": "Mumbai, Maharashtra",
        "Description": "The Studio Manager plays a pivotal role in the success of r Studio, overseeing all aspects of studio operations, from revenue assurance to client service and overall establishment functions. This position involves driving revenue generation, team management, branding, marketing, and business development at the geographic level, while ensuring operational excellence.\n\n*Roles and Responsibilities:*\n* Oversee all aspects of studio operations, ensuring optimal performance and continuous improvement in client service, team deliverables, sales/marketing, studio appearance, and financial control.\n* Demonstrate and foster a commitment to delivering the best possible client experience by maintaining high company standards.\n* Resolve client-related issues in accordance with company operating guidelines.\n* Maximize revenues and achieve monthly targets through effective management and strategic initiatives.\n* Collaborate closely with the Business Development team to drive sales activities and meet revenue objectives.\n* Recruit, train, and develop team members in technical, administrative, and managerial skills.\n* Motivate, mentor, and provide direction to the team, fostering a positive and productive work environment.\n* Conduct regular training sessions and ensure team members are well-informed about policies and procedures.\n* Hold regular meetings to communicate company updates, policy reviews, and goals to the team.\n* Manage studio operations as required, ensuring efficient day-to-day functioning.\n* Responsible for the Profit and Loss (P&L) performance of the studio.\n* Achieve customer satisfaction through friendly and efficient service delivery.\n* Conduct regular inspections across all sections to maintain quality standards.\n* Develop and maintain a motivational work environment within the department.\n* Ensure team members are knowledgeable about products and services offered.\n\n*Skills:*\n* Strong leadership and managerial skills with a proven ability to drive team performance.\n* Excellent communication and interpersonal skills.\n* Demonstrated experience in operational management, client service, and financial control.\n* Ability to develop and implement business strategies to meet revenue and operational goals.\n* Knowledge of studio operations and client service best practices.\n* Ability to recruit, train, and manage a diverse team.\n* Strong organizational skills with the ability to multitask and prioritize.\n\nThis role requires a proactive individual with a strong leadership presence and excellent operational management skills to drive the studio's success and uphold the company's reputation for excellence in client service and operational efficiency.\n\nJob Type: Full-time\n\nPay: ₹60,000.00 - ₹70,000.00 per month\n\nSchedule:\n* Day shift\n\n\n\nExperience:\n* total work: 8 years (Required)\n\nWork Location: In person",
        "Salary": "₹720,000 - ₹840,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=c937cd45263fb324",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Project Coordinator",
        "Company": "Hurix Systems Pvt. Ltd.",
        "Location": "Mumbai, Maharashtra",
        "Description": "Our Purpose:\n\nAt Hurix, learning ignites our purpose. We are passionate about revolutionizing education through relentless innovation and a commitment to excellence. We create engaging and effective learning experiences that empower individuals and organizations to thrive. We foster a collaborative environment where every team member contributes their unique ideas, and together, we push the boundaries of what’s possible.\n\nPosition Overview:\n\nWe are seeking a highly motivated and detail-oriented project coordinator to join our dynamic team in Mumbai. The ideal candidate will be a recent graduate with a passion for project management or operations and a willingness to learn and grow within our organization. This is an excellent opportunity for freshers looking to kick-start their career in project management.\n\nWhat will your day look like:\n\nProject planning and coordination:\n\nAssist in the development of project plans and schedules.\nCoordinate project activities and ensure all project phases are documented appropriately.\nTrack project deliverables using appropriate tools.\n\nResource Management:\n\nIdentify and allocate resources effectively to ensure project success.\nCollaborate with various teams to ensure resource availability and allocation.\n\nRisk Management:\n\nIdentify potential risks and develop mitigation strategies.\nMonitor and report on project risks and issues.\n\nCommunication:\n\nMaintain regular communication with stakeholders to ensure project alignment with business goals.\nPrepare and present project status reports to stakeholders and senior management.\n\nQuality Assurance:\n\nEnsure that all projects adhere to the company’s quality standards.\nConduct regular reviews and assessments to ensure project quality.\n\nDocumentation and reporting:\n\nMaintain comprehensive project documentation.\nReport on project progress, issues, and successes.\n\nWe’re looking for someone with:\n\nBachelor’s degree in technology, business administration, or a related field (master’s degree preferred).\nExceptional leadership, communication, and problem-solving skills.\nExperience managing large, complex projects with multiple stakeholders.\n\nSend your resume to recruitment@hurix.com\n\nFor additional information on Hurix, please visit: https://www.hurix.com/life-at-hurix/\n\nYou must take the necessary steps to safeguard the integrity, security, and confidentiality of shared confidential information.\n\nJob Category: Project and Program Management\nJob Type: Contract\nJob Location: Mumbai",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=ac82881d99916e00",
        "JobType": [
            "Contractual / Temporary"
        ],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Assistant Manager, Business Analytics",
        "Company": "Colgate-Palmolive",
        "Location": "Mumbai, Maharashtra",
        "Description": "Relocation Assistance Offered Within Country\nJob Number #165136 - Mumbai, Maharashtra, India\n\nWho We Are\n\nColgate-Palmolive Company is a global consumer products company operating in over 200 countries specializing in Oral Care, Personal Care, Home Care, Skin Care, and Pet Nutrition. Our products are trusted in more households than any other brand in the world, making us a household name!\n\nJoin Colgate-Palmolive, a caring, innovative growth company reimagining a healthier future for people, their pets, and our planet. Guided by our core values—Caring, Inclusive, and Courageous—we foster a culture that inspires our people to achieve common goals. Together, let's build a brighter, healthier future for all.\n\nAbout Colgate-Palmolive\n\nDo you want to come to work with a smile and leave with one as well? In between those smiles, your day consists of working in a global organization, continually learning and collaborating, having stimulating discussions, and making impactful contributions!\n\nIf this is how you see your career, Colgate is the place to be!\n\nOur diligent household brands, dedicated employees, and sustainability commitments make us a company passionate about building a future to smile about for our employees, consumers, and surrounding communities. The pride in our brand fuels a workplace that encourages creative thinking, champions experimentation, and promotes authenticity which has chipped in to our enduring success.\n\nIf you want to work for a company that lives by their values, then give your career a reason to smile...every single day.\n\nThe Experience\n\nIn today’s dynamic analytical / technological environment, it is an exciting time to be a part of the CBS Analytics team at Colgate. Our highly insight driven and innovative team is dedicated to driving growth for Colgate Palmolive in this constantly evolving landscape.\n\nWhat role will you play as a member of Colgate's Analytics team?\n\nThe CBS Analytics vertical in Colgate Palmolive is passionate about working on reasons which have big $ impact and scope for scalability. With clear focus on addressing the business questions, with recommended actions\n\nThe Data Scientist position would lead CBS Analytics projects within the Analytics Continuum. Conceptualizes and builds predictive modeling, simulations, and optimization solutions for clear $ objectives and measured value\n\nThe Data Scientist would work on a range of projects ranging across Revenue Growth Management, Market Efficiency, Forecasting etc.\n\nData Scientist needs to handle relationships independently with Business and to drive projects such as Price Promotion, Marketing Mix and Forecasting\n\nWho are you…\n\nYou are a function expert -\n\nLeads Analytics projects within the Analytics Continuum\n\nConceptualizes and builds predictive modeling, simulations, and optimization solutions to address business questions or use cases\n\nApplies ML and AI to analytics algorithms to build inferential and predictive models allowing for scalable solutions to be deployed across the business\n\nConducts model validations and continuous improvement of the algorithms, capabilities, or solutions built\n\nYou connect the dots -\n\nDrive insights from internal and external data for business\n\nAssemble large, sophisticated data sets that meet functional / non-functional business requirements\n\nBuild data and visualization tools for Business analytics to assist them in decision making\n\nYou are a collaborator -\n\nWork closely with Division Analytics team leads\n\nWork with data and analytics specialists across functions to drive data solutions\n\nYou are an innovator -\n\nIdentify, design, and implement new algorithms, process improvements: while continuously automating processes, optimizing data delivery, re-designing infrastructure for greater scalability, etc.\n\nQualifications\n\nWhat you’ll need\n\nGraduation/Masters in Statistics/ Applied Mathematics/ Computer Science\n\n1+ years of experience in building data models and driving insights\n\nHands-on/experience on developing statistical models, such as regression, ridge regression, lasso, random forest, SVM, gradient boosting, logistic regression, K-Means Clustering, Hierarchical Clustering etc.\n\nHands on experience on coding languages Python(mandatory), R, SQL, PySpark, SparkR\n\nKnowledge of using GitHub, Airflow for coding and model executions\n\nHandling, redefining, developing statistical models for RGM/Pricing and/or Marketing Efficiency and communicating insights decks to business\n\nValidated understanding on tools like Tableau, Domo, Power BI and web apps framework using plotly, pydash, sql\n\nExperience front facing Business teams (Client facing role) supporting and working with multi-functional teams in a dynamic environment\n\nWhat you’ll need…(Preferred)\n\nExperience with third-party data i.e., syndicated market data, Point of Sales, etc.\n\nShown understanding of consumer packaged goods industry\n\nKnowledge of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks.\n\nExperience visualizing/communicating data for partners using: Tableau, DOMO, pydash, plotly, d3.js, ggplot2, pydash, R Shiny etc\n\nWillingness and ability to experiment with new tools and techniques\n\nGood facilitation and project management skills\n\nAbility to maintain personal composure and thoughtfully handle difficult situations.\n\nKnowledge of Google products (BigQuery, data studio, colab, Google Slides, Google Sheets etc)\n\nOur Commitment to Diversity, Equity & Inclusion\nAchieving our purpose starts with our people — ensuring our workforce represents the people and communities we serve —and creating an environment where our people feel they belong; where we can be our authentic selves, feel treated with respect and have the support of leadership to impact the business in a meaningful way.\n\nEqual Opportunity Employer\nColgate is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity, sexual orientation, national origin, ethnicity, age, disability, marital status, veteran status (United States positions), or any other characteristic protected by law.\n\nReasonable accommodation during the application process is available for persons with disabilities. Please complete this request form should you require accommodation.\n\n#LI-Remote",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=146d5add2cbcd267",
        "JobType": [],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Project Manager",
        "Company": "Lambsrock",
        "Location": "Mumbai, Maharashtra",
        "Description": "POSITION: Project Manager Interiors\n\nDEPARTMENT: Project Management\n\nDIRECT REPORTS: Senior Project Manager\n\nSECTOR: Healthcare\n\nLOCATION: Mumbai\n\nOur goal at LAMBSROCK is to provide unparalleled service to every client, setting the benchmark within our industry, As a Project Manager you'll be at the forefront of our mission, leading and guiding the teams to deliver exceptional results. This pivotal role combines strategic leadership, hands-on project oversight, and client relationship management to ensure the successful execution of projects from inception to completion. If you're passionate about driving impactful change, fostering client satisfaction, and leading high-performing teams, this role offers an exciting opportunity to make a significant impact in the world of project management consultancy. Your leadership will be pivotal in establishing LAMBSROCK as an industry frontrunner, committed to delivering unparalleled service and value to our clients, while fostering a culture of continuous growth and innovation throughout the organization.\n\nPosition Purpose\n\nAs a Project Manager specializing in Interiors, you will oversee the planning, coordination, and execution of interior design and construction projects. Working closely with clients, designers, contractors, and vendors, you will ensure that projects are completed on time, within budget, and to the highest quality standards.\n\nQualifications and Experience:\n\n· Bachelor’s degree in B.Tech Civil\n\n· Minimum of 10+ years of experience in project management, with a focus on interior design and construction projects.\n\n· Strong technical knowledge of interior design principles, construction methods, and materials.\n\n· Proficiency in project management software and tools (e.g., Primavera, MS Project, Procore).\n\n· Excellent leadership, communication, and interpersonal skills.\n\n· Ability to effectively manage teams, subcontractors, and vendors in a fast-paced construction environment.\n\n· Familiarity with relevant building codes, regulations, and industry best practices.\n\nDuties & Responsibilities:\n\n· Project Planning and Coordination: Develop comprehensive project plans, schedules, and budgets for interior design and construction projects. Coordinate resources, activities, and deliverables to meet project objectives.\n\n· Client Communication: Serve as the primary point of contact for clients, architects, designers, and other stakeholders. Communicate project requirements, updates, and key milestones to ensure alignment and client satisfaction.\n\n· Design Management: Manage the design process, including conceptual design, design development, and construction documentation. Coordinate with design teams to ensure that design intent is translated into construction drawings and specifications.\n\n· Contract Management: Manage contracts with subcontractors, vendors, and suppliers for interior construction work. Review contract documents, change orders, and invoices to ensure accuracy and compliance with project scope and budget.\n\n· Construction Management: Oversee the construction phase of projects, including site preparation, demolition, build-out, and installation of finishes and furnishings. Monitor progress, resolve issues, and ensure compliance with design specifications and quality standards.\n\n· Cost Control: Monitor project expenses and track spending against the allocated budget. Identify cost-saving opportunities and recommend measures to optimize resource utilization and minimize project costs.\n\n· Schedule Management: Monitor project progress and coordinate activities to ensure adherence to the project schedule. Identify and address schedule delays or conflicts to prevent impacts on project milestones.\n\n· Quality Assurance: Implement quality assurance processes to monitor and evaluate construction activities. Conduct inspections, reviews, and tests to ensure compliance with design specifications, building codes, and industry standards.\n\n· Risk Management: Identify potential risks and challenges associated with interior construction projects. Develop mitigation strategies to address risks and minimize their impact on project delivery.\n\n· Documentation and Reporting: Maintain accurate project documentation, including daily reports, progress photos, and punch lists. Prepare reports and presentations for internal and external stakeholders as required.\n\nWhat We Offer:\n\n- Competitive salary and benefits package\n\n- Opportunities for professional growth and career advancement\n\n- A collaborative and dynamic work environment\n\n- Involvement in high-profile and diverse projects\n\n- Ongoing training and development programs\n\nLAMBSROCK is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=eb98d1b1da36f43b",
        "JobType": [],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "GM - Administration",
        "Company": "Otis",
        "Location": "Malad, Mumbai, Maharashtra",
        "Description": "Date Posted:\n\n2025-02-05\n\nCountry:\n\nIndia\n\nLocation:\n\nHead Office 9th Floor, Magnus Tower, Mindspace, Link Road, Malad (West), MUMBAI-400064, India\n\nRole Objective:\n\nResponsible for planning, streamlining and executing administrative workflows and processes, ensuring alignment with legal & safety standards and compliances as per the Shop & Establishment act. Overall management of the facility and administration of services with enhanced level of customer services.\n\nPrimary responsibilities:\n\n1. Facility Management:\n\na. Overall maintenance and upkeep of office space, ensuring space utilization and safety for healthy work environments.\n\nb. Managing facility day to day operations, utilities, housekeeping, security, pantry, gardening, travel, hotel etc...\n\nc. Coordinates with building management & vendors to ensure seamless facility operations.\n\n2. Vendor management:\n\na. In overall vendor management, the candidate will identify the new vendor, negotiation, ensuring cost control within budget and enhanced service delivery as per requirement.\n\nb. To ensure the life cycle of current vendors is managed\n\nc. Overall management of housekeeping staff and third-party staff.\n\n3. Compliances:\n\na. Statutory compliances relating to Shops and Establishment; Facility, Retirals, Monthly/Periodic/Yearly compliance and returns at the country level.\n\nb. Legatrix management.\n\n4. General Administrations:\n\na. Manages overall administrative activities.\n\nKey Skills:\n\nTeam Management\nInterpersonal and problem solving\nNegotiation skill\nVendor management\nKnowledge of regulatory compliances.\n\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The Educational qualification and requirements listed below are representative of the knowledge, skills, and/or ability required.\n\nEDUCATIONAL QUALIFICATIONS\n\nPreferred: Any graduate with master’s in business administration\n\nEXPERIENCE\n\n15 years of relevant experience\n\nANY OTHER KNOWLEDGE/ SKILLS/ PERSONAL ATTRIBUTES IF REQUIRED\n\nCandidate who has managed the relevant profile.\n\nIf you live in a city, chances are we will give you a lift or play a role in keeping you moving every day.\n\nOtis is the world’s leading elevator and escalator manufacturing, installation, and service company. We move 2 billion people every day and maintain approximately 2.2 million customer units worldwide, the industry's largest Service portfolio.\n\nYou may recognize our products in some of the world’s most famous landmarks including the Eiffel Tower, Empire State Building, Burj Khalifa and the Petronas Twin Towers! We are 69,000 people strong, including engineers, digital technology experts, sales, and functional specialists, as well as factory and field technicians, all committed to meeting the diverse needs of our customers and passengers in more than 200 countries and territories worldwide. We are proud to be a diverse, global team with a proven legacy of innovation that continues to be the bedrock of a fast-moving, high-performance company.\n\nWhen you join Otis, you become part of an innovative global industry leader with a resilient business model. You’ll belong to a diverse, trusted, and caring community where your contributions, and the skills and capabilities you’ll gain working alongside the best and brightest, keep us connected and on the cutting edge.\n\nWe provide opportunities, training, and resources, that build leadership and capabilities in Sales, Field, Engineering and Major Projects and our Employee Scholar Program is a notable point of pride, through which Otis sponsors colleagues to pursue degrees or certification programs.\n\nToday, our focus more than ever is on people. As a global, people-powered company, we put people – passengers, customers, and colleagues – at the center of everything we do. We are guided by our values that we call our Three Absolutes – prioritizing Safety, Ethics, Quality in all that we do. If you would like to learn more about environmental, social and governance (ESG) at Otis click here.\n\nBecome a part of the Otis team and help us #Buildwhatsnext!\n\nOtis is An Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status, age or any other federally protected class. To request an accommodation in completing an employment application due to a special need or a disability, please contact us at careers@otis.com.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=d80a53df4c7cb293",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Project Manager",
        "Company": "Zycus",
        "Location": "Mumbai, Maharashtra",
        "Description": "About Us\nZycus is a pioneer in Cognitive Procurement software and has been a trusted partner of choice for large global enterprises for two decades. Zycus has been consistently recognized by Gartner, Forrester, and other analysts for its Source to Pay integrated suite. Zycus powers its S2P software with the revolutionary Merlin AI Suite. Merlin AI takes over the tactical tasks and empowers procurement and AP officers to focus on strategic projects; offers data-driven actionable insights for quicker and smarter decisions, and its conversational AI offers a B2C type user-experience to the end-users.\n\nZycus helps enterprises drive real savings, reduce risks, and boost compliance, and its seamless, intuitive, and easy-to-use user interface ensures high adoption and value across the organization.\n\nStart your #CognitiveProcurement journey with us, as you are #MeantforMore\n\nWe Are An Equal Opportunity Employer:\nZycus is committed to providing equal opportunities in employment and creating an inclusive work environment. We do not discriminate against applicants on the basis of race, color, religion, gender, sexual orientation, national origin, age, disability, or any other legally protected characteristic. All hiring decisions will be based solely on qualifications, skills, and experience relevant to the job requirements.\nJob Description\nWe are looking for a Project Manager with expertise in eProcurement implementation. The ideal candidate will have 8-12 years of experience in end-to-end implementation of procurement software and a strong understanding of Source-to-Pay (S2P) or Procure-to-Pay (P2P) solutions like SAP Ariba, Coupa, Ivalua, Basware, Jaggaer, or similar platforms.\n\nThe Project Manager will lead multiple, complex implementation projects, working with global Fortune 1000 enterprises to ensure successful software deployment, adoption, and business impact.\n\nKey Responsibilities:\n1. Project & Program Management\nLead the end-to-end implementation of Zycus' eProcurement solutions for enterprise customers.\nReview contracts and Statements of Work (SOW) to define scope, timelines, and deliverables.\nDrive project governance, ensuring alignment between customer expectations and project execution.\nManage project budgets, timelines, and resources effectively.\n2. Project Delivery & Execution\nTrack and ensure timely delivery of implementation projects.\nProactively manage project risks and develop mitigation strategies.\nMonitor KPIs and success metrics to drive customer satisfaction.\n3. Stakeholder & Customer Engagement\nAct as the primary point of contact for customer stakeholders, including procurement and IT teams.\nConduct regular status meetings with internal teams and customers to ensure alignment.\nProvide strategic recommendations to optimize customer adoption and success.\n4. Team Leadership & Process Compliance\nGuide and mentor project team members, ensuring best practices in project execution.\nConduct weekly project status review meetings with teams and customers.\nFollow and enforce standardized project delivery processes for consistency and efficiency.\nJob Requirement\nQualifications & Experience\nEducation:\nBachelor’s degree in Engineering or a related field.\nExperience:\n8-12 years of experience in project management, with a strong focus on software implementation.\nProven expertise in implementing ERP solutions (SAP, Oracle) or Procurement platforms (SAP Ariba, Coupa, Ivalua, Basware, Jaggaer, etc.).\nExperience in handling global rollouts for enterprise clients.\nStrong background in managing complex application development and maintenance (ADM) projects.\nPMP, PRINCE2, or Agile certification is a plus.\nWhy Join Zycus?\nWork with leading global enterprises and drive procurement transformation.\nBe part of a high-growth SaaS company at the forefront of AI-driven procurement.\nOpportunity to work in a dynamic, collaborative, and innovative environment.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=124fd5dba3e91808",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Quality Analyst",
        "Company": "JPMorganChase",
        "Location": "Mumbai, Maharashtra",
        "Description": "JOB DESCRIPTION\n\nYou are a strategic thinker passionate about driving solutions. You have found the right team.\n\nAs a Quality Analyst within our team, you will spend each day defining, refining and delivering set goals for our firm. In this competitive landscape, we believe quality is more than just a benchmark, it's essential. As part of our team, you will ensure that our products and services not only meet but surpass industry standards. Your meticulous attention to detail and commitment to excellence will help us achieve exceptional quality assurance. You will perform quality reviews and transactional testing on critical process elements to assess adherence to regulatory requirements, policies, procedures and business practices. Your role will involve performing an independent assessment on a sample of accounts for select operational processes. You will compile results of reviews and work with business partners to review testing results, causes of exceptions, and observations for process improvement. Your role will directly influence our business partner control and risk agendas to focus on critical process components.\n\nJob Responsibilities\n\nPerform quality evaluations by executing against an established set of criteria.\nReview and verify that all the correct and required documentation is present when needed.\nWork with limited supervision and meet performance-related standards and goals for quality and productivity.\nComplete all required training successfully and on time.\nIdentify errors immediately and follow the proper escalation process.\nAssist in the identification and escalation of process-related issues and improvement opportunities.\nCommunicate effectively with the Team Leader and business partners as needed.\nComplete all assigned work to meet service levels and legal/compliance requirements.\nPartner with the leadership team to identify and implement process/procedural enhancements.\nCreate and maintain open communication with peers, the leadership team, and other lines of business.\n\nRequired qualifications, capabilities and skills\n\nMinimum 1 year current collections experience required\nThorough knowledge and experience with CCB Collections Policies and Procedures (CARD, Overdraft, or Auto Collections) experience required. Knowledge using relevant Business systems (First Support, Recovery One, Mainframe, TSYS, ICAF & ICP)\nProficient with WebStats & SharePoint required. Ability to manage multiple projects simultaneously with a sense of urgency to deliver quality results while working collaboratively\nStrong analytical and statistical proficiency and problem-solving skills. Working knowledge of quality principles\nStrong verbal and written communication skills\nExcellent attention to detail and quality to identify and raise any inaccuracies or omissions within documentation\nProven ability to work in a fast-paced high-volume environment\nMust demonstrate integrity, high morale, and a positive attitude\nEffectively and professionally represent yourself, your business, your manager and most importantly JPMC with the highest of standards.\n\nPreferred qualifications, capabilities and skills\n\nAdvanced proficiency with computer functions with MS Office Suite strongly preferred\nABOUT US\n\nJPMorganChase, one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. We also make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as mental health or physical disability needs. Visit our FAQs for more information about requesting an accommodation.\n\nABOUT THE TEAM\n\nOur Consumer & Community Banking division serves our Chase customers through a range of financial services, including personal banking, credit cards, mortgages, auto financing, investment advice, small business loans and payment processing. We’re proud to lead the U.S. in credit card sales and deposit growth and have the most-used digital solutions – all while ranking first in customer satisfaction.\n\nWhen it comes to buying a vehicle or refinancing an existing car loan, many customers turn to Chase to help. Our auto lending services are constantly evolving and incorporating the latest technology to help match car buyers with dealers, provide competitive financing options and ease loan management.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=4e4edc0de0736b72",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Manager - Agile Business Analyst/ Project Management",
        "Company": "Genpact",
        "Location": "Mumbai, Maharashtra",
        "Description": "Genpact (NYSE: G) is a global professional services and solutions firm delivering outcomes that shape the future. Our 125,000+ people across 30+ countries are driven by our innate curiosity, entrepreneurial agility, and desire to create lasting value for clients. Powered by our purpose – the relentless pursuit of a world that works better for people – we serve and transform leading enterprises, including the Fortune Global 500, with our deep business and industry knowledge, digital operations services, and expertise in data, technology, and AI.\n\nInviting applications for the role of Manager, Agile Business Analyst/ Project Management\nIn this role, you will manage and analyze business requirements for various projects, ensuring successful delivery through effective collaboration with stakeholders. You will lead the planning and execution of projects, leveraging Agile methodologies to ensure that project goals are met within defined timelines and budgets. Additionally, you will utilize your basic SQL knowledge to support data analysis and decision-making processes. You will also ensure compliance with regulatory and organizational requirements throughout the project lifecycle.\n\nResponsibilities\n• Lead and manage Agile project teams to ensure timely delivery of high-quality projects\n• Collaborate with stakeholders to gather business requirements and define project scope\n• Create and manage project plans, timelines, and deliverables\n• Perform business analysis and document functional requirements, user stories, and use cases\n• Identify and resolve project issues, risks, and impediments to ensure smooth project execution\n• Develop and maintain strong relationships with clients, team members, and stakeholders\n• Mentor and support junior team members in Agile methodologies and project management best practices\n• Ensure the delivery of projects within scope, time, and budget while adhering to quality standards\n• Work with development teams to ensure that solutions meet business requirements and are technically feasible\n• Drive continuous improvement by suggesting and implementing process improvements and best practices\n• Utilize SQL to extract, analyze, and validate data to support project decisions and reporting needs\n• Assist in developing SQL queries to retrieve business intelligence data from various databases\n\nQualifications we seek in you!\nMinimum Qualifications / Skills\n\n• Bachelor's degree in Business, Information Technology, or a related field\n• Experience in Agile project management and business analysis\n• Strong understanding of Agile methodologies (Scrum, Kanban)\n• Basic knowledge of SQL for data analysis and reporting\n• Strong communication, leadership, and interpersonal skills\n• Detail-oriented with the ability to adhere to strict timelines\n• Proficient in BPMN, MS Excel, MS Word, and project management tools like JIRA & Rally\nPreferred Qualifications/ Skills\n• Experience with Agile methodologies and tools\n• Experience with project management tools such as Jira, Confluence, or Trello\n• Experience in managing cross-functional teams in an IT or software development environment\n• Strong problem-solving skills with a focus on delivering client-focused solutions\n• Ability to manage multiple projects simultaneously in a fast-paced environment\n• Proficiency in MS suite of products, including PowerPoint and SharePoint\n• Basic knowledge of SQL for data analysis and reporting\nGenpact is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, religion or belief, sex, age, national origin, citizenship status, marital status, military/veteran status, genetic information, sexual orientation, gender identity, physical or mental disability or any other characteristic protected by applicable laws. Genpact is committed to creating a dynamic work environment that values diversity and inclusion, respect and integrity, customer focus, and innovation. Get to know us at genpact.com and on LinkedIn, X, YouTube, and Facebook.\nFurthermore, please do note that Genpact does not charge fees to process job applications and applicants are not required to pay to participate in our hiring process in any other way. Examples of such scams include purchasing a 'starter kit,' paying to apply, or purchasing equipment or training.\n\nJobManager\nPrimary LocationIndia-Mumbai\nEducation LevelBachelor's / Graduation / Equivalent\nJob PostingFeb 7, 2025, 8:33:34 AM\nUnposting DateOngoing\nMaster Skills ListOperations\nJob CategoryFull Time",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=9838798abf02fb23",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Project Manager",
        "Company": "Lambsrock Consulting Pvt. ltd.",
        "Location": "Girgaon, Mumbai, Maharashtra",
        "Description": "POSITION*: Project Manager Interiors*\n\nDEPARTMENT: Project Management\n\nDIRECT REPORTS: *Senior Project Manager*\n\nSECTOR: Healthcare\n\nLOCATION: Mumbai\n\n\n\nOur goal at *LAMBSROCK* is to provide unparalleled service to every client, setting the benchmark within our industry, As a Project Manager you'll be at the forefront of our mission, leading and guiding the teams to deliver exceptional results. This pivotal role combines strategic leadership, hands-on project oversight, and client relationship management to ensure the successful execution of projects from inception to completion. If you're passionate about driving impactful change, fostering client satisfaction, and leading high-performing teams, this role offers an exciting opportunity to make a significant impact in the world of project management consultancy. Your leadership will be pivotal in establishing *LAMBSROCK* as an industry frontrunner, committed to delivering unparalleled service and value to our clients, while fostering a culture of continuous growth and innovation throughout the organization.\n\n*Position Purpose*\n\nAs a Project Manager specializing in Interiors, you will oversee the planning, coordination, and execution of interior design and construction projects. Working closely with clients, designers, contractors, and vendors, you will ensure that projects are completed on time, within budget, and to the highest quality standards.\n\n\n\n*Qualifications and Experience*:\n\n· Bachelor’s degree in B.Tech Civil\n\n· Minimum of 10+ years of experience in project management, with a focus on interior design and construction projects.\n\n· Strong technical knowledge of interior design principles, construction methods, and materials.\n\n· Proficiency in project management software and tools (e.g., Primavera, MS Project, Procore).\n\n· Excellent leadership, communication, and interpersonal skills.\n\n· Ability to effectively manage teams, subcontractors, and vendors in a fast-paced construction environment.\n\n· Familiarity with relevant building codes, regulations, and industry best practices.\n\n*Duties & Responsibilities:*\n\n· *Project Planning and Coordination:* Develop comprehensive project plans, schedules, and budgets for interior design and construction projects. Coordinate resources, activities, and deliverables to meet project objectives.\n\n· *Client Communication:* Serve as the primary point of contact for clients, architects, designers, and other stakeholders. Communicate project requirements, updates, and key milestones to ensure alignment and client satisfaction.\n\n· *Design Management:* Manage the design process, including conceptual design, design development, and construction documentation. Coordinate with design teams to ensure that design intent is translated into construction drawings and specifications.\n\n· *Contract Management:* Manage contracts with subcontractors, vendors, and suppliers for interior construction work. Review contract documents, change orders, and invoices to ensure accuracy and compliance with project scope and budget.\n\n· *Construction Management:* Oversee the construction phase of projects, including site preparation, demolition, build-out, and installation of finishes and furnishings. Monitor progress, resolve issues, and ensure compliance with design specifications and quality standards.\n\n· *Cost Control:* Monitor project expenses and track spending against the allocated budget. Identify cost-saving opportunities and recommend measures to optimize resource utilization and minimize project costs.\n\n· *Schedule Management:* Monitor project progress and coordinate activities to ensure adherence to the project schedule. Identify and address schedule delays or conflicts to prevent impacts on project milestones.\n\n· *Quality Assurance:* Implement quality assurance processes to monitor and evaluate construction activities. Conduct inspections, reviews, and tests to ensure compliance with design specifications, building codes, and industry standards.\n\n· *Risk Management:* Identify potential risks and challenges associated with interior construction projects. Develop mitigation strategies to address risks and minimize their impact on project delivery.\n\n· *Documentation and Reporting:* Maintain accurate project documentation, including daily reports, progress photos, and punch lists. Prepare reports and presentations for internal and external stakeholders as required.\n\n\n\n*What We Offer:*\n\n- Competitive salary and benefits package\n\n- Opportunities for professional growth and career advancement\n\n- A collaborative and dynamic work environment\n\n- Involvement in high-profile and diverse projects\n\n- Ongoing training and development programs\n\n\n\n*LAMBSROCK is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.*\n\nJob Type: Full-time\n\nPay: ₹1,000,000.00 - ₹1,200,000.00 per year\n\nBenefits:\n* Health insurance\n* Provident Fund\nSchedule:\n* Day shift\n\nWork Location: In person\n\n\nExpected Start Date: 17/02/2025",
        "Salary": "₹1,000,000 - ₹1,200,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=2c0c7d48cfdef75e",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "1 day ago"
    }
]