[
    {
        "JobTitle": "Data Centre Linux & HW Engineer, Data Center Operations (DCO)",
        "Company": "ADSIPL - Maharashtra",
        "Location": "Mumbai, Maharashtra",
        "Description": "- Solid Understanding of Linux/Unix Administration. Server Booting: POST, BIOS, PXE, Kickstart, GRUB/LILO, RAID\n- Some Experience with Network Protocols: TCP/IP, Ethernet, L 2/L 3 technologies. Network Hardware: Copper and Optical Fiber Cabling, Switches, Routers\n- This position also has a physical component requiring the ability to lift & rack equipment up to 20kg; it may require working in cramped spaces or in elevated locations while adhering to health & safety guidelines. This role involves covering 24x7 shift rotation\n\nAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\n\nYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\n\nWe are looking for skilled Data Centre Linux & HW Engineer at Amazon Data Services India Private Limited (“ADSIPL”) with a passion for technology to help us expand AWS Cloud offerings to the next level.\n\nADSIPL offers an exciting, dynamic and challenging environment encouraging creativity and personal development while maintaining AWS computing environments in a secure, scalable, and cost-effective manner.\n\nAt ADSIPL, career progression is part of our environment. We want you to progress. If your career path is in Systems, Network or Database Engineering, Software Development or maybe AWS Support, Technical Operations or perhaps Project Management, we will create a development plan to enable you to succeed reaching those goals. This begins on Day One!\n\nThe Opportunity: Data Centre Linux & HW Engineer\nThis role is a unique opportunity to work in some of the Innovative data centers in the world. ADSIPL’s data centers are large-scale high-density centers where you will be working on changing the face of Cloud technology in India.\n\nA Data Centre Linux & HW Engineer at ADSIPL may be the primary point of contact for both internal customers (for example: Network Engineers, Systems Engineers, Software Developers, Database Engineers, Technical Operations) and external customers (Hardware Vendors, Contractors, Service Providers among others).\n\nKey job responsibilities\nKey job responsibilities\n\nSome of the key responsibilities you will undertake are:\n\nProblem Solving:\nMaintain a high level of system reliability by prioritizing and resolving trouble tickets efficiently, these include:\n* Escalation point and technical troubleshooter for all Systems and Network hardware problems\n* Deep diving into Linux server issues\n* XEN service virtualization troubleshooting\n\nTechnical:\nTroubleshoot technical issues on various platforms ranging from Systems through Networking to Power/Mechanical\n* Remediation of physical layer outages, both systems & Network\n* Remediation or recovery of physical power issues on racks\n* Participate in Data Center power & cooling events\n\nOperations: \nMeet 24x7 On-Call requirements and response during shift rotations.\n* Install & configure racks of hosts in line with internal SLAs\n* Triage & resolve trouble tickets for all devices in your region\n* Data Center point of contact for all High Severity issues\n* Physical replacement of server and network device parts\n* Ensure correct rotation of parts & spares\n* Help define metrics to increase our customer uptime\n* Enforcing Security Best Practices at ADSIPL\n* Interact with third party vendors & contractors\n* Contribute ideas to improve operational efficiency\n\nProject Management: \n* Participate in and deliver on a number of high impact small to mid-scale projects\n* Participate in internal team meetings at ADSIPL for metric analysis and project status updates\n* Help build the world’s largest Cloud infrastructure in India\n\nMentoring: Share knowledge and help educate less technical staff on the best practices related to all service owner issues\n\nHiring: Contribute towards building a great team by getting involved in the ADSIPL’s hiring process/candidate interviews.\n\nAbout the team\nDiverse Experiences \nAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\n\nWhy AWS \nAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\n\nWork/Life Balance \nWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\n\nInclusive Team Culture \nAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\n\nMentorship and Career Growth\nWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\n\n- Remote Access: Console routers, IPMI, BMC. Network Equipment Installation and Configuration\n- Redundancy: Power feeds, ATS, Server Hardware, RAID, Network Connectivity\n- Data Center Operations: Inventory Management, Hot/Cold Aisles, Security\n- Experience or Knowledge of AWS products: EC2, EBS, S3 etc.\n- Scripting: Bash, Python, Perl, Ruby (or programming languages)\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=4eb1c305f2d6d21a",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Project Manager - Retail Display Fixtures (NIGHT SHIFT)",
        "Company": "Visual Citi Inc",
        "Location": "Mumbai, Maharashtra",
        "Description": "*Timings: US (New York) Timings (06:30 PM - 04:30 AM) - NIGHT SHIFT*\n\n*Working Days: Monday - Friday*\n\n*Location: Andheri East*\n\n*Visual Citi, Inc. (New York): Your Partner in Bringing Concepts to Life* We are full-service Visual Merchandising, Signage, Retail Display, Printing and Custom Fabrication company with over 100,000 Sq Ft production facility in New York and more than 100 employees. Established in 2004, the scalable organization delivers exceptional value through in-house graphic design, expert fabrication, and state-of-the-art machinery, continuously improving processes and using robotic automation to meet urgent deadlines with a wide range of high-quality visual products and displays.\n\n*Overview:* *We are seeking a highly motivated and experienced Project Manager*_ *- Retail Display Fixtures*_ *to oversee and manage the procurement and fabrication of Display Rollouts, predominantly in China*. The ideal candidate will ensure timely project completion by coordinating between internal teams and external vendors. The role involves end-to-end procurement, project management, quality control, logistics and delivering excellence in a fast-paced and creative environment.\n\n*Key Responsibilities:*\n* *Project Planning and Management*: Develop project plans, set timelines, and allocate resources effectively to meet client objectives and deadlines.\n* *Outsourcing Coordination*: Identify and onboard external vendors, negotiate contracts, and ensure their work aligns with project requirements.\n* *Team Collaboration*: Act as the primary point of contact between design teams, production units and clients, ensuring smooth communication and operations.\n* *Quality Assurance*: Maintain high standards by reviewing designs, prototypes, and finished props for compliance with brand guidelines and quality benchmarks.\n* *Budget Management*: Monitor project budgets, control costs, and ensure profitability without compromising quality.\n* *Vendor Management*: Build and maintain strong relationships with external suppliers, ensuring timely deliveries and competitive pricing.\n* *Compliance*: Ensure all projects meet industry standards, local regulations, and safety guidelines.\n\n*Required Skills & Qualifications:*\n* 5+ years of experience in production, outsourcing and vendor management specific to the Retail Displays and Visual Merchandising industry.\n* *Bachelor’s degree – (preferably Mechanical Engineering)*\n* Excellent organizational and multitasking skills with the ability to manage multiple projects simultaneously.\n* Proven experience in developing and implementing brand strategies.\n* *Excellent communication in English, and time management skills, with adaptability to fast-paced environments and strong ethical conduct*\n* Ability to work under pressure and meet tight deadlines.\n* Strong problem-solving and decision-making capabilities.\n\nWe offer a dynamic environment for skill growth and impactful projects. If you’re passionate about signage and have the technical expertise, please send your portfolio and resume to *hrindia@visualciti.com*\n\nJob Types: Full-time, Permanent\n\nPay: ₹50,000.00 - ₹85,000.00 per month\n\nBenefits:\n* Health insurance\nSchedule:\n* Fixed shift\n* Monday to Friday\n* Night shift\n* US shift\nSupplemental Pay:\n* Shift allowance\n* Yearly bonus\n\nWork Location: In person",
        "Salary": "₹600,000 - ₹1,020,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=47c8325d018fae04",
        "JobType": [
            "Permanent",
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Senior Software Engineer",
        "Company": "Lionbridge",
        "Location": "Mumbai, Maharashtra",
        "Description": "LIONBRIDGE EXTERNAL POSITION TITLE\n\nFor 25 years, we have helped companies connect with their global customers and employees by delivering translation and localization solutions in 350+ languages.\n\nThrough our world-class platform, we orchestrate a network of passionate experts across the globe who partner with brands to create culturally rich experiences.\n\nRelentless in our love of linguistics, we use the best of human and machine intelligence to forge understanding that resonates with our customers’ customers.\n\nBased in Waltham, Massachusetts, Lionbridge maintains solution centres in 23 countries.\n\nLionbridge is seeking a Senior Software Developer (.Net) to support our global team. Lionbridge partners with brands to break barriers and build bridges all over the world.\n\nUnit testing and refactoring is the norm in your day to day development activities. Educating and mentoring less skilled team members should come naturally.\n\nResponsibilities:\n\nDesigning process automations using C# and Microsoft .NET framework and various system's APIs;\nCreating and modifying code using APIs from specification, performing unit tests, fix defects;\nCoordinating requirements gathering with other teams/functions;\nCoordinating development work during project lifecycle;\nPreparing and delivering life-cycle documents as required by project;\nGood understanding of Azure and Azure components (CosmosDB, Service Bus, etc..)\nKnowledge of AKS would be a plus but not mandatory.\nKnowledge of Camunda would be a plus but not mandatory.\nEnsuring timeliness;\nManaging quality of deliverables;\nProactive - should be proactive to drive and own the tasks/deliverables\nSuggesting changes to development process and driving its implementation.\n\n Requirements:\n\n4 - 6 years’ experience in software development according to development standards, strong experience in C# programming;\nStrong working knowledge of C# and Microsoft .NET framework (working with 8, but 6 or 7 will also be fine), .NET Core, MS SQL Server, T-SQL;\nExpereince/Good understanding of Azure and Azure components (CosmosDB, Service Bus, etc..)\nAbility to write technical specifications, recommendations and development documentation;\nKnowledge of AKS would be a plus but not mandatory.\nKnowledge of Camunda would be a plus but not mandatory.\nGood knowledge of Object Oriented Design and Analysis;\nGood knowledge of Entity Framework, WEB API,\nKnowledge of Kubernetes and Docker;\nProactive - should be proactive to drive and own the tasks/deliverables\nVery good knowledge of English, both in speech and writing;\nStrong analytical and communication skills;\nAbility to prioritize the workload and to work to deadlines.\n\nWe offer:\n\nProfessional development opportunities in a multi-cultural environment – Lionbridge has offices in 26 countries and many of these offices work collaboratively on projects, exposing our employees to a wide range of cultures and work styles;\nAccess to the latest technological solutions;\nWork in a creative team and nice atmosphere;",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=cf2de9ad05707652",
        "JobType": [],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Architect IV",
        "Company": "CannonDesign",
        "Location": "Mumbai, Maharashtra",
        "Description": "If you think your skills, experience and aspirations make you a good match for this position, we encourage you to apply. The base location for this role will be Mumbai, India.\n\nABOUT THE ROLE\nThe successful candidate will perform the role of Architect and will be responsible for leading the development of many technical aspects and content of projects, coordinating work with all disciplines to ensure an integrated set of deliverables, and verifying compliance through team collaboration.\n\nHERE'S WHAT YOU'LL DO\nLead some elements of design, production, coordination, and architectural detailing as part of a multi-disciplinary team.\nMay lead and assist in coordination of engineering systems with engineers and consultants; actively partner with Design Leadership to carry through design intent; and coordinate with all other team members on project assignments and documents.\nPrepare design sketches of moderate to complex site plans.\nCommunicate project status, design intent, construction updates, and other critical information in a clear and compelling way to the owner(s), consultants, and clients.\nParticipate in Business Development activity and partner with Marketing and Office Leadership as needed to help grow top line.\nPerform field site inspections. Field site visits frequently require a physical walk-through of site.\nFacilitate integration of performance-based and sustainable design strategies into design solution whenever possible.\nParticipate in project teams by implementing CannonDesign Method using process expectations, best practices, reference standards, tools, templates, and technology to achieve competitive advantage, superior service delivery and quality, and enhanced team productivity and profitability.\nCreate a stimulating and rewarding environment that sets the tone for design and technical excellence.\nProvoke critical thinking and critique of work; also, identify and share lessons learned with teams\nMay provide guidance to interns and mentor less experienced team members.\nContribute to the technical quality of projects by enforcing the application of QA/QC process standards and requirements while ensuring that all statutory requirements for the project are achieved.\nPerform other duties as assigned.\nHERE'S WHAT YOU'LL NEED\nMinimum Bachelor degree in a relevant field required.\nMinimum 8+ years of related professional experience required.\nPrior experience in Healthcare, Science and Technology or Education projects is a must.\nExperience working on International Projects.\nCurrent Architectural Registration in India required.\nCDT and LEED accreditation preferred.\nKnowledge of building codes and requirements.\nMust possess business acumen.\nMust be a critical thinker.\nMust be highly analytical.\nMust be a fully qualified professional able to perform work with a high degree of latitude, with some ambiguity in work.\nMust have strong verbal and written communication skills.\nStrong technical knowledge and coordination skills.\nProficiency with Revit, Enscape, Bluebeam, Microsoft Office, and Adobe Creative Suite required.\nFor a general overview of our benefits, please visit our careers page at https://www.cannondesign.com/careers/benefits.\n\nABOUT OUR FIRM\n\nCannonDesign is a design practice where strategy, experience, architecture, engineering, and social impact converge. We don't just dream up solutions — we create and bring them to life in ways to solve some of the biggest challenges facing our clients and the society. At the heart of everything we do is Living-Centered Design, a bold commitment to using our talents to not just improve the world but to truly reshape it for the better. It's more than a philosophy — it's who we are, and it drives us to make a meaningful, lasting difference every day.\n\nABOUT WORKING HERE\nWe are relentless in our pursuit of client adoration (not simply satisfaction). Consistent delivery of the best service is what we are about.\nWe are committed to ensuring our practice is equitable for all employees, representative of the communities around us – and focused on the future of design. We advocate for equity, diversity, and inclusion efforts through the leadership of our DEI Council, Employee Resource Groups and other community advocacy initiatives.\nWe're about communication and transparency here. If you want to talk to someone about an idea you have, or a challenge that needs addressing, we're ready for you.\nPlease note that candidates can only apply to our positions on our company Careers site. It's not uncommon for scammers to create positions that look legitimate on other sites; never enter your information or apply for CannonDesign positions on any platform. Should an issue arise that you feel we should be aware of, please contact us. Please provide your resume and portfolio when applying.\n\nAs a condition of employment, all employees are expected to complete mandatory training, including compliance training, within required timeframes and adhere to our internal policies and our Code of Conduct.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=a98282f08b859589",
        "JobType": [],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Project Manager - Architectural Signage (Night Shift)",
        "Company": "Visual Citi Inc",
        "Location": "Andheri, Mumbai, Maharashtra",
        "Description": "*Timings: US (New York) Timings (06:30 PM - 04:30 AM) - NIGHT SHIFT*\n\n*Working Days: Monday - Friday*\n\n*Location: Andheri East*\n\n*Visual Citi: Your Partner in Bringing Concepts to Life* We are full-service signage, printing and fabrication company with a 100,000 square ft production facility and over 100 employees. Established in 2004, the scalable organisation delivers exceptional value through in-house graphic design, expert fabrication, and state-of-the-art machinery, continuously improving processes and using robotic automation to meet urgent deadlines with a wide range of high-quality visual products and displays.\n\n*Overview:* We are seeking a talented and experienced *Project Manager* *- Architectural Signage* to join our dynamic team. The ideal candidate will combine artistic vision with technical expertise to create impactful signage solutions for a diverse range of clients. This role requires a deep understanding of Wayfinding signage materials, ADA signage, Interior & Exterior signage\n*Key Responsibilities:*\n\n*Design Development:*\n* Create innovative and effective signage drawings for businesses, communities, retail environments, educational institutions, municipalities, governments, traffic signage, Airports\n* Produce detailed technical drawings, plans, message schedules, specifications, sections, and elevations\n* Integrate designs seamlessly with architectural drawing sets\n\n*Technical Expertise and Industry Knowledge:*\n* Utilize advanced knowledge of 2D & 3D design software to create fabrication-ready drawings and shop drawings\n* Prepare files for printing and routing, including proper setup of bleeds, drill hole locations, and substrate sizes\n* Demonstrate mastery of both vector and raster graphics, as well as CMYK and RGB color systems for large format printing\n* Comprehensive knowledge of signage materials and fabrication methods\n* Ensure designs comply with ADA standards and other relevant regulations\n* Understand sign construction for various types of exterior signs (e.g., channel letters, monument signs, pylon signs)\n\n*Required Skills & Qualifications:*\n* 4*+ years of experience in signage design or a similar role*\n* *Bachelor’s degree in architecture or Degree/Diploma in Interior Designing or Similar or Equivalent*\n* *Expert proficiency in 2D & 3D, i.e (CorelDRAW, AI, PS, Adv: AutoCAD & or SolidWorks Adobe Illustrator, Adobe Photoshop MS-Office & Outlook)*\n* Proven experience in developing and implementing brand strategies\n* Excellent understanding of typography, composition, and information design\n* Ability to visualize in both 2D and 3D\n* Experience in the signage industry and knowledge of architectural scales, sections, plans, and elevations\n* To read Architectural Floor Plans and derive scope of work for signage and branding purposes.\n* *Excellent communication in English, and time management skills, with adaptability to fast-paced environments and strong ethical conduct*\n\nWe offer a dynamic environment for skill growth and impactful projects. If you’re passionate about signage and have the technical expertise, please send your portfolio and resume to *hrindia@visualciti.com*\n\nJob Type: Full-time\n\nPay: ₹35,000.00 - ₹60,000.00 per month\n\nBenefits:\n* Health insurance\nSchedule:\n* Fixed shift\n* Monday to Friday\n* Night shift\n* US shift\nSupplemental Pay:\n* Yearly bonus\n\n\n\nEducation:\n* Bachelor's (Preferred)\n\nExperience:\n* CorelDraw: 4 years (Preferred)\n* total work: 4 years (Required)\n* AutoCAD: 4 years (Preferred)\n\nWork Location: In person",
        "Salary": "₹420,000 - ₹720,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=d33024187c785aac",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Senior QA Engineer",
        "Company": "Choice International Limited",
        "Location": "Mumbai, Maharashtra",
        "Description": "Mumbai\n\nJob Description:\n\nSenior QA Engineer\n\nYou will:\n\nLead and manage test strategies for motor and other Choice Finx products.\nDevelop and execute complex test cases across multiple platforms.\nIdentify, document, and prioritize defects using defect management tools.\nCollaborate with business analysts and developers for complete test coverage.\nStreamline workflows and optimize testing processes.\nPlan and coordinate testing tasks to meet project deadlines.\nProvide clear and actionable test reports to stakeholders.\nContinuously refine testing methodologies and integrate industry best practices.\nMentor junior testers and foster a quality-driven team culture.\nPerform database testing, write SQL queries, and validate data integrity.\nAnalyze application logs, pinpoint issues, and collaborate on resolutions.\nManage error handling, caching (Redis), and performance testing of APIs.\nVerify HTTP protocols, Linux-based testing, and socket communication.\n\nYou have:\n\n5+ years of hands-on software testing experience.\n2+ years in the FinTech domain, understanding Choice Finx’s workflows.\nExpertise in functional, regression, integration, and performance testing.\nProficiency in JIRA, TestRail, and defect tracking tools.\nStrong analytical and problem-solving skills.\nExperience with test automation (Selenium, QTP is a plus).\nProficiency in SQL for database validation.\nKnowledge of Redis, HTTP protocols, and Linux-based testing.\nExperience in API performance testing and socket-based communication.\nExcellent communication and collaboration skills.\n\nWe Are:\n\nSoftware development and consulting firm; Subsidiary of Choice International Limited which is a multi-diversified business enterprise; established in India in March 1993. The group operates from its head office in Mumbai and has zonal offices across the country and has several business verticals like Investment Banking, Broking, Hospitality, E-commerce, Energy sector etc.\nWe are fast emerging in the field of innovation to help accelerate the digital transformation journey by providing credible web solutions to foster business growth. We assist in business by offering Cloud, Mobile & IT solutions that foster efficiency, growth, and ROI. We keep in mind the goals of the organization while simultaneously enhancing efficiency. Our dynamic team comprises Web Software Developers, Cloud Architects, Technical Consultants, Data Administrators, IT Security experts, DevOps Professionals & Digital Marketing.\n\nYou & We:\n\nAs a Senior Quality Assurance Tester, you'll play a crucial role in elevating the quality and reliability of our software offerings. By applying your expertise in testing, database management, and performance testing, we will ensure that our software delivers the best user experience. Together, we'll drive forward our commitment to quality, innovation, and customer satisfaction",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=bd34461864d5ea03",
        "JobType": [],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Senior Specialist CAPA Management",
        "Company": "Johnson & Johnson",
        "Location": "Mumbai, Maharashtra",
        "Description": "The Sr Specialist will provide support in the CAPA management process and is the responsible Quality Approver. They will be responsible for executing quality reviewer/approver responsibilities for the NC/CAPA Management Process. This includes ensuring timely initiation and completion of investigations and CAPAs, collaborating with key stakeholders to resolve conflicts and align on the path forward, and determining when escalation to stakeholders or senior management is required to resolve issues. The Sr Specialist will have responsibility for ensuring the investigation and CAPA owners are progressing to plan by monitoring status and providing feedback and comments to direct progress during the investigation and root cause analysis/immediate cause phases, and during preparation of Corrective/Preventative action plans and effectiveness monitoring plans. They are knowledgeable and experienced in the CAPA management process and system and can guide and educate issue owners on best practices. Attention to detail, time management skills, and the ability to build and maintain relationships are essential.\n\nCAPA reviewer/approver for CAPA Management Process:\n\nFacilitate the initiation of investigations and CAPAs, and monitor progress and approvals.\nCollaborate with key stakeholders to support the end-to-end NC/CAPA process.\nEnsure that CAPA procedures and requirements are followed and met.\nEscalate complex issues to CIM management for resolution.\nWork with stakeholders, senior management, and governance bodies for awareness and resolution, as needed, including any issues impacting the progress toward completion of investigations, root cause analysis, impact analysis, and closure of CAPA Records.\nReview evidence and approve closure of CAPA plans.\nMonitor effectiveness of CAPAs to ensure the Root Cause is eliminated or reduced to acceptable level.\nDrive key deliverables and ensure timely completion of activities.\nSupport/Provide regular updates for CAPA status, metric reports, and trending, as needed.\nParticipate in and/or support internal audits and regulatory inspections, as needed.\nAttend, participate and/or facilitate CAPA review meetings, as needed.\nPerform other duties as necessary.\n\nDecision Making and Problem Solving:\n\nAbility to work independently and coordinate across CAPA and Issue Management (CIM). Consult with CIM management as need for resolution of complex issues.\nRequires basic management skills for cross-functional interactions and coordination. Facilitates resolution of issues and able to collaborate with stakeholders at varying levels of management across multiple organizations.\nA fundamental understanding of the risk management process to engage key stakeholders and mentor colleagues to capture insights and make risk-based decisions.\nExcellent communication and writing skills demonstrated by the ability to write executive summaries and ad hoc reports promptly and clearly as well as compile and present data to other professionals.\nRequires analytical skills to examine data and perform analysis.\nRequires decision-making skills to approve the appropriateness, effectiveness, quality and compliance of documented robust investigations, root cause analysis and corrective/preventative action plans.\n\nWorking Relationships:\n\nMust be able to effectively operate in a matrixed environment and interact with cross functional leaders on a regular basis.\nAssociate Director/Director, CAPA and Issue Management – interfaces and informs as needed to discuss issues.\nCAPA and Issue Management team members – interfaces daily as needed to manage workload; interfaces weekly in team meetings.\nR&D Senior Management, R&D Quality, Regulatory Affairs, Medical Affairs, and other business functions involved in owning investigations and delivering CAPA commitments - interfaces as needed to address identified issues and provide guidance on established processes.\nJ&J partners – must be able to effectively interact with third-party organizations, and marketing partners as needed to address cross-company and cross-departmental issues.\n\nQualifications\n\nBachelor’s Degree in Life Science or related discipline or equivalent is required.\n\nKnowledge and experience with regulations and regulatory compliance issues.\n\nAt least 3 years of experience in an applicable compliance field and or equivalent experience/training in a related R&D area.\n\nExperience with Non-Conformance/CAPA. Analytical and data skills. Excellent communication and writing skills demonstrated by the ability to develop clear and concise professional correspondence.\n\nMust be a problem solver, strategic thinker, and collaborator.\n\nExcellent organization, prioritization, and time management skills.\n\nDemonstrated competencies include adaptability, attention to detail, and ability to build and maintain relationships and partnerships across the organization.\n\nAbility to build and maintain cross-functional interactions and coordination.\n\nAbility to build consensus, influence, and negotiate.\n\nKnowledge in R&D related activities which may include safety related areas, safety reporting for both investigational and marketed products, clinical study coordination, etc.\n\nKnowledge of Quality Management, Project Management and/or Process Excellence concepts and practices.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=445ca44714df99be",
        "JobType": [],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Assistant Manager",
        "Company": "Bank of America",
        "Location": "Mumbai, Maharashtra",
        "Description": "Job Description:\n\nAbout Us\n\nAt Bank of America, we are guided by a common purpose to help make financial lives better through the power of every connection. Responsible Growth is how we run our company and how we deliver for our clients, teammates, communities and shareholders every day. One of the keys to driving Responsible Growth is being a great place to work for our teammates around the world. We’re devoted to being a diverse and inclusive workplace for everyone. We hire individuals with a broad range of backgrounds and experiences and invest heavily in our teammates and their families by offering competitive benefits to support their physical, emotional, and financial well-being.\n\nBank of America believes both in the importance of working together and offering flexibility to our employees. We use a multi-faceted approach for flexibility, depending on the various roles in our organization.\n\nWorking at Bank of America will give you a great career with opportunities to learn, grow and make an impact, along with the power to make a difference. Join us!\n\nGlobal Business Services\n\nGlobal Business Services delivers Technology and Operations capabilities to Lines of Business and Staff Support Functions of Bank of America through a centrally managed, globally integrated delivery model and globally resilient operations.\n\nGlobal Business Services is recognized for flawless execution, sound risk management, operational resiliency, operational excellence and innovation.\n\nIn India, we are present in five locations and operate as BA Continuum India Private Limited (BACI), a non-banking subsidiary of Bank of America Corporation and the operating company for India operations of Global Business Services.\n\nProcess Overview\n\nThe STR or Structured Trade Review Team is part of the Global Middle Office (GMO) Team. Structured Trade Review (STR) is a control process designed to reduce this risk for trades which are complex in form or booking, ensuring that trade economics are correctly captured and recorded in the systems according to the confirmation and term sheet\n\nJob Description\n\nReconcile the trade bookings (in at-least one asset class) in the trade/risk booking systems with the documents (Confirmation, Pricing Supplement, Term Sheet) & ensure no discrepancies\n\nEnsure trades are booked in appropriate valuation models (including MC Scripts) and the trade payoffs/ valuation parameters are correctly captured in the booking\n\nIdentify potential PnL breaks/ settlement breaks due to mis-booking, ensure the amendment of mis-booking & report MTM impact of amendments\n\nIdentify, Confirm & Report conservative valuation bookings (overhedges) & approximate bookings for trades\n\nProcess Improvement\n\nIdentify issues and control gaps in existing infrastructure\n\nWork with technology team to streamline our processes and enhance data integrity and control\n\nResponsibilities\n\nIntense work ethic with history of proven strong delivery\n\nStrong adaptability skills to to keep the focus on delivering for the business & client whilst minimizing time spent on low value additive activities\n\nPersonal effectiveness: communication, decisiveness, energy & drive, character & works diligently to achieve success\n\nStrong technical skills to understand the products and business\n\nStrong analytical skills\n\nKnowledge or experience with trading products in capital markets: Knowledge of: Fixed Income, intuitive understanding of derivative Pricing, knowledge of Financial Risk Management\n\nRequirements\n\nQualification - Post Graduation or an equivalent qualification (CFA, FRM or Any Finance related certifications)\n\nExperience Range - 6 + years - Experience in a middle office support functions or operations function for OTC derivative products\n\nFoundational skills\n\nGood Understanding of Investment Banking Products / Exotic Derivative products from a Middle Office or Back Office background.\n\nStrong communication skills across all levels of seniority especially with the Trading desk\n\nProven analytical skills including data reconciliation and interpretation\n\nDesired skills Demonstrate good Excel skills (macros, formulas) and VBA coding skills & Understanding of emerging technologies\n\nWork Timings - 11:30 AM to 08:30 PM IST\n\nJob Location - Mumbai",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=a1792babfcf293eb",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "DataIKU Developer",
        "Company": "BNP Paribas",
        "Location": "Mumbai, Maharashtra",
        "Description": "About BNP Paribas India Solutions:\n\nEstablished in 2005, BNP Paribas India Solutions is a wholly owned subsidiary of BNP Paribas SA, European Union’s leading bank with an international reach. With delivery centers located in Bengaluru, Chennai and Mumbai, we are a 24x7 global delivery center. India Solutions services three business lines: Corporate and Institutional Banking, Investment Solutions and Retail Banking for BNP Paribas across the Group. Driving innovation and growth, we are harnessing the potential of over 10000 employees, to provide support and develop best-in-class solutions.\n\nAbout BNP Paribas Group:\n\nBNP Paribas is the European Union’s leading bank and key player in international banking. It operates in 65 countries and has nearly 185,000 employees, including more than 145,000 in Europe. The Group has key positions in its three main fields of activity: Commercial, Personal Banking & Services for the Group’s commercial & personal banking and several specialised businesses including BNP Paribas Personal Finance and Arval; Investment & Protection Services for savings, investment, and protection solutions; and Corporate & Institutional Banking, focused on corporate and institutional clients. Based on its strong diversified and integrated model, the Group helps all its clients (individuals, community associations, entrepreneurs, SMEs, corporates and institutional clients) to realize their projects through solutions spanning financing, investment, savings and protection insurance. In Europe, BNP Paribas has four domestic markets: Belgium, France, Italy, and Luxembourg. The Group is rolling out its integrated commercial & personal banking model across several Mediterranean countries, Turkey, and Eastern Europe. As a key player in international banking, the Group has leading platforms and business lines in Europe, a strong presence in the Americas as well as a solid and fast-growing business in Asia-Pacific. BNP Paribas has implemented a Corporate Social Responsibility approach in all its activities, enabling it to contribute to the construction of a sustainable future, while ensuring the Group's performance and stability\n\nCommitment to Diversity and Inclusion\n\nAt BNP Paribas, we passionately embrace diversity and are committed to fostering an inclusive workplace where all employees are valued, respected and can bring their authentic selves to work. We prohibit Discrimination and Harassment of any kind and our policies promote equal employment opportunity for all employees and applicants, irrespective of, but not limited to their gender, gender identity, sex, sexual orientation, ethnicity, race, colour, national origin, age, religion, social status, mental or physical disabilities, veteran status etc. As a global Bank, we truly believe that inclusion and diversity of our teams is key to our success in serving our clients and the communities we operate in.\n\nAbout Business line/Function:\n\nThe IG (General Inspection) oversees periodic control and an independent internal audit function. It is the third line of defense, in charge of checking and evaluating the controls in place and risk management.\n\nJob Title:\n\nDataiku developer\n\nDate:\n\nDepartment:\n\nITTF\n\nLocation:\n\nMumbai\n\nBusiness Line / Function:\n\nIG\n\nReports to:\n\n(Direct)\n\nGrade:\n\n(if applicable)\n\n(Functional)\n\nNumber of Direct Reports:\n\nNA\n\nDirectorship / Registration:\n\nNA\n\nPOSITION PURPOSE\n\nThe IG DataPlatfrom project aims to answer to the various use cases of the IG around the data.\n\nA first batch is to be implemented during 2025.\n\nThe technical solution to be put in place is divided into three parts: Extraction preparation and visualization.\n\nWe need a developer to work on the data preparation of this future platform.\n\nResponsibilities\n\nDIRECT RESPONSIBILITIES\n\n· Being responsible of all the data preparation and transformation.\n\n· Migration of the existing data preparation from python & Power BI to Dataiku.\n\n· Crossing data from different sources.\n\nCONTRIBUTING RESPONSIBILITIES\n\n· Contribution to the implementation of the IG DataPlatform.\n\n· Assisting with software development tasks.\n\n· Writing code under supervision.\n\n· Debugging and testing applications.\n\n· Learning new technologies.\n\n· Collaborating with the team.\n\n· Participating in code reviews and documentation\n\nTECHNICAL & BEHAVIORAL COMPETENCIES\n\nTechnical Skills\n\nMust have\n\n· Dataiku.\n\n· Oracle data bases.\n\n· Python.\n\n· Analytic skills.\n\n· Power BI.\n\nNice to have\n\n· Testing tools.\n\nBehavioral Competencies\n\n· Abilities to understand the business.\n\n· Effective communication.\n\n· Adaptability.\n\n· Autonomous.\n\n· Time management.\n\n· Openness to feedback.\n\n· Technical redactional skills.\n\nSPECIFIC QUALIFICATIONS (IF REQUIRED)\n\nSkills Referential\n\nBehavioural Skills: (Please select up to 4 skills)\n\nAdaptability\n\nAbility to deliver / Results driven\n\nAbility to share / pass on knowledge\n\nActive listening\n\nTransversal Skills: (Please select up to 5 skills)\n\nAbility to develop and adapt a process\n\nAbility to understand, explain and support change\n\nChoose an item.\n\nChoose an item.\n\nChoose an item.\n\nEducation Level:\n\n Master Degree or equivalent\n\nExperience Level\n\nAt least 3 years\n\nOther/Specific Qualifications (if required)",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=21d3fb2be8513c44",
        "JobType": [
            "Permanent",
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Lead Software Engineer – Cloud",
        "Company": "Abbott Laboratories",
        "Location": "Mumbai, Maharashtra",
        "Description": "MAIN PURPOSE OF ROLE\n\nManages teams with focus on policy and strategy implementation and control rather than development.\n\nShort-term operational/tactical responsibilities.\n\nResponsible for designing, developing, implementing and updating electronic data systems in accordance with the needs of the organisation.\n\nMAIN RESPONSIBILITIES\n\n•Under general direction, participates as high level technical expert in design development, coding, testing, and debugging new software or significant enhancements to existing software.\n\n•Works with technical staff to understand problems with software and develops specifications to resolve them.\n\n•Activities include evaluating, scheduling and resourcing development projects, investigating user needs, writing, testing and maintaining computer programs, and preparing systems documentation.\n\n•Resolves customer complaints and responds to suggestions for improvements and enhancements.\n\n•Participates in the development of software user manuals.\n\n•May act as team leader on less complex projects.\n\n•Assists in training less experienced software development staff.\n\nQUALIFICATIONS\n\nEducation\n\nBachelors Degree (± 16 years)\n\nExperience/Background\n\nMinimum 4 years",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=6ffae7ab7d657949",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Software Test Engineer",
        "Company": "Cactus Communications Services Pte. Ltd.",
        "Location": "Maharashtra",
        "Description": "Job description:\n\nCACTUS is a remote-first organization and we embrace an accelerate from anywhere culture. You may be required to travel to our Mumbai office based on business requirements or for company/team events.\n\nA Software Test Engineer is responsible for ensuring the quality and reliability of software products by designing, implementing, and executing testing procedures. Collaborate closely with the development team to identify issues early in the development process and contribute to delivering high-quality software to end-users. This role involves creating and executing test cases, identifying and reporting defects, and providing valuable insights to improve the overall software development lifecycle.\n\nJob responsibilities:\n\nTest Case Design:\n\nDevelop comprehensive and effective test cases based on requirements and specifications.\nEnsure test cases cover functional, performance, security, and usability aspects.\n\nTest Execution:\n\nExecute test cases, both manually and using automated testing tools, to validate software functionality and identify defects.\nPerform regression testing to ensure that existing functionality is not negatively impacted by new changes.\nMonitor and analyze test results, documenting defects and anomalies encountered during testing.\nDocument defects and issues discovered during testing using a standardized defect tracking system.\nCommunicate defects to the development team and work collaboratively to ensure timely resolution.\nVerify and validate defect fixes to ensure they meet quality standards.\n\nTest Automation:\n\nIdentify opportunities for test automation and develop automated test scripts using appropriate testing frameworks and tools. (Selenium with Java preferred).\nExecute automated test suites to increase testing efficiency and coverage.\nMaintain and enhance automated test scripts as the software evolves.\n\n#LI-Remote\n\nQualifications and prerequisites:\nBachelor's degree in Computer Science, Engineering, or a related field (or equivalent experience).\nStrong understanding of software development lifecycle and testing methodologies.\nExperience with manual and automated testing techniques.\nProficiency in using testing tools and frameworks..(Selenium Webdriver using JAVA preferred).\nExcellent analytical and problem-solving skills.\nStrong attention to detail and ability to prioritize tasks effectively.\nGood communication and interpersonal skills.\nAbility to work collaboratively in a team environment.\nFamiliarity with programming languages, version control systems, and continuous integration tools is a plus.\nBenefits of this role:\n\nInclude benefits for roles in US, UK, Japan, China and Korea.\n\nApplication process:\n\nBefore applying, please ensure you meet the role requirements listed above and have legal authorization to work in the country where this role is advertised. Our selection process typically involves an initial screening by a recruiter, a technical assessment, and two to three interview rounds.\n\nFor this role, the process begins with an initial interview, lasting 60 minutes, which includes a technical assessment and evaluation of test scenarios. Following this, candidates will participate in a second interview, also lasting 60 minutes, where both technical skills and team fitment will be discussed. The final step is a 30-minute HR interview. All interviews will be conducted virtually via MS Teams.\n\nEqual Opportunity\n\nOur hiring practices reflect our commitment to providing equal opportunities and creating an environment where everyone can thrive, develop, and succeed. We celebrate the uniqueness of our team members and prohibit discrimination of any kind, based on race, color, religion, gender identity, sexual orientation, age, marital status, disability, or any other protected characteristic.\n\nAccelerating from Anywhere\n\nAs a remote-first organization, these are essential attributes we look for in all our candidates.\n\nTaking ownership of your work with minimal supervision, showing strong ability to organize, prioritize and deliver results independently.\nDocumenting work that brings everyone on the same page.\nMaturity to choose between synchronous and asynchronous collaboration.\nEffectively collaborating with colleagues across different time zones by setting dedicated hours for collaboration and keeping team members updated through your MS Teams status.\nAbout Us:\n\nAt Cactus Communications, we break barriers between science and researchers. We are a science communication and technology company. We specialize in AI products and solutions that improve how research gets funded, published, communicated, and discovered. At CACTUS, we champion an \"accelerate from anywhere\" culture that fuels our high-performance mindset. Flexibility isn't just a benefit—it’s the cornerstone of our productivity. By empowering our teams to work when and where they thrive best, we ensure innovation, drive, and excellence remain at the heart of everything we do. Together we, Power research. Empower people.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=4727eca2a6189312",
        "JobType": [],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Senior Specialist - Technical Support",
        "Company": "Linedata Services",
        "Location": "Mumbai, Maharashtra",
        "Description": "Client Services\nMumbai\nHybrid\n\nAbout Us\nWHY Linedata?\n\nLinedata is an award-winning software solutions company. We believe finance matters to our society as much as energy to life and fueling financial transformation is vital for development and leadership.\n\nWe humanize technology :\n\nWe are passionate experts who provide investment management and credit communities with innovative, user-friendly products which help their businesses grow in over 50 countries\nOur environment is international, ego-free and relaxed. We believe in building confidence through giving clear responsibilities to our team members and managing to given goals and targets. We celebrate success and we enjoy each other’s company\nWe employ more than 1100 employees representing 40 nationalities spread throughout our offices in 14 countries. We believe in mobility, diversity & teamwork.\nOur mission is to continue to find new ways to create and build flexible, mission-critical software and services and to stay on the cutting edge of the financial software space.\n\nJOIN THE MOVEMENT\n\nWe provide the investment management and credit communities with an innovative, user-friendly suite of products that, through detailed market and client insights, help their business to grow in over 50 countries.\n\nWe are transforming the financial services community which is in constant evolution.\n\nWith our agility, we make technology simple & accessible for our users. Let’s work together to achieve the best solutions for our clients.\n\nChat with our insiders and learn more about your future role at Linedata! Start the conversation: here\n\nCommitment to Diversity\n\nWe recognize, celebrate, and seek to increase diversity across our organization. Diversity is an asset to organizations and is linked to better performance. It is an integral part of how we do business and imperative to our success. As an international Group, we also believe that our people need to reflect our clients and local communities.\n\nLinedata is an Equal Opportunity Employer. We are committed to complying with all federal, state, and local laws providing equal employment opportunities, and all other employment laws and regulations.\n\nIt is our intent to maintain a work environment that is free of harassment, discrimination, or retaliation based on an individual's race, color, religion, religious creed, national origin, ancestry, citizenship, physical or mental disability, medical condition, genetic information, marital status, sex, gender, age, sexual orientation, veteran and/or military status, protected medical leaves, domestic violence victim status, political affiliation, or any other status protected by federal, state, or local laws.\nJob Description\nDescription\nThe Senior Technical Support Specialist provides technical and application support for Linedata's front and middle office product lines.\nThe Senior Technical Support Specialist role is a Level 2 technical position, responsible for providing support to the Level 1 Support Helpdesk through the means of internal triage and escalation. Support issues involve both technical and business-related issues, so the Senior Technical Support Specialist will be expected to work and communicate effectively with both internal Linedata resources (Level 1 Support, DBAs, Developers, Product owners, etc.) and, at times, end users (Traders, Business Analyst, Compliance Officers, Trade Support, etc.) of the Linedata Product suite. The ideal candidate needs to be able to efficiently diagnose, troubleshoot, resolve and escalate issues as needed. In addition, the ideal candidate will be involved in helping with on-boarding and mentoring new employees, as well as collaborating with current employees.\nThis position will require weeknight and weekend availability for month-long support on-call rotation, twice to three times per year.\nEssential Duties/Responsibilities\nResearch, diagnose, troubleshoot and identify solutions to resolve customer issues related to application use and configuration.\nProvide prompt and accurate responses to customers within SLAs as defined by the level of Service purchased by the customer.\nProperly prioritize all customer incidents.\nFoster and maintain mentoring relationships with Level 1 Support Helpdesk employees.\nUnderstand and use Linedata’s proprietary issue management tool, KEN – including how to update, escalate and resolve incidents.\nAbility to interact with various levels of client and firm management through both written and verbal communications.\nReport software issues to Product Development via documented processes and procedures, including replicating the issue when possible and performing all due diligence.\nIdentify workarounds to bugs and customer issues whenever possible.\nManage multiple client issues simultaneously.\nIdentify common issues and techniques for addition to Knowledge Base.\nMay support senior teams on client projects to learn through experience.\nWork to understand client's business needs above and beyond the immediate requirements.\nCompetencies\nTask Management – Organizing and prioritizing tasks. Managing time to maximize personal productivity. Estimating task duration and completing tasks when promised. Multi-tasking.\nComplex Problem Solving — Identifying complex database performance or operational problems. Reviewing related information to develop and evaluate options and implement solutions.\nCritical Thinking – Using logic and reasoning to identify the strengths and weaknesses of alternative solutions, conclusions or approaches to problems. Making good decisions and solving problems while under pressure.\nAttitude & Teamwork– Projecting confidence tempered with humility. Must be a team player willing both to steer the team towards success and to fully support the team when others are steering.\nDeductive Reasoning — The ability to apply general rules to specific problems to produce answers.\nProblem Sensitivity — The ability to tell when something is wrong or is likely to go wrong. Recognizing there is a problem and informing the resources who can address the problem.\nAnalyzing Data or Information — Identifying the underlying principles, reasons, or facts of information by breaking down information or data into separate parts.\nThinking Creatively — Developing, designing, or creating new applications, ideas, relationships, systems, or products, including artistic contributions.\n\nJob Requirement\nRequirements\n· Bachelor’s degree in relevant field.\n· 5-7 years technical software support experience.\n· Experience working in a financial services/software client support environment with an understanding of buy side trading applications, protocols, and interfacing applications. (OMS, EMS, FIX protocol, etc).\n· Knowledge of IT infrastructure and Windows OS in a support related setting.\n· Solid business acumen and awareness of trading/portfolio management/trade operations implications of decisions.\n· Candidates must be ambitious, self-driven, and looking to work in a fast-paced environment.\n· Ability to thrive in a collaborative and team driven environment that requires flexibility, good judgment and sound decision-making based on limited information and/or extreme conditions.\n· Strong problem solving and troubleshooting skills with a sense of urgency to be able to quickly and confidently assess risks as it pertains to client deliverables/tasks as they arise.\n· Excellent oral and written communication skills.\n· Proven ability to understand and develop concept driven solutions and problems.\n· Ability to work on an on-call basis and provide coverage during non-standard (M-F 8-6) business hours including public/market holidays.\n· Mindset for automation, rather than creating and continually supporting manual processes.\nDemonstrated technical skills in some or all of the following areas:\n· General Sysadmin expert.\n· Comprehensive knowledge of Windows Systems and applications.\n· Very strong working knowledge of SQL: reading and developing complex T-SQL, develop and analyze stored procedures, use tracing tools such as SQL Profiler, PSSDiag, SQLNexus to investigate performance issues, etc.\n· Working knowledge of ETL (i.e. Powershell, SSIS, Python)\n· Working knowledge of Scheduling Systems and the ability to both create and modify automated processes.\n· Exposure and working knowledge of creating re-usable Powershell scripts\n· Understanding of File Transfer Protocol (FTP), including encryption techniques such as PGP and SFTP.\n· Exposure and working knowledge of Cloud Infrastructure (AWS, Azure)\n· Exposure and working knowledge of network and domain architecture.\n· Exposure and working knowledge of RDBMS\n· Exposure to programming environments a plus (e.g. Visual Studio and Visual Studio Code)\n· Exposure to programming languages a plus (e.g. C++\\VB\\.C#\\.NET)",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=b14962ca96678e76",
        "JobType": [],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "HR Executive - Technical & IT Positions",
        "Company": "Karishma Marine Solutions Pvt Ltd",
        "Location": "Andheri, Mumbai, Maharashtra",
        "Description": "We are hiring for HR role.\n\nLocation- Andheri MIDC\n\nWorking Days: Monday to Saturday with 1st and 3rd saturdays and all sunday weekly off\n\n\n\n*Job Description:*\n* Managed end-to-end recruitment for technical roles, including senior software developers, web developers, UI/UX developers, mobile app developers, QA testers, and IT support.\n* Collaborate with department leads to understand job requirements and ensure recruitment aligns with organizational needs.\n* Oversee HR administration, including maintaining employee records, managing benefits, and preparing reports.\n* Handle all aspects of employee onboarding, attendance management, and performance evaluations.\n* Support daily HR operations and act as a point of contact for employee concerns.\n\n*Requirements:*\n* Post-graduation, Diploma, or MBA in HR Management.\n* 2-3 years of HR experience, preferably with IT/software recruitment.\n* Familiarity with handling IT roles, especially in software development, web development, mobile app development, and IT support.\n\nIf interested please share resumes on hr@karcoservices.com\n\nJob Types: Full-time, Permanent\n\nPay: ₹35,000.00 - ₹45,000.00 per month\n\nSchedule:\n* Day shift\n\n\n\nExperience:\n* total work: 2 years (Preferred)\n\nWork Location: In person",
        "Salary": "₹420,000 - ₹540,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=367b7ec2a218eb06",
        "JobType": [
            "Permanent",
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Measurement & Report Analyst",
        "Company": "Accenture",
        "Location": "Mumbai, Maharashtra",
        "Description": "Skill required: Business Reporting & Governance - Reporting Analytics\nDesignation: Measurement & Report Analyst\nQualifications:Any Graduation\nYears of Experience:3 to 5 years\nAbout Accenture\nAccenture is a global professional services company with leading capabilities in digital, cloud and security.Combining unmatched experience and specialized skills across more than 40 industries, we offer Strategy and Consulting, Technology and Operations services, and Accenture Song— all powered by the world’s largest network of Advanced Technology and Intelligent Operations centers. Our 699,000 people deliver on the promise of technology and human ingenuity every day, serving clients in more than 120 countries. We embrace the power of change to create value and shared success for our clients, people, shareholders, partners and communities.Visit us at www.accenture.com\nWhat would you do? The Business Reporting and Governance vertical helps to deploy and deliver robust tracking mechanism for SLA/KPI or any other operations on a day-to-day basis. The Governance team will be responsible for contractual compliance of various aspects of contract like Governance, Reporting, Incident Management, Change Management and Survey Management along with driving automation and analytics. Assessing, managing, using, improving, monitoring, maintaining, and protecting organizational information through a system of decision rights and accountabilities for information related processes, executed according to agreed-upon models which describe who can take what actions, with what information, when, under what circumstances and using what methods. Candidate who is good in excel and MIS reports are looked at for these skills In Reporting and Analytics, you will have to prepare management reports and analysis, both recurring and ad-hoc. This includes focusing on tracking business performance through trusted data and insights while actively managing employee behaviors.\nWhat are we looking for? Effective communication and organization skills with Polished, professional presence Experience in working on automation projects Demonstrate ability to achieve customer satisfaction through a managed service framework. Facilitation skills and Virtual teaming experience Adaptability to change. Effective collaboration skills and experience Adept in working across a heavily matrixed organization. Proficient in MS Office with advance knowledge in excel formulas. Ability to simplify and automate manual intensive processes using basic VBA, MS Access Expertise in creating reports, and exposure to using PowerBI\nRoles and Responsibilities: Create and Publish Daily / Weekly / Monthly Reports on time with accuracy. Deliver ad hoc reports. Find trends in data to spot any anomaly / provide data insights to the stake holders. Automate reports to reduce manual efforts.\n\nAny Graduation",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=c787f739a97e25f9",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Java/Python Developer - Machine Learning & Data Science Expertise",
        "Company": "Zycus",
        "Location": "Mumbai, Maharashtra",
        "Description": "About Us\nZycus is a pioneer in Cognitive Procurement software and has been a trusted partner of choice for large global enterprises for two decades. Zycus has been consistently recognized by Gartner, Forrester, and other analysts for its Source to Pay integrated suite. Zycus powers its S2P software with the revolutionary Merlin AI Suite. Merlin AI takes over the tactical tasks and empowers procurement and AP officers to focus on strategic projects; offers data-driven actionable insights for quicker and smarter decisions, and its conversational AI offers a B2C type user-experience to the end-users.\n\nZycus helps enterprises drive real savings, reduce risks, and boost compliance, and its seamless, intuitive, and easy-to-use user interface ensures high adoption and value across the organization.\n\nStart your #CognitiveProcurement journey with us, as you are #MeantforMore\n\nWe Are An Equal Opportunity Employer:\nZycus is committed to providing equal opportunities in employment and creating an inclusive work environment. We do not discriminate against applicants on the basis of race, color, religion, gender, sexual orientation, national origin, age, disability, or any other legally protected characteristic. All hiring decisions will be based solely on qualifications, skills, and experience relevant to the job requirements.\nJob Description\nWe are seeking a highly skilled and motivated Machine Learning and Data Science Engineer to join our dynamic team. The ideal candidate will have a strong background in machine learning, data science, and software development, with proficiency in Java and Python programming stacks. Additionally, the candidate should have experience with NoSQL databases and cloud technologies. Successful candidates must have a proven track record of solving industry problems and possess 2-5 years of relevant experience.\n\nResponsibilities:\nDevelop and implement machine learning models and algorithms to address complex business challenges.\nAnalyze large datasets to extract meaningful insights and drive data-driven decision making.\nCollaborate with cross-functional teams to design and build scalable data solutions.\nUtilize Java and Python programming stacks to develop and maintain software applications.\nWork with NoSQL databases to store and manage unstructured data efficiently.\nDeploy and manage applications on cloud platforms such as AWS, Azure, or Google Cloud.\nContinuously research and stay updated with the latest advancements in machine learning and data science technologies.\nDocument processes, models, and code to ensure knowledge sharing and maintainability.\nJob Requirement\nPreferred candidate would have:\nBachelor’s or master’s degree in computer science, Data Science, or a related field.\n2-5 years of experience in machine learning, data science, or related roles.\nProficiency in Java and Python programming stacks.\nShould be able Deliver End to End AI based solution.\nMust have experience in GenAI.\nExperience with NoSQL databases such as MongoDB, Cassandra, or Couchbase.\nFamiliarity with cloud technologies, including AWS, Azure, or Google Cloud.\nStrong problem-solving skills and the ability to work independently and collaboratively.\nExcellent communication skills and the ability to convey complex technical concepts to non-technical stakeholders.\nProven ability to analyze large datasets and derive actionable insights.\nPreferred Expertise:\nExperience in deploying machine learning models in a production environment.\nKnowledge of big data technologies such as Hadoop, Spark, or Kafka.\nFamiliarity with containerization technologies such as Docker and Kubernetes.\nExperience with version control systems like Git.\nProficiency in Java Full Stack Development.\nProficiency in Python Full Stack Development.\nProficiency in SDLC\nProficiency in Data Structures.\nProficiency in Database Technologies.\nProficiency in GenAi python Stack for Development.\nFive Reasons Why You Should Join Zycus:\n\n• Cloud Product Company: We are a Cloud SaaS Company, and our products are created by using the latest technologies like ML and AI. Our UI is in Angular JS, and we are developing our mobile apps using React.\n• A Market Leader: Zycus is recognized by Gartner (world’s leading market research analyst) as a Leader in Procurement Software Suites.\n• Move between Roles: We believe that change leads to growth and therefore we allow our employees to shift careers and move to different roles and functions within the organization\n• Get a Global Exposure: You get to work and deal with our global customers.\n• Create an Impact: Zycus gives you the environment to create an impact on the product and transform your ideas into reality. Even our junior engineers get the opportunity to work on different product features.\n\nAbout Us\nZycus is a pioneer in Cognitive Procurement software and has been a trusted partner of choice for large global enterprises for two decades. Zycus has been consistently recognized by Gartner, Forrester, and other analysts for its Source to Pay integrated suite. Zycus powers its S2P software with the revolutionary Merlin AI Suite. Merlin AI takes over the tactical tasks and empowers procurement and AP officers to focus on strategic projects; offers data-driven actionable insights for quicker and smarter decisions, and its conversational AI offers a B2C type user-experience to the end-users. Zycus helps enterprises drive real savings, reduce risks, and boost compliance, and its seamless, intuitive, and easy-to-use user interface ensures high adoption and value across the organization.\nStart your #CognitiveProcurement journey with us, as you are #MeantforMore",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=605a6df37a8fee54",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Senior Associate - EQD - P&L Production and Explain - EMEA",
        "Company": "BNP Paribas",
        "Location": "Mumbai, Maharashtra",
        "Description": "Job Description\n\nAbout BNP Paribas India Solutions:\n\nEstablished in 2005, BNP Paribas India Solutions is a wholly owned subsidiary of BNP Paribas SA, European Union’s leading bank with an international reach. With delivery centers located in Bengaluru, Chennai and Mumbai, we are a 24x7 global delivery center. India Solutions services three business lines: Corporate and Institutional Banking, Investment Solutions and Retail Banking for BNP Paribas across the Group. Driving innovation and growth, we are harnessing the potential of over 10000 employees, to provide support and develop best-in-class solutions.\n\nAbout BNP Paribas Group:\n\nBNP Paribas is the European Union’s leading bank and key player in international banking. It operates in 65 countries and has nearly 185,000 employees, including more than 145,000 in Europe. The Group has key positions in its three main fields of activity: Commercial, Personal Banking & Services for the Group’s commercial & personal banking and several specialised businesses including BNP Paribas Personal Finance and Arval; Investment & Protection Services for savings, investment, and protection solutions; and Corporate & Institutional Banking, focused on corporate and institutional clients. Based on its strong diversified and integrated model, the Group helps all its clients (individuals, community associations, entrepreneurs, SMEs, corporates and institutional clients) to realize their projects through solutions spanning financing, investment, savings and protection insurance. In Europe, BNP Paribas has four domestic markets: Belgium, France, Italy, and Luxembourg. The Group is rolling out its integrated commercial & personal banking model across several Mediterranean countries, Turkey, and Eastern Europe. As a key player in international banking, the Group has leading platforms and business lines in Europe, a strong presence in the Americas as well as a solid and fast-growing business in Asia-Pacific. BNP Paribas has implemented a Corporate Social Responsibility approach in all its activities, enabling it to contribute to the construction of a sustainable future, while ensuring the Group's performance and stability\n\nCommitment to Diversity and Inclusion\n\nAt BNP Paribas, we passionately embrace diversity and are committed to fostering an inclusive workplace where all employees are valued, respected and can bring their authentic selves to work. We prohibit Discrimination and Harassment of any kind and our policies promote equal employment opportunity for all employees and applicants, irrespective of, but not limited to their gender, gender identity, sex, sexual orientation, ethnicity, race, colour, national origin, age, religion, social status, mental or physical disabilities, veteran status etc. As a global Bank, we truly believe that inclusion and diversity of our teams is key to our success in serving our clients and the communities we operate in.\n\nAbout Businessline / Function :\n\nProduct Control is part of COCE (Client Operating Centre of Excellence), performing multiple Middle Office functions. Product Control have 6 verticals - P&L and Valuation Controls, OTC Trade Validation, Securities Trade Validation & Documentation, OTC Documentation, Trading & Portfolio Control and Position Management. Team works very closely with Trading, Sales, Business Managers and various FtB teams like Back Office, Regional Finance and COO community\n\nJob Title:\n\nSeninor Associate - EQD - P&L Production and Explain - EMEA\n\nDate:\n\n2025\n\nDepartment:\n\nCOCE – Product Control\n\nLocation:\n\nMumbai / Bangalore\n\nBusiness Line / Function:\n\nCOCE – Product Control\n\nReports to:\n\n(Direct)\n\nGrade:\n\n(if applicable)\n\nNA\n\n(Functional)\n\nHead of the Team\n\nNumber of Direct Reports:\n\nDirectorship / Registration:\n\nNA\n\nPOSITION PURPOSE\n\n· Provide a daily Economic, Step Reval and Risk Based PNL to each desk and to the Bank’s management.\n\n· Ensure that the PNL is calculated from the reference positions and that these positions are real and checked.\n\n· Escalate any unusual P&L to the desk and management that may indicate a wrong position or transaction in the FO system.\n\n· Run all the required controls on key elements of the PNL\n\nResponsibilities\n\nDIRECT RESPONSIBILITIES\n\n· Document all exceptional PNL moves and adjustments for Management.\n\n· Produce accurate daily analysis of P&Ls to Trading desks and bank's management. This includes the 3 different P&L analysis required by the internal Valuation Policy and Regulators:\n\n· Economic P&L (cash + PV) for Management and Accounting P&L reconciliation (performed by Finance)\n\n· Step Reval P&L for VaR back-testing feeds and contribution to Regulatory ratios (used in the Dodd Franck and French Banking Law ratio calculations)\n\n· Risk based P&L to validate the FO risk and models.\n\n· Responsible for daily and monthly controls on key elements (positions, market data, adjustments, reserves) and liaise with internal departments in case of issues.\n\n· Perform FO/MO reconciliations between Trading P&L estimations at T and Official MO P&L at T+ 1 and both explain and investigate P&L breaks to FO if any.\n\n· Adjust the P&L if necessary to secure correct P&L reporting and document each\n\n· Monitor daily Funding and fees.\n\n· Interact daily with traders to explain the results of their P&Ls and seek their daily sign-off.\n\n· Report, Comment and Validate the P&Ls into the Official Reporting tool\n\n· Monitor and reconcile monthly R-IM and V&RC reserves during EOM process.\n\n· Active follow up on updating documentation.\n\n· Organize a monthly meeting with trading to go through all P&L issues during the last month.\n\n· Escalate issues to management on the fly and via Orus.\n\n· Confirm PV to dependent team/business.\n\nCONTRIBUTING RESPONSIBILITIES\n\n· Participate to global projects related to MO or P&L processes improvements.\n\n· Participate to local projects related to systems migrations.\n\n· Participate to the improvement of the productivity within the team by proposing initiatives\n\nTECHNICAL & BEHAVIORAL COMPETENCIES\n\n· Strong products knowledge including its models and valuations\n\n· Competency with MS Suite, especially Excel\n\n· Communication Skills\n\n· Decision Making\n\n· Adaptability & Change Management:\n\n· Ability to develop and leverage networks\n\n· Ability to develop and adapt a process\n\n· Result oriented approach\n\n· Collaborate with remote teams\n\nSPECIFIC QUALIFICATIONS (IF REQUIRED)\n\n· Attention to detail: Ability to notice any abnormal processes as well as any unusual dividends or prices for instance when monitoring and reconciling the various market data.\n\n· Adaptability & Change Management: Ability to easily adapt to new situations (new booking systems, new products, new activities to manage…) as this is a constant changing environment\n\n· Strong Client Focus: Capacity to work with various clients, especially FO. Need to be sensitive about the rationale of their requests and be proactive when replying to them. Work as partnership while consistently keeping an independent mindset.\n\n· Escalation & Reporting process: Internal rules of reporting and escalation to Ops and FO need to be known & applied. The team member also needs to report any sensitive information/issues and escalate immediately to their management to allow proper time resolution\n\nSkills Referential\n\nBehavioural Skills: (Please select up to 4 skills)\n\nAbility to collaborate / Teamwork\n\nCritical thinking\n\nCreativity & Innovation / Problem solving\n\nResilience\n\nTransversal Skills: (Please select up to 5 skills)\n\nAbility to set up relevant performance indicators\n\nAbility to develop others & improve their skills\n\nAnalytical Ability\n\nAbility to develop others & improve their skills\n\nAbility to understand, explain and support change\n\nEducation Level:\n\nBachelor Degree or equivalent\n\nExperience Level\n\nAt least 3 years\n\nOther/Specific Qualifications (if required)\n\nCA/CFA, FRM or equivalent",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=26e79a76a4964005",
        "JobType": [
            "Permanent",
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Legal Counsel I",
        "Company": "Worley",
        "Location": "Mumbai, Maharashtra",
        "Description": "Legal Counsel I - MUM028R\nCompany: Worley\nPrimary Location: IND-MM-Mumbai\nJob: Counsel\nSchedule: Full-time\nEmployment Type: Employee\nJob Level: Experienced\nJob Posting: Feb 11, 2025\nUnposting Date: Mar 13, 2025\nReporting Manager Title: Legal Counsel\n:\n\nWe deliver the world’s most complex projects.\nWork as part of a collaborative and inclusive team.\nEnjoy a varied & challenging role.\n\nBuilding on our past. Ready for the future\n\nWorley is a global professional services company of energy, chemicals and resources experts headquartered in Australia.\n\nRight now, we’re bridging two worlds as we accelerate to more sustainable energy sources, while helping our customers provide the energy, chemicals and resources that society needs now.\n\nWe partner with our customers to deliver projects and create value over the life of their portfolio of assets. We solve complex problems by finding integrated data-centric solutions from the first stages of consulting and engineering to installation and commissioning, to the last stages of decommissioning and remediation. Join us and help drive innovation and sustainability in our projects.\n\nThe Role\n\nAs an Legal Counsel with Worley, you will work closely with our existing team to deliver projects for our clients while continuing to develop your skills and experience etc.\n\nWe are seeking an experienced and highly motivated Contracts and Legal Manager - Technology based in India to provide legal support for our digital consulting operations in Australia, Canada, the Middle East, Europe, the UK and the USA.\nThis remote role requires a technology contracts expert with a robust background in the energy and resources sector. The ideal candidate will possess a deep understanding of international law and experience working on multi-jurisdictional projects (including knowledge and experience in local laws in Australia and the USA), regulatory and taxation frameworks, and the unique challenges of the sectors we work in.\nThe individual must have a safety mindset and exhibit Worley’s values and behaviours – Life, Rise to the Challenge, Stronger Together and Unlock.\n\nKey Accountabilities:\n\nAdvisory: Provide support and strategic advice on a wide range of contractual and commercial issues related to software licensing, software development, software distribution and reselling, intellectual property protections and technology commercialization.\nContract Management: Draft, review, and negotiate a variety of technology-related contracts, including software licensing agreements, SaaS/PaaS/IaaS, software distribution and reseller agreements, hosting agreements, and engineering software agreements ensuring alignment with industry best practices and legal standards.\nRegulatory Compliance: Monitor and interpret relevant laws and regulations in Australia and the USA, ensuring the company's operations adhere to all legal requirements.\nStakeholder Collaboration: Work closely with internal teams, including project managers, engineers, and management, to provide proactive contractual support and facilitate smooth project execution.\nRisk Management: Identify and mitigate potential legal risks associated with technology projects, implementing strategies to protect the company’s interests and reputation.\nCompliance and Governance: Advise on compliance with Worley’s policies and standards, including delegations of authority.\n\nAbout You\n\nTo be considered for this role it is envisaged you will possess the following attributes:\n\nBachelor’s degree in Law (LLB) from a recognized university. Australian or international qualifications, including master’s degree or specialist accreditations, are highly regarded.\nMinimum of 5 years of post-legal qualification experience, with a significant focus on technology related projects within the energy and resources sector, particularly in engineering and renewable energy and sustainability projects internationally.\nA combination of in-house and private legal practice experience is preferred.\nIn-depth knowledge and experience of a wide variety of technology agreements and commercial transactions.\nFamiliarity with the Australian and US legal systems, legislation and industry standards.\nStrong analytical and problem-solving skills, with the ability to navigate complex legal issues.\nExcellent drafting, communication and negotiation skills, with the ability to effectively interact with diverse stakeholders.\nDemonstrates initiative and a willingness to learn and continuously improve on performances.\nDeliver quality services and demonstrate a commitment to understand and meet customer needs.\nAble to work on multiple projects of various size and complexity across multiple jurisdictions.\nAbility to work independently and remotely, managing multiple priorities and deadlines.\n\nOther Attributes:\n\nReporting: This role will report into the General Counsel – Growth & Transformation based in Sydney.\nDiversity & Inclusion: We prioritize creating a workplace where every individual feels valued, respected, and empowered to contribute their unique perspectives and experience. We are an equal opportunity employer and committed to building a diverse team. We welcome applications from candidates of all backgrounds, including those from underrepresented groups.\n\nMoving forward together\n\nWe want our people to be energized and empowered to drive sustainable impact. So, our focus is on a values-inspired culture that unlocks brilliance through belonging, connection and innovation.\n\nWe’re building a diverse, inclusive and respectful workplace. Creating a space where everyone feels they belong, can be themselves, and are heard.\n\nAnd we're not just talking about it; we're doing it. We're reskilling our people, leveraging transferable skills, and supporting the transition of our workforce to become experts in today's low carbon energy infrastructure and technology.\n\nWhatever your ambition, there’s a path for you here. And there’s no barrier to your potential career success. Join us to broaden your horizons, explore diverse opportunities, and be part of delivering sustainable change.\n\nWorley takes personal data protection seriously and respects EU and local data protection laws. You can read our full Recruitment Privacy Notice Here.\n\nPlease note: If you are being represented by a recruitment agency you will not be considered, to be considered you will need to apply directly to Worley.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=c3de092551aeba8b",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Consulting Services Sales Acct Manager 4",
        "Company": "Adobe",
        "Location": "Mumbai, Maharashtra",
        "Description": "Our Company\n\nChanging the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.\n\nWe’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!\n\nPosition Overview:\nAdobe is looking for a motivated Professional Services Sales Manager to spearhead sales initiatives for our strategic customers across Digital Experience Cloud in Mumbai. This role is essential in driving the adoption of Adobe’s solutions by helping customers realize value through tailored services engagements. You will be responsible for driving pipeline, achieving revenue targets, and building strong customer relationships while collaborating with internal cross-functional teams to deliver transformative digital experiences.\n\nKey Responsibilities:\n\nSales Leadership:\nDrive Professional Services sales, achieving and exceeding quarterly and annual revenue targets.\nDevelop and implement account-specific services strategies to drive adoption and improve customer success.\n\nCustomer Engagement:\nAct as a trusted advisor to C-suite and senior executives, understanding business challenges and aligning Adobe’s solutions to meet strategic objectives.\nDevelop strong, lasting relationships with clients to secure long-term partnerships.\n\nCollaboration with Stakeholders:\nPartner with the License Sales team to drive alignment between software and services opportunities.\nCollaborate with delivery and consulting teams to ensure smooth project scoping, planning, and execution.\n\nConsultative Selling:\nUnderstand and communicate Adobe’s Digital Experience Cloud offerings, tailoring services solutions to customer needs.\nLead workshops and discovery sessions to uncover business challenges and define project scope.\nMarket Strategy and Enablement:\n\nIdentify new market opportunities and emerging trends to expand Adobe’s presence in Mumbai.\nProvide feedback to Product and Delivery teams to enhance offerings and drive market relevance.\nQualifications:\n\nExperience:\n\n10+ years of experience in Professional Services Sales, Business Consulting, or Enterprise Software Sales, preferably in Customer Experience Management (CXM), Digital Marketing, or Cloud technologies.\nProven track record of meeting/exceeding revenue targets and successfully leading complex, multi-stakeholder deals.\n\nSkills:\nStrong consultative selling skills with the ability to define and articulate value-based services solutions.\nExcellent stakeholder management, critical thinking, and negotiation skills.\nProficiency in understanding technical concepts and aligning them with business outcomes.\n\nEducation:\nBachelor's degree in Business, Technology, or related fields (MBA or equivalent experience preferred).\n\nAttributes:\nStrong interpersonal and communication skills in English.\nGoal-oriented and skilled in managing ambiguity.\nCollaborative mindset with the ability to work across teams and regions.\n\nAdobe is proud to be an Equal Employment Opportunity and affirmative action employer. We do not discriminate based on gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other applicable characteristics protected by law. Learn more.\n\nAdobe aims to make Adobe.com accessible to any and all users. If you have a disability or special need that requires accommodation to navigate our website or complete the application process, email accommodations@adobe.com or call (408) 536-3015.\n\nAdobe values a free and open marketplace for all employees and has policies in place to ensure that we do not enter into illegal agreements with other companies to not recruit or hire each other’s employees.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=55459cbe4a13d2b2",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "PHP / Laravel web Developer",
        "Company": "PPFAS Mutual Fund",
        "Location": "Andheri, Mumbai, Maharashtra",
        "Description": "PPFAS Asset Management (PPFAS AMC) has been promoted by Parag Parikh Financial Advisory Services Pvt. Ltd. (PPFAS Ltd.), a boutique investment advisory firm incorporated in 1992. PPFAS Ltd. is also amongst India's earliest SEBI Registered Portfolio Management Service (PMS) providers.PPFAS Mutual Fund is a Value Investment oriented asset management company focused on long term wealth creation for our investors. We prefer an investment approach which is beneficial to our investors in the long run & also for our own investment needs. Our schemes are designed to help simplify & declutter the product choices for our investors. For More Information visit our website: https://amc.ppfas.com/about-us/Job Description:Seeking for an experienced developer to help in the design, development, and delivery of web apps, API, and our mobile app.Working in a full-stack role for the SelfInvest web app and the Partners web app.Building and maintaining API which is consumed by the SelfInvest Mobile app.Integrate highly critical third-party APIs into both SelfInvest and Partners apps.Work closely and collaborate with stakeholders to understand requirements, formulate plans and implement them yourself or with the help of junior developers.Suggest UI/UX design ideas, relational database design, and system design when planning features.Document features and follows agile processes for software development.Test features thoroughly before deploying to production.Participating in code reviews and mentoring junior developers.Collaborate with other teams to generate reports as and when required.Optionally contribute to Mobile app development.Qualification & Experience5-6 years of experience.Experience and proficiency inPHP and Laravel version 8+HTMLCSSJavaScript and jQueryMySQLGit or other version controlExperience in building, and maintaining APIs for mobile apps.Experience in integrating third-party APIs.Knowledge of REST, JSONAbility to identify scope for improvements in products and take initiative and ownership of features.Strong logical and analytical skills for debugging and fixing bugs.Ability to read and understand code for legacy projects.Knowledge of best practices for performance and security.Strong communication skills and willingness to collaborate with stakeholders to understand requirements and formulate plans.Ability to take features from concept to deployment while keeping in mind user experience, reliability, and scalability.Able to come up with clean UI/UX design ideas, relational database design, and system design.Self-driven and motivated, popularly known as “Manager of one” (Read this blog).Comfortable in communicating clearly during meetings or in written format.Domain knowledge of Mutual Funds transactions and foliosExperience working with Payment GatewaysKnowledge of AWS or equivalent cloud providerKnowledge of DevOps, CI/CDKnowledge of ReactJS and ReactNativeJob Location: Mumbai- Andheri\n Interested? Please click here to fill out the form.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=9aae70d3cc180b1b",
        "JobType": [],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Biomedical Engineer",
        "Company": "Bhaktivedanta Hospital & Research Institute",
        "Location": "Mira Road, Mumbai, Maharashtra",
        "Description": "*RESPONSIBILITIES:*\n\n\n\n\n\n\n* Assist biomedical engineer in smooth functioning of the medical instruments of the hospital.\n* Repair and maintain all biomedical equipment under the supervision of Biomedical Engineer.\n* Ensure that the user satisfaction of the departments allocated to you by regular interaction with the users and ensuring that the complaints of the departments are resolved quickly.\n* Provide training to staff nurses and users regarding the functioning & proper care of the equipment in coordination with associate biomedical engineer.\n* Report to biomedical engineer about equipment maintenance.\n* Ensure that the preventive maintenance and Calibration of equipment’s happens at the desired frequency.\n* Assist biomedical engineer in maintaining all documents, catalogues, certificates, manuals of all equipment.\n* Prepare report on status of biomedical equipment and prepares budget for future needs.\n* Maintain data and contact information related to all biomedical equipment, their service providers, AMC etc. and “ Periodic maintenance chart”\n* Prepare and keep record of all equipment’s AMC / CMC and Insurance status.\n* Handle responsibilities assigned as and when.\n\n\n\n\n\n\n\n\n\n*KNOWLEDGE, SKILLS & EXPERIENCE:*\n\n\n* Diploma / Bachelor in Bio-medical / Electronics engineering.\n* At least two-three years experience from hospital industry.\n* Knowledge of electronics components and repairs of circuits.\n* Ability of detecting defects and providing recommendations.\n\n\n\n\n\n\n\n*KEY COMPETENCIES:*\n\n\n* Capacity to work at fast pace & best quality with given projects, priorities and deadlines.\n* Interpersonal and communication skills.\n* Organizational and planning skills\n* Time management\n* Flexibility / Adaptability / initiative\n* Customer service orientation\n\nJob Types: Full-time, Permanent, Fresher\n\nPay: ₹25,000.00 - ₹50,000.00 per month\n\nBenefits:\n* Health insurance\n* Leave encashment\n* Paid sick time\n* Provident Fund\nSchedule:\n* Day shift\n* Morning shift\n* Rotational shift\nSupplemental Pay:\n* Yearly bonus\n\n\n\nExperience:\n* total work: 1 year (Preferred)\n\nWork Location: In person",
        "Salary": "₹300,000 - ₹600,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=611d17789678700e",
        "JobType": [
            "Permanent",
            "Fresher",
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Technical Project Manager",
        "Company": "Capgemini Engineering",
        "Location": "Mumbai, Maharashtra",
        "Description": "Job Description\n\nWorks in the area of Software Engineering, which encompasses the development, maintenance and optimization of software solutions/applications.\n1. Applies scientific methods to analyse and solve software engineering problems.\n2. He/she is responsible for the development and application of software engineering practice and knowledge, in research, design, development and maintenance.\n3. His/her work requires the exercise of original thought and judgement and the ability to supervise the technical and administrative work of other software engineers.\n4. The software engineer builds skills and expertise of his/her software engineering discipline to reach standard software engineer skills expectations for the applicable role, as defined in Professional Communities.\n5. The software engineer collaborates and acts as team player with other software engineers and stakeholders.\n\nWorks in the area of Software Engineering, which encompasses the development, maintenance and optimization of software solutions/applications.1. Applies scientific methods to analyse and solve software engineering problems.2. He/she is responsible for the development and application of software engineering practice and knowledge, in research, design, development and maintenance.3. His/her work requires the exercise of original thought and judgement and the ability to supervise the technical and administrative work of other software engineers.4. The software engineer builds skills and expertise of his/her software engineering discipline to reach standard software engineer skills expectations for the applicable role, as defined in Professional Communities.5. The software engineer collaborates and acts as team player with other software engineers and stakeholders.\nJob Description - Grade Specific\nIs highly respected, experienced and trusted. Masters all phases of the software development lifecycle and applies innovation and industrialization. Shows a clear dedication and commitment to business objectives and responsibilities and to the group as a whole. Operates with no supervision in highly complex environments and takes responsibility for a substantial aspect of Capgemini’s activity. Is able to manage difficult and complex situations calmly and professionally. Considers ‘the bigger picture’ when making decisions and demonstrates a clear understanding of commercial and negotiating principles in less-easy situations. Focuses on developing long term partnerships with clients. Demonstrates leadership that balances business, technical and people objectives. Plays a significant part in the recruitment and development of people.\nSkills (competencies)\nVerbal Communication",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=cb301aae39bbe425",
        "JobType": [
            "Permanent"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Service Delivery manager",
        "Company": "Capgemini",
        "Location": "Mumbai, Maharashtra",
        "Description": "Choosing Capgemini means choosing a company where you will be empowered to shape your career in the way you’d like, where you’ll be supported and inspired by a collaborative community of colleagues around the world, and where you’ll be able to reimagine what’s possible. Join us and help the world’s leading organizations unlock the value of technology and build a more sustainable, more inclusive world.\n\nJob Description\n\n1. The Software Engineering Leader oversees and guides teams to deliver high-quality software solutions aligned with organizational goals and industry best practices.\n2. Is a professional in technology, proficient in strategic planning, decision-making, and mentoring, with an extensive background in software development and leadership.\n3. Is typically responsible for setting the strategic direction of software development efforts, managing project portfolios, and ensuring effective execution of software engineering initiatives to meet organizational objectives.\n4. Builds skills and expertise in leadership, staying abreast of industry trends, and cultivating a collaborative and high-performance culture within the software engineering team.\n5. Collaborates and acts as a team player with cross-functional teams, executives, and stakeholders, fostering a positive and productive environment for successful software development initiatives.\n\n1. The Software Engineering Leader oversees and guides teams to deliver high-quality software solutions aligned with organizational goals and industry best practices.2. Is a professional in technology, proficient in strategic planning, decision-making, and mentoring, with an extensive background in software development and leadership.3. Is typically responsible for setting the strategic direction of software development efforts, managing project portfolios, and ensuring effective execution of software engineering initiatives to meet organizational objectives.4. Builds skills and expertise in leadership, staying abreast of industry trends, and cultivating a collaborative and high-performance culture within the software engineering team.5. Collaborates and acts as a team player with cross-functional teams, executives, and stakeholders, fostering a positive and productive environment for successful software development initiatives.\nJob Description - Grade Specific\nRequires a solid understanding of software development principles and strong leadership skills. Individuals in this role are expected to lead a team of developers, overseeing their work, and ensuring the team's performance. They are responsible for coordinating the team's tasks, providing guidance, and ensuring the quality of the team's output.\nSkills (competencies)\nVerbal Communication\n\nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fuelled by its market leading capabilities in AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2023 global revenues of €22.5 billion.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=ef6d98e14d1f9795",
        "JobType": [
            "Permanent"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "VP – ISPL Change Management Operations",
        "Company": "BNP Paribas",
        "Location": "Mumbai, Maharashtra",
        "Description": "About BNP Paribas India Solutions:\n\nEstablished in 2005, BNP Paribas India Solutions is a wholly owned subsidiary of BNP Paribas SA, European Union’s leading bank with an international reach. With delivery centers located in Bengaluru, Chennai and Mumbai, we are a 24x7 global delivery center. India Solutions services three business lines: Corporate and Institutional Banking, Investment Solutions and Retail Banking for BNP Paribas across the Group. Driving innovation and growth, we are harnessing the potential of over 10000 employees, to provide support and develop best-in-class solutions.\n\nAbout BNP Paribas Group:\n\n BNP Paribas is the European Union’s leading bank and key player in international banking. It operates in 65 countries and has nearly 185,000 employees, including more than 145,000 in Europe. The Group has key positions in its three main fields of activity: Commercial, Personal Banking & Services for the Group’s commercial & personal banking and several specialised businesses including BNP Paribas Personal Finance and Arval; Investment & Protection Services for savings, investment, and protection solutions; and Corporate & Institutional Banking, focused on corporate and institutional clients. Based on its strong diversified and integrated model, the Group helps all its clients (individuals, community associations, entrepreneurs, SMEs, corporates and institutional clients) to realize their projects through solutions spanning financing, investment, savings and protection insurance. In Europe, BNP Paribas has four domestic markets: Belgium, France, Italy, and Luxembourg. The Group is rolling out its integrated commercial & personal banking model across several Mediterranean countries, Turkey, and Eastern Europe. As a key player in international banking, the Group has leading platforms and business lines in Europe, a strong presence in the Americas as well as a solid and fast-growing business in Asia-Pacific. BNP Paribas has implemented a Corporate Social Responsibility approach in all its activities, enabling it to contribute to the construction of a sustainable future, while ensuring the Group's performance and stability\n\nCommitment to Diversity and Inclusion\n\nAt BNP Paribas, we passionately embrace diversity and are committed to fostering an inclusive workplace where all employees are valued, respected and can bring their authentic selves to work. We prohibit Discrimination and Harassment of any kind and our policies promote equal employment opportunity for all employees and applicants, irrespective of, but not limited to their gender, gender identity, sex, sexual orientation, ethnicity, race, colour, national origin, age, religion, social status, mental or physical disabilities, veteran status etc. As a global Bank, we truly believe that inclusion and diversity of our teams is key to our success in serving our clients and the communities we operate in.\n\nAbout Business line/Function:\n\nChange Management Team within Operations is a Transversal Business Line playing a support role to Operations pertaining to Global Markets, Cash Management & Client Management teams. The team mainly supports Business Operations by looking into Transition/Project Management, Continuous Improvement Projects & MIS/Dashboards for Operations perimeter.\n\nJob Title:\n\nVP – ISPL Change Management Operations\n\nDate:\n\n2025\n\nDepartment:\n\nISPL Operations Change Management, CIB-ITO\n\nLocation:\n\nMumbai/Bangalore/Lisbon\n\nBusiness Line / Function:\n\nChange Management Operations\n\nReports to:\n\n(Direct)\n\nHead - Change Management Operations\n\nGrade:\n\n(if applicable)\n\nNA\n\n(Functional)\n\nNumber of Direct Reports:\n\nNIL\n\nDirectorship / Registration:\n\nNA\n\nPOSITION PURPOSE\n\nAn increasing role is played by ISPL Operations to support Client Engagement Protection and Global Markets Business line. The position’s main purpose is to equip ISPL – Operations with the ability to contribute to Continuous Improvement & driving of efficiency Program. Need experienced resources with a strong foothold in Lean/project improvement initiatives and strong project management background.\n\nTo assist Business lines in the development, expansion, growth of its business activities by ensuring the end-to-end value chain design is addressing several aspects such as Process Expertise, Operational efficiency (Automation, Process Design, etc.) & Financial Security (Payment transparency, Sanctions, Group policies, etc.)\n\nResponsibilitiess\n\nDrive Continuous improvement initiatives within operations\nProvide Lean and Project manager subject matter expertise for the larger team and stakeholders\nPossess a deep understanding of Lean ways of working and can coach individuals and teams\nReporting progress, issues, dependencies and risks to project or program leadership and committees (as appropriate)\nMake recommendations to influence decision making, in order to maintain progress towards delivery and benefits realization\nDriving the adoption of BNPP Lean standards and working in alignment with BNPP project methodology at all times\nManage large scale projects, perform workflow analysis, identify top bottlenecks and work with respective teams/ individual to remove/ reduce impediments and ensure smooth flow of work\nParticipate in business meetings with various stakeholders on a need basis\nDrive continuous improvement mindset and journeys\nLeading the team to meet performance targets aligned to the objectives\nTECHNICAL & BEHAVIORAL COMPETENCIES\nLean Six Sigma Black Belt certification required\nStrong foothold in Lean/project improvement initiatives and strong project management background\nNeed to have worked on improvement projects (non tech as well)\nExcellent interpersonal and communication skills (written and verbal) & ability to articulate\nResults driven, with a strong sense of accountability. Able to function autonomously\nAbility to manage large workloads and tight deadlines\nProactive & effective collaborator\nExcellent presentation & problem solving skills\nGood understanding of Banking operations, not mandatory though\nGreat skills with MS Office suite\nInternational exposure preferred\nShould be open to travel (if required)\nSPECIFIC QUALIFICATIONS (IF REQUIRED)\n\nChange Management Team within Operations is a Transversal Business Line playing a support role to Operations pertaining to Global Markets, Cash Management & Client Management teams. The team mainly supports Business Operations by looking into Transitions/Project Management, Continuous Improvement Projects & MIS/Dashboards for Operations perimeter.\n\nSKILLS\n\nBehavioural Skills: (Please select up to 4 skills)\n\nAbility to synthetize / simplify\n\nAbility to deliver / Results driven\n\nCreativity & Innovation / Problem solving\n\nCritical thinking\n\nTransversal Skills: (Please select up to 5 skills)\n\nAbility to manage a project\n\nAbility to understand, explain and support change\n\nAnalytical Ability\n\nAbility to manage / facilitate a meeting, seminar, committee, training…\n\nAbility to anticipate business / strategic evolution\n\nEducation Level:\n\n Bachelor Degree or equivalent\n\nExperience Level\n\nAt least 12 years\n\nOther/Specific Qualifications (if required)",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=c4c19571071e0d88",
        "JobType": [
            "Permanent",
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Digital Marketing Executive",
        "Company": "UrbanSparks Digital Institute",
        "Location": "Ghatkopar West, Mumbai, Maharashtra",
        "Description": "*Job Title*: Digital Marketing Executive\n*Company*: UrbanSparks Digital Institute\n*Location*: Ghatkopar, Mumbai\n*Job Type*: Full-Time\n\n*About Us*:\nUrbanSparks Digital Institute is a premier tech education center in Ghatkopar, Mumbai, offering advanced training programs in Software Development, Data Analytics, and Digital Marketing. We are committed to providing practical, industry-relevant education that empowers students to succeed in the dynamic world of technology.\n\n*Job Description*:\nUrbanSparks is looking for a creative and driven Digital Marketing Executive to join our dynamic team. This full-time role will focus on building and executing digital marketing strategies to promote our courses, drive brand awareness, and engage with our online community. The ideal candidate will have a strong understanding of digital marketing principles, social media strategies, content creation, and analytics. As a Digital Marketing Executive, you will have the opportunity to make a tangible impact on the growth and visibility of our brand.\n\n*Key Responsibilities*:\n* *Strategy Development*: Create and implement digital marketing strategies across various platforms, including social media, email, SEO, SEM, and more, to increase visibility and engagement.\n* *Content Creation & Management*: Lead content creation for social media platforms, blogs, websites, and other marketing channels. Develop creative campaigns, posts, graphics, and videos that align with the brand voice.\n* *Social Media Management*: Manage daily social media activities across platforms like Instagram, Facebook, LinkedIn, YouTube, etc. Implement strategies for growth, engagement, and community building.\n* *SEO & SEM*: Oversee SEO efforts to increase organic reach, including keyword research, on-page and off-page SEO, and content optimization. Manage Google Ads and other paid campaigns to drive traffic and conversions.\n* *Analytics & Reporting*: Track and analyze key metrics to assess the effectiveness of digital marketing campaigns. Provide actionable insights and recommendations for improving performance.\n* *Email Marketing*: Develop and execute email marketing campaigns to nurture leads, promote new courses, and engage with students and prospects.\n* *Collaboration*: Work closely with the design, content, and sales teams to align marketing strategies with business objectives and brand guidelines.\n* *Trend Analysis & Innovation*: Stay current with industry trends and digital marketing best practices. Apply innovative approaches to campaigns and strategies.\n\n*Qualifications & Skills*:\n* *Proven Experience*: 2-3 years of experience in digital marketing, including hands-on experience with content creation, social media management, and digital campaign execution.\n* *Platform Expertise*: In-depth knowledge of social media platforms (Instagram, Facebook, LinkedIn, YouTube), content management systems, and digital marketing tools (Google Ads, Hootsuite, Canva, etc.).\n* *Creative Mindset*: Strong creative abilities with experience in developing engaging copy and designing visuals (basic design skills required, Photoshop/Canva proficiency is a plus).\n* *Analytical Skills*: Ability to analyze data, generate insights, and optimize marketing strategies for better performance.\n* *Communication*: Excellent written and verbal communication skills with an ability to create clear, engaging, and persuasive content.\n* *Attention to Detail*: A keen eye for accuracy, quality, and brand consistency in all marketing materials.\n* *Self-Starter*: Highly motivated with the ability to work independently, prioritize tasks, and manage multiple projects simultaneously.\n* *Bachelor’s Degree* in Marketing, Business, or a related field (preferred).\n\n*Why Join Us?*\n* *Growth Opportunities*: Be part of a fast-growing institute with opportunities to expand your skills and knowledge in the digital marketing field.\n* *Impactful Work*: Directly contribute to the growth of UrbanSparks Digital Institute’s brand presence and online engagement.\n* *Dynamic Environment*: A collaborative and creative work environment where your ideas will be valued and your contributions recognized.\n* *Professional Development*: Ongoing mentorship and training in cutting-edge digital marketing techniques and trends.\n* *Work-Life Balance*: Enjoy a supportive and flexible work culture with opportunities for both professional growth and personal balance.\n\n*How to Apply*:\nIf you’re passionate about digital marketing and ready to take your career to the next level, we’d love to hear from you! Please send your resume, along with a portfolio of relevant digital marketing projects or social media campaigns, to *hr@urbansparks.in *or *urbansparksd@gmail.com.*\n\nJob Type: Full-time\n\nPay: ₹10,000.00 - ₹15,000.00 per month\n\nSchedule:\n* Rotational shift\nSupplemental Pay:\n* Overtime pay\n\nWork Location: In person",
        "Salary": "₹120,000 - ₹180,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=a069e459755bc374",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Software Engineer III-Java, AWS",
        "Company": "JPMorganChase",
        "Location": "Mumbai, Maharashtra",
        "Description": "JOB DESCRIPTION\n\nWe have an exciting and rewarding opportunity for you to take your software engineering career to the next level.\n\nAs a Java/ AWS Software Engineer III at JPMorgan Chase within the Commercial & Investment Bank Payments Technology team, you serve as a seasoned member of an agile team to design and deliver trusted market-leading technology products in a secure, stable, and scalable way. You are responsible for carrying out critical technology solutions across multiple technical areas within various business functions in support of the firm’s business objectives.\n\nJob responsibilities\n\nExecutes software solutions, design, development, and technical troubleshooting with ability to think beyond routine or conventional approaches to build solutions or break down technical problems\nCreates secure and high-quality production code and maintains algorithms that run synchronously with appropriate systems\nProduces architecture and design artifacts for complex applications while being accountable for ensuring design constraints are met by software code development\nGathers, analyzes, synthesizes, and develops visualizations and reporting from large, diverse data sets in service of continuous improvement of software applications and systems\nProactively identifies hidden problems and patterns in data and uses these insights to drive improvements to coding hygiene and system architecture\nContributes to software engineering communities of practice and events that explore new and emerging technologies\nAdds to team culture of diversity, equity, inclusion, and respect\n\nRequired qualifications, capabilities, and skills\n\nFormal training or certification on software engineering concepts and 3+ years applied experience\nHands-on practical experience in system design, application development, testing, and operational stability\nStrong experience in core Java skills with exposure to cloud technologies (AWS) .\nProficient in coding in one or more languages\nExperience in developing, debugging, and maintaining code in a large corporate environment with one or more modern programming languages and database querying languages\nOverall knowledge of the Software Development Life Cycle\nSolid understanding of agile methodologies such as CI/CD, Application Resiliency, and Security\nDemonstrated knowledge of software applications and technical processes within a technical discipline (e.g., cloud, artificial intelligence, machine learning, mobile, etc.)\n\nPreferred qualifications, capabilities, and skills\n\nFamiliarity with modern front-end technologies\nExposure to UI technologies/development.\nABOUT US",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=703a686fa4dde10f",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Business Sales Analyst Internship",
        "Company": "Beam Innovate Pvt Ltd",
        "Location": "Thane, Maharashtra",
        "Description": "*About Us:*\nBeamInnovate is an innovative software company specializing in e-commerce, CRM, and process automation solutions. We are seeking a motivated and detail-oriented individual to join our team as a Sales and Lead Generation Analyst. This role provides a unique opportunity to gain hands-on experience in sales analytics, business development, and customer acquisition strategies in the dynamic field of software solutions.\n\n*Job Description:*\n\n*Position Overview:*\nBeamInnovate is offering an exciting opportunity for a Sales and Lead Generation Analyst to work closely with our business development and sales teams. This role will involve analyzing market trends, identifying potential leads, and contributing to sales strategies that drive revenue growth.\n\n*Responsibilities:*\n\n*Lead Generation & Prospecting:*\n* Conduct market research to identify potential clients and business opportunities.\n* Utilize various tools (LinkedIn, CRM, databases) to build and maintain a pipeline of leads.\n* Assist in outreach efforts through emails, cold calling, and social media engagement.\n\n*Sales Data Analysis:*\n* Analyze sales trends, customer behavior, and market insights to identify growth opportunities.\n* Track key performance metrics and generate reports to optimize sales strategies.\n\n*CRM Management:*\n* Maintain and update CRM records, ensuring accurate tracking of leads and interactions.\n* Assist in automating workflows to improve sales efficiency.\n\n*Sales Support:*\n* Collaborate with the sales team to prepare proposals, presentations, and sales materials.\n* Assist in scheduling meetings and follow-ups with potential clients.\n\n*Market & Competitor Research:*\n* Conduct competitive analysis to identify industry trends and position BeamInnovate effectively.\n* Provide insights and recommendations to improve sales and marketing efforts.\n\n*Collaboration:*\n* Work closely with cross-functional teams, including marketing, business development, and product teams, to align sales efforts with business goals.\n\n*Qualifications:*\n* Bachelor’s degree in Business, Marketing, Information Technology, or a related field.\n* Strong analytical and problem-solving skills.\n* Excellent communication skills, both written and verbal.\n* Familiarity with sales concepts, lead generation strategies, and CRM tools.\n* Proficiency in Microsoft Office suite (Excel, Word, PowerPoint).\n\n*Additional Criteria:*\n\n*Adaptability:*\n* Ability to thrive in a fast-paced and evolving business environment.\n\n*Detail-Oriented:*\n* Strong attention to detail for accurate data entry and analysis.\n\n*Team Player:*\n* Ability to collaborate effectively and contribute to collective sales goals.\n\n*Tech-Savvy:*\n* An interest in technology and data-driven sales strategies.\n\n*Proactive Learner:*\n* A self-motivated attitude with a willingness to take on new challenges.\n\n*Benefits:*\n* Hands-on experience in sales analytics and business development within the software industry.\n* Mentorship from experienced professionals in sales and marketing.\n* Networking opportunities within the technology sector.\n* Potential for future career growth based on performance.\n\n*Note:*\nThis role is an excellent opportunity for individuals looking to build a career in sales, business development, or market analysis within the software industry. Candidates with a passion for technology, data-driven decision-making, and sales strategy are encouraged to apply.\n\nJob Types: Full-time, Internship\nContract length: 6 months\n\nPay: ₹6,000.00 per month\n\nSchedule:\n* Monday to Friday\nSupplemental Pay:\n* Performance bonus\n\n\n\nEducation:\n* Master's (Required)\n\nWork Location: In person",
        "Salary": "₹72,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=e82ec006b4b9a513",
        "JobType": [
            "Full-time",
            "Internship"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Graphic Designer",
        "Company": "Violet Infosystems Private Limited",
        "Location": "Malad, Mumbai, Maharashtra",
        "Description": "*Open Position: Graphic Designer*\n*Location: Malad (West), Mumbai*\n*Experience: 1 Years to 4 Years*\n*Qualification: Any Graduate*\n*Industry: IT/Software*\n*Only Mumbai Suburban based location Candidate apply for this Position.*\n*We are working 6 days i.e. From Monday to Saturday*\n\n*Job Summary:*\n\nWe are seeking a talented and versatile Graphic Designer to join our dynamic team. The ideal candidate will possess strong skills in animation, graphic design, and audio editing, with proficiency in Adobe Photoshop, Audacity, and Articulate Storyline. This role requires creativity, attention to detail, and the ability to collaborate effectively with various departments to produce engaging and high-quality multimedia content.\n* *Design and Animation:* Create visually compelling graphics, illustrations, and animations for various digital platforms, including websites, social media, and e-learning modules.\n* *Graphic Design:* Develop and design layouts, graphics, logos, and other visual elements for print and digital media.\n* *Audio Editing: *Utilize Audacity to edit and enhance audio content for multimedia projects.\n* *E-Learning Development:* Use Articulate Storyline to design and develop interactive e-learning courses and training materials.\n* *Collaborate: *Work closely with the marketing, content, and development teams to ensure all designs align with brand guidelines and project objectives.\n* *Project Management:* Manage multiple design projects simultaneously, ensuring timely delivery and high-quality output.\n* *Stay Current:* Keep up-to-date with the latest design trends, tools, and technologies to improve continuously and innovate.\n* *Creative Skills: *Strong artistic skills and a keen eye for aesthetics and detail.\n* *Communication: *Excellent verbal and written communication skills, with the ability to present ideas.\n* *Team Player: *Ability to work collaboratively in a team environment and adapt to changing priorities and feedback.\n* *Time Management: *Strong organizational skills with the ability to manage multiple projects and meet deadlines.\n\n*Technical Skills:*\n* Proficiency in Adobe Photoshop for creating and editing graphics.\n* Experience with animation software and techniques.\n* Competency in Audacity for audio editing and enhancement.\n* Skilled in using Articulate Storyline for e-learning content development.\n\n*Preferred Skills:*\n* Experience with other Adobe Creative Suite applications such as Illustrator and After Effects.\n* Knowledge of using Artificial Intelligence (AI).\n* Knowledge of UI/UX design principles.\n* Familiarity with video editing software.\n* Experience in designing for various platforms including web, mobile, and print.\n\nJob Types: Full-time, Permanent\n\nPay: ₹360,000.00 - ₹600,000.00 per year\n\nSchedule:\n* Day shift\n\n\n\nEducation:\n* Bachelor's (Required)\n\nExperience:\n* CSS: 1 year (Preferred)\n* total work: 1 year (Preferred)\n* Design: 1 year (Preferred)\n\nWork Location: In person",
        "Salary": "₹360,000 - ₹600,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=e7daf0a2e224c86a",
        "JobType": [
            "Permanent",
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Senior Backend Developer",
        "Company": "Beam Innovate Pvt Ltd",
        "Location": "Ghansoli, Navi Mumbai, Maharashtra",
        "Description": "*About BeamInnovate:*\nBeamInnovate is a dynamic software development company specializing in mission-critical applications, e-commerce solutions, and CRM software products. With a strong presence in the Indian, European, and Singaporean markets, we collaborate with major corporations to deliver cutting-edge solutions that drive business growth and efficiency.\n\n*Position Overview:*\nWe are seeking a highly skilled and experienced Senior Backend Developer to join our talented team. The ideal candidate will have a solid background in Python and PHP development, with expertise in implementing Continuous Integration/Continuous Deployment (CI/CD) pipelines. In addition to technical proficiency, the Senior Backend Developer will play a crucial role in mentoring and guiding junior developers to ensure high-quality deliverables.\n\n*Responsibilities:*\n* Design, develop, and maintain robust backend systems for mission-critical applications, e-commerce platforms, and CRM software products.\n* Collaborate with cross-functional teams to gather requirements, architect solutions, and implement scalable backend architectures.\n* Lead the implementation of CI/CD pipelines to automate the software development lifecycle and ensure rapid and reliable deployment.\n* Mentor and coach junior developers, providing technical guidance, code reviews, and knowledge sharing to foster professional growth and skill development.\n* Stay updated with emerging technologies, industry trends, and best practices to continuously enhance the efficiency and effectiveness of backend development processes.\n* Troubleshoot and debug complex technical issues, ensuring timely resolution and optimal performance of backend systems.\n* Work closely with project managers, product owners, and stakeholders to deliver high-quality solutions within specified timelines and budget constraints.\n* Contribute to the overall software development lifecycle, including requirements analysis, design documentation, and testing strategies.\n\n*Requirements:*\n* Bachelor's degree in Computer Science, Engineering, or a related field; Master's degree preferred.\n* Proven experience (5+ years) in backend development using Python and PHP, with a strong understanding of object-oriented programming principles and design patterns.\n* Hands-on experience with CI/CD tools and practices, such as Jenkins, GitLab CI, or Travis CI, for automated testing, build, and deployment.\n* Proficiency in database management systems, including SQL and NoSQL databases (e.g., MySQL, PostgreSQL, MongoDB).\n* Familiarity with frontend technologies and frameworks (e.g., JavaScript, Angular, React) is a plus.\n* Excellent problem-solving skills and attention to detail, with a passion for writing clean, maintainable, and efficient code.\n* Strong communication and interpersonal skills, with the ability to collaborate effectively within a team environment and communicate complex technical concepts to non-technical stakeholders.\n* Experience working in Agile/Scrum methodologies and delivering software solutions in a fast-paced, deadline-driven environment.\n\n*Benefits:*\n* Competitive salary package with performance-based incentives.\n* Comprehensive health insurance coverage.\n* Flexible work hours and remote work options.\n* Professional development opportunities, including training programs and certifications.\n* Dynamic and collaborative work culture with opportunities for growth and advancement.\n\nJoin our team at BeamInnovate and be part of a passionate and innovative community dedicated to building cutting-edge software solutions for major corporations worldwide.\n\nJob Types: Full-time, Permanent\n\nPay: ₹600,000.00 - ₹1,541,595.02 per year\n\nLocation Type:\n* In-person\nSchedule:\n* Fixed shift\n\n\n\nEducation:\n* Bachelor's (Preferred)\n\nExperience:\n* Programming: 4 years (Required)\n\nWork Location: In person",
        "Salary": "₹600,000 - ₹1,541,595 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=1f5cb4eb9055aae0",
        "JobType": [
            "Permanent",
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Flutter Developer",
        "Company": "sysnite technologies",
        "Location": "Vashi, Navi Mumbai, Maharashtra",
        "Description": "*Job description*\n\nSysnite is looking for Flutter Developer to join our dynamic team and embark on a rewarding career journey\n* Designing and developing user-friendly mobile applications using Flutter\n* Writing clean and maintainable code following best practices and coding standards\n* Debugging and fixing issues in existing applications\n* Implementing new features and functionality as per project requirements\n* Collaborating with cross-functional teams, including designers, product managers, and back-end developers\n* Ensuring the performance, quality, and responsiveness of applications\n* Writing automated tests and maintaining test coverage\n* Should have excellent programming skills\n* Deep understanding of mobile app architecture, design patterns, and best practices\n* Should also have strong problem-solving skills\n\nJob Type: Full-time\n\nPay: ₹30,000.00 - ₹65,000.00 per month\n\nSchedule:\n* Day shift\nSupplemental Pay:\n* Overtime pay\n* Performance bonus\n\n\n\nEducation:\n* Bachelor's (Preferred)\n\nExperience:\n* Flutter: 2 years (Required)\n* total work: 2 years (Preferred)\n* software development: 2 years (Preferred)\n\nLanguage:\n* English (Preferred)\n\nWork Location: In person",
        "Salary": "₹360,000 - ₹780,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=8074a9acfaf543f3",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Area Chef ( Mexican & Italian Cuisine )",
        "Company": "Yellow Banana Food Co. Pvt. Ltd.",
        "Location": "Mumbai, Maharashtra",
        "Description": "Overseeing the preparation of dishes within a specific section of the kitchen, like the grill, sauté station, or pastry section, ensuring quality and consistency while managing their team within that area, reporting to the sous chef or executive chef. Key responsibilities of an area chef include:\n* *Food preparation:*Expertly cook and present dishes within their designated station according to established recipes and menu specifications.\n* *Station management:*Oversee the workflow of their station, assigning tasks to cooks and ensuring timely execution of orders.\n* *Quality control:*Maintain high standards of food quality, presentation, and taste within their section.\n* *Inventory management:*Monitor stock levels of ingredients within their area and communicate needs to the purchasing team.\n* *Staff training and supervision:*Train and mentor cooks on their station, ensuring proper techniques and food safety practices are followed.\n* *Cost control:*Manage food costs by minimizing waste and utilizing ingredients efficiently.\n* *Communication:*Collaborate effectively with other kitchen staff, including the sous chef and executive chef, to ensure smooth operations.\n* *Sanitation and hygiene:*Maintain a clean and organized work area, adhering to all health and safety regulations.\n\nSkills and qualifications for an area chef:\n* *Strong culinary skills:* Proficient in various cooking techniques, knife skills, and knowledge of different cuisines.\n* *Leadership abilities:* Ability to effectively manage a team and delegate tasks.\n* *Attention to detail:* Commitment to producing high-quality dishes with consistent presentation.\n* *Time management:* Efficiently manage the workflow of their station to meet service demands.\n* *Adaptability:* Ability to handle pressure and adjust to changing orders or menu variations.\n* *Food safety knowledge:* Understanding and adherence to food safety regulations.\n\nJob Type: Full-time\n\nPay: ₹50,000.00 - ₹55,000.00 per month\n\nBenefits:\n* Food provided\n\n\n\nExperience:\n* Chef: 10 years (Required)\n\nWork Location: In person",
        "Salary": "₹600,000 - ₹660,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=ccfed69c95ac7649",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Inside Sales Executive",
        "Company": "Palram India",
        "Location": "Kandivali, Mumbai, Maharashtra",
        "Description": "Company website - https://www.palram.com/in/\n\nInside Sales Executive\n\nSales , Marketing & Business development background with min 1-4 years experience , preferably in Building material or any competitive business\n\nIdentify all sales leads ( Online / Offline )\n\nDeveloping and Implementing Sales Strategies\n\nSales report - Analyse Budgeted sales / Actual Performance / Gaps / Reasons thereof\n\nAnalyse Budgeted sales & marketing expenses\n\nConduct Performance reviews of sales team , Targets Vs Performance\n\nInteraction & Collaboration with sales team & Prepare monthly Sales forecasts\n\nProduct Knowledge\n\nTrack relevant KPIs , Performance reviews of sales team , Targets Vs Performance\n\nAdaptability\n\nExcellent communication skills\n\nMotivate & Train sales team\n\nExperience : 1-4 Years in sales & marketing\n\nEducation : Any Graduate with relevant additional qualifications\n\nJob Type: Full-time\n\nPay: ₹100,000.00 - ₹600,000.00 per year\n\nBenefits:\n* Cell phone reimbursement\n* Health insurance\n* Paid time off\n* Provident Fund\nSchedule:\n* Day shift\n* Monday to Friday\n\n\n\nAbility to commute/relocate:\n* Kandivali, Mumbai, Maharashtra: Reliably commute or planning to relocate before starting work (Preferred)\n\nExperience:\n* Inside Sales / Sales co-ordinator: 2 years (Required)\n\nWork Location: In person\n\n*Speak with the employer*\n+91 7777011996",
        "Salary": "₹100,000 - ₹600,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=75125f58a3fe7322",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Assistant Manager Sales",
        "Company": "QuantInsti Quantitative Learning Pvt Ltd.",
        "Location": "Mumbai, Maharashtra",
        "Description": "*Job Description.*\n\nAre you ready to embark on an exhilarating journey as our Sales and Customer Success Representative? We're on the lookout for a dynamic individual who thrives on connecting with people, closing deals, and championing lifelong learning.\n\n*What You'll Be Doing:*\n\n*Source New Sales Opportunities:*\n* Conduct inbound lead follow-up and initiate outbound calls and emails to identify and cultivate potential customers.\n* Employ effective strategies to engage with leads and prospects.\n\n*Daily Operations:*\n* Execute daily Standard Operating Procedures (SOPs), making 70-80 calls per day from the existing database.\n* Demonstrate adaptability with flexible working hours based on business requirements.\n\n*Thorough Lead Analysis:*\n* Perform comprehensive analysis of each lead and prospect to understand their needs, challenges, and preferences.\n* Gather valuable insights to tailor solutions that align with client objectives.\n\n*Sales Closing:*\n* Utilize effective sales techniques to close deals and consistently achieve quarterly quotas.\n* Employ consultative selling approaches to address client concerns and objections.\n\n*Lead Nurturing:*\n* Develop and implement lead nurturing strategies to guide potential customers through the decision-making process.\n* Provide necessary information and support to facilitate informed purchasing decisions.\n\n*Cross-Functional Collaboration:*\n* Collaborate with various verticals within the organization to ensure a seamless and integrated customer experience.\n* Facilitate communication and coordination to meet client needs effectively.\n\n*CRM Management:*\n* Update and maintain accurate records in the Customer Relationship Management system (LeadSquared CRM).\n* Document customer interactions, preferences, and transaction details for future reference and analysis.\n\n*Client Query Handling:*\n* Respond promptly to client inquiries, addressing concerns, and providing relevant information.\n* Offer assistance with payment options, ensuring a smooth and customer-friendly transaction process.\n\n*Understanding Client Learning Goals:*\n* Gain a deep understanding of client learning objectives and career goals.\n* Recommend suitable courses or learning tracks that align with client aspirations.\n\n*Website Optimization:*\n* Analyze user buying behavior and suggest changes to the website for improved user experience and conversion rates.\n* Collaborate with the marketing and development teams to implement website enhancements.\n\n*Customer Satisfaction and Revenue Focus:*\n* Prioritize customer satisfaction by delivering exceptional service and support.\n* Focus on revenue generation through upselling, cross-selling, and identifying expansion opportunities within existing accounts.\n\n*Qualifications:*\n* 3-8 years exp in International / Domestic (specifically in Ed-tech/ Fin-tech sales)\n* Excellent communication and interpersonal skills.\n* Strong organizational and time-management abilities.\n* Familiarity with CRM systems, preferably LeadSquared.\n* Ability to adapt to a dynamic work environment.\n* Knowledge of e-learning industry trends is a plus.\n* Innovative and a Growth Mindset is a must\n* Optional knowledge of financial markets and trading\n\n*About QuantInsti®: *\n\nQuantInsti® was started in 2010, by the founders from iRage – a leading quant and algo trading firm in India. From its early days focused on bridging the industry knowledge gap in the field of high-frequency trading, we have come a long way in the last decade. Today, we have a user base from 200+ countries with a growth rate much over 50% year-on-year.\n\nAt QuantInsti®, we swear by our goal of revolutionizing the way people approach the financial markets by empowering individuals and institutions with bleeding-edge education and technologies. We offer high-quality learning experience and best-in-class courses geared towards a global audience in quantitative trading and investing. Our in-house developed technology aims to bring institutional-grade tools and platforms to democratize systematic and quantitative trading.\n\n*Why work with us?*\n\nAt QuantInsti, we work at the cutting edge of FinTech and EdTech offerings. We work with the newest technologies with the goal of delivering the best experience to our users in a scalable manner, with high-performance and availability. If you love to be challenged intellectually, rest assured we have plenty of them for you. We follow an open and free work culture, where you are encouraged to ask questions, learn, and teach. We offer a fast-paced environment where you take ownership of what you design and deliver. If you are looking for a move where you will find a reason to wake up every morning and rush to work, come join us.\n\nJob Type: Full-time\n\nPay: ₹400,000.00 - ₹850,000.00 per year\n\nBenefits:\n* Cell phone reimbursement\n* Health insurance\n* Provident Fund\n* Work from home\nSchedule:\n* Day shift\nSupplemental Pay:\n* Quarterly bonus\n\n\n\nApplication Question(s):\n* What is your Notice Period?\n* What is your Current CTC?\n* What is your Expected CTC?\n* How many years of experience do you have in Edtech Sales?\n* How many years of experience do you have in  Sales?\n* How many years of experience do you have in International Sales?\n\nExperience:\n* Direct sales: 1 year (Preferred)\n\nWork Location: Remote",
        "Salary": "₹400,000 - ₹850,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=6f4910f2ab5a90a7",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Network Engineer",
        "Company": "Jobegy",
        "Location": "Andheri, Mumbai, Maharashtra",
        "Description": "*Job Location Mumbai Andheri East near to Sakinaka Metro.*\n\nSenior Network Support Engineer\n\nAbout\n\nWe create technology platforms for Businesses, Smart Homes, and Internet Service Providers, driven by our goal to connect everyone, everywhere. To date, Organization has shipped over 100 million devices worldwide, from ISP networking products to next generation of IT solutions. Our growth is made possible by the dedicated team of hundreds behind the scenes. From software developers and product managers to designers and strategists, Team UI is driven to achieve our common goal: Rethinking IT. At organization, you’ll heighten your potential and broaden your horizons - all while shaping the future of connectivity.\n\nAbout the Role\n\nOur goal is to have a technical support team that goes far beyond the tiered support model and breaks the standard Network center support stereotype. Our team here at organization works in a non-siloed environment keeping the Agile methodologies in view thus eliminating the delays in reaching out to a resolution for a problem, ultimately resulting in raising satisfaction and achieving customer success.\n\nResponsibilities\n\nSupport all of our Network and OS product lines to diagnose and tackle various network-related and product-related issues reported by our customers.\n\nProvide support on customer cases with full accountability on escalation cases raised by the Tier 1 teams and facilitate discussions with the Product development teams (as and when needed).\n\nInvestigate areas of misalignments or issues that are critical dead-ends and provide suggestions to mitigate them.\n\nIdentify issues through support trends and suggest corrective actions to:\n\nPrioritise resolution of specific high-touch issues.\n\nPerform their own lab recreates in our internal lab setup as part of the troubleshooting, as and when necessary.\n\nProvide support and mentoring to the Tier 1 team members in complex troubleshooting scenarios.\n\nStay up to date on latest features and trending technology, participating in team communication, and keeping up with enterprise and networking trends.\n\nWork closely with other members of Customer Engineering as well as both Software and Hardware development teams in diagnosing problems and communicating them in multiple technical contexts.\n\nInterpersonal skills and product knowledge are critical to responding to daily customer-centric activities.\n\nRead and analyze packet captures using Wireshark/tcp dump to resolve sophisticated networking issues on customers' devices.\n\nDocument customer communication and recurring technical issues to support product quality programs and product development.\n\nUse acquired knowledge to suggest and contribute to Knowledge Base articles.\n\nKnowledge and Experience\n\nKnowledge of the networking industry, products, and protocols.\n\nKnowledge of the following network protocols and technologies: TCP/IP and OSI model, IP Address and Subnetting, ARP, DHCP, DNS, POE (IEEE 802.3af/at/bt), ICMP, IPv4 & IPv6, and IEEE 802.1Q trunking, Wireless LAN Fundamentals, VPN, NAT/PAT, etc.\n\nKnowledge of troubleshooting utilities such as Ping, Traceroute, Wireshark (or similar packet capture and analysis tools) is highly desired.\n\nProven work experience to troubleshoot complex and dynamic customer environments\n\nExpertise in balancing the communications needs of each customer case.\n\nHave a strong analytical mind and the ability to triage.\n\nA high aptitude for both learning and teaching is required.\n\nExcellent written and verbal communication skills are a must.\n\nAbility to clearly and concisely articulate matters to customers.\n\nOutstanding customer service skills.\n\nExcellent account management, follow-through, and attention to detail.\n\nAbility to multitask and be adaptable to work in a fast-paced environment.\n\n1+ years of experience in computer networking-related problem-solving, critical thinking, and troubleshooting.\n\nHSC/Bachelor's/Master's Degree in the field of Engineering/Computer Science/IT.\n\n1+ years of experience in computer networking-related problem solving, critical thinking, and troubleshooting\n\nNetworking certifications are a plus and *Excellent English communication is mandatory (9 out of 10)*\n\nShift timings : *10:00 pm to 7:00 am fixed Night shift / No Day shift.*\n\nTransport facilities home pick and drop till home.\n\nWeekly Off 2 rotational week-offs/5 days working.\n\nUSP Brand, growing industry, Growth opportunity, Learning opportunity\n\nRounds of Interview walking interview at the office/ no virtual interview at all.\n\nDocuments\n\nEducational + Identity Proof + Residential Proof + Salary Proof (Bank Statement/Payslip) + Relieving documents\n\n*Note : Relocating candidates should not be considered.*\n\n*Sam 90 0 4 9 84 20 5.*\n\nJob Type: Full-time\n\nPay: ₹40,396.13 - ₹80,588.51 per month\n\nBenefits:\n* Provident Fund\nSchedule:\n* Evening shift\n* Fixed shift\n* Night shift\n* Rotational shift\n* US shift\nSupplemental Pay:\n* Performance bonus\n\n\n\nEducation:\n* Bachelor's (Required)\n\nExperience:\n* Network security: 1 year (Required)\n\nWork Location: In person",
        "Salary": "₹484,754 - ₹967,062 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=37fbb20b5ac52fe1",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Site Reliability Engineer (Shell scripting)",
        "Company": "FIS Global",
        "Location": "Mumbai, Maharashtra",
        "Description": "Position Type :\n\nFull time\n\nType Of Hire :\n\nExperienced (relevant combo of work and education)\n\nEducation Desired :\n\nBachelor's Degree\n\nTravel Percentage :\n\n0%\n\nite Reliability Engineer (SRE, Python, Linux, Shell scripting) - 5 to 10Yrs – Mumbai/Pune/Bangalore (Rotational Shift)\n\nAre you curious, motivated, and forward-thinking? At FIS you’ll have the opportunity to work on some of the most challenging and relevant issues in financial services and technology. Our talented people empower us, and we believe in being part of a team that is open, collaborative, entrepreneurial, passionate and above all fun.\n\nAbout the team:\n\nSite Reliability Engineer (SRE) will focus on Scalability, High Availability, Performance, Stability and Reliability of Software Applications. SRE will build automations to simplify operations and processes, collaborate with cross-functional teams to create proactive engineering mechanisms and ensure positive end user experiences. SRE with a good understanding of Products & interdependencies, with blend of pragmatic, operational and software development skills, will apply sound engineering principles, operational discipline, and mature automation to our operating environments and the codebase.\n\nWhat you will be doing\n\nUnderstanding project KPIs, SLI's, SLO's, MTTD, MTTR, Error budgets, Chaos engineering and eliminating TOILs by automation\n\nExploring observability tools and creating/implementing dashboards\n\nRun the production environment by monitoring availability and taking a holistic view of system health\n\nIncident Management: Knowledge in handling incidents, participating in blameless postmortem, performing root cause analysis, and implementing post-incident reviews.\n\nDevelop scripts to reduce toil and automate repetitive tasks, issues resolution scripting.\n\nMeasure and optimize system performance, with an eye toward pushing our capabilities forward, getting ahead of customer needs, and innovating for continual improvement\n\nWhat you bring:\n\nExperience in supporting Unix/Linux/Windows based application environments\n\nKnowledge of any RDBMS/NoSql\n\nGood knowledge of application support domain\n\nWorked on/with System and Application Monitoring and Observability tools – Splunk, Prometheus, Grafana, Dynatrace.\n\nExperience with 3rd party tools Management.\n\nHands on experience in preparing PowerShell/Python/Shell script automation.\n\nExposure to latest SRE, Cloud, DevOps technologies. Also, Knowledge of Containers, Dockers, Kubernetes/OpenShift tools.\n\nSkills in using tools like Terraform & Ansible to automate infrastructure management.\n\nWhat we offer you:\n\nAn exciting opportunity be a part of World’s Leading FinTech Product MNC\n\nTo be a part of vibrant team and to build up a career on core banking/payments domain\n\nA multifaceted job with a high degree of responsibility and a broad spectrum of opportunities\n\nA broad range of professional education and personal development possibilities – FIS is your final career step!\n\nPrivacy Statement\n\nFIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the Online Privacy Notice.\n\nSourcing Model\n\nRecruitment at FIS works primarily on a direct sourcing model; a relatively small portion of our hiring is through recruitment agencies. FIS does not accept resumes from recruitment agencies which are not on the preferred supplier list and is not responsible for any related fees for resumes submitted to job postings, our employees, or any other part of our company.\n\n#pridepass",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=5c6fb811207a0fb8",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Product Trainer",
        "Company": "Aurafox Solutions Private Limited",
        "Location": "Vashi, Navi Mumbai, Maharashtra",
        "Description": "Company profile:\nAbout us- India's first end-to-end powerhouse management for corporate transportation, product and service. We stand out with our expertise in B2B transportation. Commutec, an IIT alumnus start-up nurtured at CIBA under DIIP (DST) since 2016, pioneers tech-enabled Corporate Transportation Solutions. Specializing in daily office commutes, chauffeur car rentals, car leasing, and global travel, we excel in End-to-End Fleet Management and a SAAS-based Employee Transportation Management platform.\n\nOur Service - Managed Transportation Shuttle service, SAAS ,Fleet Management corporate , and rental cars.\n\nJob description\n\nCandidate will be responsible for designing, developing, and delivering training programs that enhance employee performance in processes.\n\nKey Responsibilities:\n\nTraining Development: Create and maintain training materials, manuals, and resources that reflect current processes and product.\n\nConduct Training Sessions: Facilitate engaging training workshops, webinars, and one-on-one sessions for new hires and ongoing employee development.\n\nAssessment and Evaluation: Assess training effectiveness through feedback and performance metrics; implement improvements based on evaluation results.\n\nCollaboration: Work closely with teams to ensure training content is accurate and relevant.\n\nAssist in the process: for new employees, providing them with the necessary knowledge and skills to succeed.\n\nContinuous Improvement: Stay updated on industry trends and best practices in training and development to enhance training programs.\n\nDocumentation: Maintain comprehensive records of training sessions, participant progress, and feedback for reporting purposes.\n\nTraining Need Analysis: Identify the Skill gaps and training requirement for the department\n\n\n\nQualification and Skills:\n\nSkills : Training Design, Presentation Skills, Interpersonal Skills, Instructional Technology, Adaptability, Analytical Skills , experience with software training and learning management system.\n\nA bachelor’s degree in Training and Development, or certificate or a related field experience.\n\nFamiliar with the onboarding tools, user pilot and Learning Management Systems (LMS)Job description\n\nCandidate will be responsible for designing, developing, and delivering training programs that enhance employee performance in processes.\n\nJob Types: Full-time, Permanent\n\nPay: ₹350,000.00 - ₹500,000.00 per year\n\nBenefits:\n* Health insurance\n* Provident Fund\nSchedule:\n* Day shift\n\nWork Location: In person",
        "Salary": "₹350,000 - ₹500,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=65f12e06a9170e52",
        "JobType": [
            "Permanent",
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "UX Developer",
        "Company": "Enlighten Schola",
        "Location": "Mumbai, Maharashtra",
        "Description": "*Job Position :-* UX Developer\n*Type :- *Onsite\n*Duration :-* Fulltime\n\n\n*Developer Skills : React JS and React Native*\n* 3-5 years of experience in software developer role\n* Should have good knowledge of React JS and experience building single page applications using React JS frameworksand libraries\n* Experience with REST API's and JSON data formats\n* Preferable to have experience of Redux saga, Multimedia\n\n*(Video, Audio)*\n\nReact Native\n* Hands on Experience in React Native, HTML5, CSS, JavaScript\n* Experience in building mobile apps on Android and IOS platforms\n* Significant experience working with React native mobil\n* Good understanding of object-oriented design and programming concepts.\n\n*Requirements:*\n* Comfortable working in an Agile environment\n* Experience in problem solving and crafting solutions\n* Must have good scores in the algorithm testing and goodscores in academics also\n* Must have demonstrated a steep learning curve\n* Good communication skills and strong ability to work acrossteams\n* Familiarity with tools and resources like Flux, Flow, Redux,Github, Jira etc\n* Real-time communications (voice/video conferencing)experience, and/or WebRTC experience will be a plus.\n\nJob Types: Full-time, Permanent\n\nPay: ₹800,000.00 - ₹1,000,000.00 per year\n\nSchedule:\n* Day shift\n\n\n\nApplication Question(s):\n* Do you have experience in React JS and React Native ?\n* What is your Notice period?\n* Do you experience with WebRTC ?\n\nWork Location: In person",
        "Salary": "₹800,000 - ₹1,000,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=927a195e2b72e516",
        "JobType": [
            "Permanent",
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Senior Software Engineer/ Lead Software Engineer - Javascript , Python",
        "Company": "NEC Software Solutions",
        "Location": "Mumbai, Maharashtra",
        "Description": "Company Description\n\nNEC Software Solutions (India) Private Limited! is based in Mumbai (Worli & Airoli) and\nBangalore with an employee strength of 1300+. It is one of the foremost providers of end-\nto-end IT services across various sectors. We work with diverse industry verticals which\ninclude publishing, media, financial services, retail, healthcare and technology companies\naround the world. Our customers range from two-person startups to $bn listed companies.\n\nWe have more than 30 years of experience in providing end to end IT services across the\nglobe and have earned a reputation for delighting our customers by consistently surpassing\nexpectations and helping them deliver robust, market-ready software products that meet\nthe highest standards of engineering and user experience. Supported by more than 1300\nexceptionally talented manpower, we are a hub for offshore support and technology\nservices.\n\nJob Description\n\nDesignation/Role: Senior Software Engineer\n\nReporting Structure - Project Manager\n\nRequisites\n\nEducation Qualification: B.E/ MCA\n\nOverall Experience -7-11 years\n\nTotal & Relevant Experience (years): 7-11 yrs and Relevant - 4-6 years\n\nLocation: Mumbai\n\nWorking Hours: Full Time\n\nRole Summary:\n\nWhat you will be doing:\n\nAs a Full Stack Developer, you will be part of a small competent team that works on a modern applications contributing to all phases of the development process. You will be involved in development and customer liaison, supporting business objectives while providing expertise in the full software development lifecycle, from concept and design, through coding and into testing.\n\nCore Responsibilities\n\nA Senior Full Stack Engineer is expected to spend a significant amount of their time hands-on in the production of software for NECSWS products\nPrepare and produce releases of software and push into production\nDiscuss requirements with customers and identify potential solutions\nDevelop application logic and associated user interfaces for required changes\nSetup infrastructure (IaC) needed to support updates\nWork with members of the teams to ensure customer-centric development of features\nDevelop and improve the testing strategies (unit test, integration testing, etc) using suitable testing libraries\nSolve problems\nCode reviews\nInvestigate new technologies\nProvide support for production systems\nResponsive support to customer reported issues\nAnalysis of logs to identify issues and provide solutions\n\nGrowth and Development\n\nDevelop new skills by working with other members of the team\nLead and partake in technical discussions within the team\nActively identify and complete opportunities for self-training and external training\n\nPersonal attributes that will help you\n\nProblem solving - recognition of problems and recasting difficult-to-solve problems in order to find unique and innovative solutions\nInquisitiveness - digging into problems and solutions to understand the underlying technology\nAutonomy - ability to work on a task and solve problems independently\nMotivation - sets personal challenges and constantly looking to stretch themselves\nIntegrity - honest and transparent in dealing, open to voice and accept criticism, is trustworthy and builds credibility through actions\nDetail focussed - pays attention to the details and can make a conscious effort to understand causes instead of just the effects\nBig picture aware - understands the scope and impact of a problem or solution\n\nSkillset / Responsibilities Essential:\n\nJavaScript (TypeScript & React) development experience for the frontend.\nPython development experience for the backend.\nAble to design and develop clean and easy-to-use user interfaces.\nBackend programming experience for web applications (CRUD).\nComfortable speaking to users to gather requirements.\nBasic familiarity with core serverless AWS components and Infrastructure-as-Code.\nA track record of delivering software features into production.\nSolid understanding of Software Development Life Cycle.\nHolds or is able to hold UK NPPV-3 and SC clearances.\n\nQualifications\n\nGraduate\n\nAdditional Information",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=c0cc5a65aacc0735",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    }
]