[
    {
        "JobTitle": "Senior Level Developer (ERP Focus)",
        "Company": "Softype",
        "Location": "Mumbai, Maharashtra",
        "Description": "The Softype family is a team of highly motivated and talented professionals, keen to learn and grow. We have a supportive work environment and encourage a culture of learning. Since the pace of technological change is accelerating every day, we need our team to stay on top of all new technological trends.\n\nIf you are seeking an opportunity for professional growth, and are willing to learn and contribute, join us.\nYou can also send your CVs to jobs@softype.com.\nSenior Level Developer (ERP Focus)\nNumber of Openings – 1\nWorking hours: 9 am to 6.30 pm EST (Work from Office)\nWorking days: Monday to Friday\n\nKey Responsibilities:\n\nERP Software Development:\nDesign, develop, and maintain ERP modules to meet specific client needs, customizing systems to improve business processes and overall performance. Ensure smooth integration with third-party systems to optimize workflow.\n\nTechnical Leadership:\nAct as the technical lead for ERP projects, guiding the architecture and design. Mentor junior and mid-level developers in ERP best practices and perform thorough code reviews to maintain high-quality standards.\n\nProject Collaboration\nCollaborate with business analysts and functional consultants to fully understand client requirements. Work closely with project managers to ensure project timelines, budgets, and deliverables are met while effectively communicating technical solutions to non-technical stakeholders.\n\nSystem Optimization and Troubleshooting:\nQuickly diagnose and resolve complex ERP issues, focusing on improving performance, scalability, and system reliability. Continuously optimize existing ERP systems to meet evolving business needs.\n\nData Management:\nOversee data migration efforts, including mapping, cleansing, and validation, ensuring data integrity across multiple ERP platforms. Maintain accuracy and consistency of data to support business decision-making.\n\nDocumentation and Support:\nPrepare detailed technical documentation, including system architecture and troubleshooting guides. Contribute to internal knowledge bases and lead training sessions to share insights and best practices within the team.\n\nContinuous Learning and Improvement:\nStay updated with the latest ERP technologies, tools, and industry trends. Proactively identify opportunities to enhance system functionality and optimize internal processes for greater efficiency.\n\nQualifications:\n\nEducation\n\nBachelor’s or Master’s degree in Computer Science, Information Technology, Software Engineering, or a related field.\n\nExperience\n\nAt least 5–8 years of experience in software development, with significant exposure to ERP systems.\nHands-on experience with ERP platforms such as SAP, Oracle, Microsoft Dynamics, or NetSuite.\nProven ability to lead technical teams and deliver complex ERP projects.\n\nTechnical Skills\n\nExpertise in programming languages like Java, C#, Python, or similar.\nStrong knowledge of relational databases (e.g., SQL, PostgreSQL) and ERP data structures.\nExperience with API development, REST/SOAP services, and middleware.\nFamiliarity with cloud technologies (e.g., AWS, Azure) and DevOps practices is a plus.\n\nSoft Skills\n\nExcellent problem-solving and analytical skills.\nStrong communication and collaboration abilities, with experience working in cross-functional teams.\nLeadership skills with a focus on mentoring and team development.\n\nCertifications (Preferred but not mandatory)\n\nRelevant ERP certifications (e.g., SAP ABAP, Oracle Certified Professional, Microsoft Dynamics 365).\nAgile or Scrum certifications.\nTop employee benefits/ perks:\n\nLeadership Opportunities in Cutting-Edge ERP Projects\nProfessional Growth: Certifications, training, and structured ERP-specific technical programs.\nHands-On Experience: Real-world ERP projects and mentorship from seasoned professionals.\nWork Environment: Collaborative, innovative, and teamwork-focused.\nFlexibility: hybrid work options with seniority.\nCompetitive Benefits: Above-average salary and comprehensive perks.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=955da899472cf922",
        "JobType": [],
        "PostedDate": "2 days ago"
    },
    {
        "JobTitle": "Quantitative Research Data Engineer: Vice President",
        "Company": "JPMorganChase",
        "Location": "Mumbai, Maharashtra",
        "Description": "JOB DESCRIPTION\n\nAre you looking for an exciting opportunity to join a dynamic and growing team in a fast paced and challenging area? This is a unique opportunity for you to work in our team to partner with the Business to provide a comprehensive view.\n\nAs a Quantitative Research Data Engineering Vice President within our Wholesale Credit Data QR team, you will play a pivotal role in designing, analyzing, and delivering firm-wide data to support our Wholesale Credit Stress (CCAR, ICAAP, Risk Appetite) and Loan loss reserves models. In this role, you will focus on data model definition and the evolution of our Data Dictionary to enable deep dive data analysis and analytical explorations. You will have the opportunity to work on the evolution of our frameworks, underlying data platforms, and related tools to enhance the integration of pricing and forecast models, improve flexibility, extendibility of the framework, and improve scalability and performance. You will collaborate with experienced Wholesale Credit model developers and business partners, and have the chance to guide and mentor junior team members.\n\nJob Responsibilities\n\nWork as data engineer, to create or build data pipeline, define API to source data from different systems, perform complex transformation or enhancements to data and optimize end to end run.\nPerform data analysis to support model development and analytics\nLiaise with various lines of business and risk modelers, thoroughly understand various models for BASEL, CCAR, CECL and other credit risk models\nWork with multiple stakeholders to elicit, analyze, refine and document business process and data requirements\nCollaborate through the entire Software Development Life Cycle (SDLC) including planning, analysis and testing of new applications and enhancements to existing applications\nPerform user acceptance testing and deliver demos to stakeholders by SQL queries or Python scripts\n\nRequired qualifications, capabilities, and skills\n\nBachelor’s or Master’s in Computer Science, Data Analytics or equivalent discipline. Experience of 7+ years in data engineering role in financial services, data analytics with focus on frameworks to handle large datasets and similar.\nData Analysis and data manipulation skills using SQL , Python, object orient programming & MS Excel is required. Strong analytical skills in forecasting and interpreting results and comfortable working with large quantities of data\nPrior experience on building data architecture to source data from different systems, handling complex transformation ad optimizing the end to end solution\nAbility to solve problems creatively while working in a dynamic and challenging environment under tight deadlines. Eagerness to learn about Credit Risk, Risk Parameters, Regulatory and Accounting concepts\nDetail oriented and strong organizational skills. Excellent communication abilities, both written and oral\nExperience implementing analytics frameworks in finance. Experience with source control, automated build/test systems, code coverage, unit testing and release processes\n\nPreferred qualifications, capabilities, and skills\n\nExperience in software engineering to build data architecture based on python, object orient programming, SQL etc. is preferable\nKnowledge of Wholesale Credit, CCAR, Allowance (IFRS 9/CECL), Basel II/III regulatory capital\nProven ability to develop collaborative relationships with key internal partners to achieve objectives and prioritizations\n\nABOUT US\n\nJPMorganChase, one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. We also make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as mental health or physical disability needs. Visit our FAQs for more information about requesting an accommodation.\n\nABOUT THE TEAM\n\nAs part of Risk Management and Compliance, you are at the center of keeping JPMorganChase strong and resilient. You help the firm grow its business in a responsible way by anticipating new and emerging risks, and using your expert judgement to solve real-world challenges that impact our company, customers and communities. Our culture in Risk Management and Compliance is all about thinking outside the box, challenging the status quo and striving to be best-in-class. We also take great pride in on our commitment to operating with integrity and discipline in all that we do. If you are a team player, are solutions-oriented and have an appetite for learning, you’ll be a great fit for our team.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=782bc26389c22d8f",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "2 days ago"
    },
    {
        "JobTitle": "Associate, Software Engineering - Development",
        "Company": "Kyndryl",
        "Location": "Mumbai, Maharashtra",
        "Description": "Who We Are\n\nAt Kyndryl, we design, build, manage and modernize the mission-critical technology systems that the world depends on every day. So why work at Kyndryl? We are always moving forward – always pushing ourselves to go further in our efforts to build a more equitable, inclusive world for our employees, our customers and our communities.\n\nThe Role\n\nAre you passionate about solving complex problems? Do you thrive in a fast-paced environment? Then there’s a good chance you will love being a part of our Software Engineering – Development team at Kyndryl, where you will be able to see the immediate value of your work.\n\nAs a Software Engineering - Developer at Kyndryl, you will be at the forefront of designing, developing, and implementing cutting-edge software solutions. Your work will play a critical role in our business offering, your code will deliver value to our customers faster than ever before, and your attention to detail and commitment to quality will be critical in ensuring the success of our products.\n\nUsing design documentation and functional programming specifications, you will be responsible for implementing identified components. You will ensure that implemented components are appropriately documented, unit-tested, and ready for integration into the final product. You will have the opportunity to architect the solution, test the code, and deploy and build a CI/CD pipeline for it.\n\nAs a valued member of our team, you will provide work estimates for assigned development work, and guide features, functional objectives, or technologies being built for interested parties. Your contributions will have a significant impact on our products' success, and you will be part of a team that is passionate about innovation, creativity, and excellence. Above all else, you will have the freedom to drive innovation and take ownership of your work while honing your problem-solving, collaboration, and automation skills. Together, we can make a difference in the world of cloud-based managed services.\n\nYour Future at Kyndryl\nThe career path ahead is full of exciting opportunities to grow and advance within the job family. With dedication and hard work, you can climb the ladder to higher bands, achieving coveted positions such as Principal Engineer or Vice President of Software. These roles not only offer the chance to inspire and innovate, but also bring with them a sense of pride and accomplishment for having reached the pinnacle of your career in the software industry.\n\nWho You Are\n\nYou’re good at what you do and possess the required experience to prove it. However, equally as important – you have a growth mindset; keen to drive your own personal and professional development. You are customer-focused – someone who prioritizes customer success in their work. And finally, you’re open and borderless – naturally inclusive in how you work with others.\n\nRequired Technical and Professional Experience\n\n2-4 years of experience working as a software engineer on complex software projects\nExcellent coding skills and solid development experience (Java, Python, .Net etc.) with debugging and problem-solving skills\nSoftware development methodologies, with demonstrated experience developing scalable and robust software.\nExperienced in relational and NoSQL databases, data mapping, XML/JSON, Rest based web services.\nKnowledge of architecture design - Microservices architecture, containers (Docker & k8s), messaging queues.\nDeep understanding of OOP and Design patterns\n\nPreferred Technical and Professional Experience\n\nBachelor's degree in computer science, related technical field, or equivalent practical experience.\nCertification in one or more of the hyperscale's (Azure, AWS, and Google GCP) - otherwise, you can obtain certifications with Kyndryl.\nExperience with DevOps tools and modern engineering practices\n\nBeing You\n\nDiversity is a whole lot more than what we look like or where we come from, it’s how we think and who we are. We welcome people of all cultures, backgrounds, and experiences. But we’re not doing it single-handily: Our Kyndryl Inclusion Networks are only one of many ways we create a workplace where all Kyndryls can find and provide support and advice. This dedication to welcoming everyone into our company means that Kyndryl gives you – and everyone next to you – the ability to bring your whole self to work, individually and collectively, and support the activation of our equitable culture. That’s the Kyndryl Way.\n\nWhat You Can Expect\n\nWith state-of-the-art resources and Fortune 100 clients, every day is an opportunity to innovate, build new capabilities, new relationships, new processes, and new value. Kyndryl cares about your well-being and prides itself on offering benefits that give you choice, reflect the diversity of our employees and support you and your family through the moments that matter – wherever you are in your life journey. Our employee learning programs give you access to the best learning in the industry to receive certifications, including Microsoft, Google, Amazon, Skillsoft, and many more. Through our company-wide volunteering and giving platform, you can donate, start fundraisers, volunteer, and search over 2 million non-profit organizations. At Kyndryl, we invest heavily in you, we want you to succeed so that together, we will all succeed.\n\nGet Referred!\n\nIf you know someone that works at Kyndryl, when asked ‘How Did You Hear About Us’ during the application process, select ‘Employee Referral’ and enter your contact's Kyndryl email address.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=e5df91f0dfb586e7",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "2 days ago"
    },
    {
        "JobTitle": "Software Engineer(Firewall)",
        "Company": "Orbitouch Outsourcing Private Limited",
        "Location": "Mumbai, Maharashtra",
        "Description": "*Urgent Hiring for Software engineer(Firewall) || Mumbai*\n\n\n\nProfile - Firewall Appliance Development Team Lead\n\nLocation- Vashi (Mumbai)\n\nExperience – 5+ years\n\nCtc- upto 10 to 20 Lpa\n\n\n\n\n\n*Key Responsibilities:*\n\n\n* *Technical Leadership:*\n* Lead the design, development, and enhancement of firewall appliance features.\n* Establish coding standards, best practices, and efficient workflows for the team.\n* Provide hands-on technical support and contribute to key development tasks.\n\n\n* *Team Management and Mentorship:*\n* Manage a team of developers, assigning tasks, setting priorities, and ensuring deadlines are met.\n* Mentor team members to improve their technical skills and professional growth.\n* Foster a collaborative and productive team environment.\n\n\n* *Development and Implementation:*\n* Oversee the implementation of features using *C* and *Python*.\n* Review and optimise code for performance, scalability, and maintainability.\n* Ensure seamless integration of new features with the existing appliance architecture.\n\n\n* *Project Management:*\n* Plan, manage, and monitor development projects using Jira or similar tools.\n* Track progress, identify risks, and implement solutions to meet project timelines.\n* Communicate project updates and milestones to stakeholders.\n\n\n* *Process and Quality Assurance:*\n* Implement and maintain development processes, including CI/CD pipelines, testing frameworks, and version control systems.\n* Conduct thorough code reviews to ensure adherence to quality and security standards.\n\n\n* *Documentation and Reporting:*\n* Create and maintain comprehensive documentation for system designs, processes, and workflows.\n* Provide regular reports on project status, team performance, and development progress.\n\n\n\n*Required Skills and Qualifications:*\n* *Technical Expertise:* Advanced proficiency in *C* and *Python*.\n* *Leadership:* Proven experience leading and mentoring development teams.\n* *Development Tools:* Proficiency with tools such as Git, Jenkins, and CI/CD pipelines.\n* *Project Management:* Strong skills in managing tasks and workflows using Jira or similar tools.\n* *Communication:* Excellent verbal and written communication skills for team and stakeholder engagement.\n* *Problem-Solving:* Strong analytical skills to resolve complex technical challenges efficiently.\n\n\n\n*Preferred Qualifications:*\n* Experience in firewall or networking technology development.\n* Knowledge of Linux-based systems and network security protocols.\n* Familiarity with Agile methodologies and practices.\n* Experience with debugging tools like GDB or Valgrind.\n\n\n\n*Education and Experience:*\n* Bachelor’s degree in Computer Science, Software Engineering, or a related field.\n* 5+ years of software development experience, with at least 2 years in a team leadership role.\n\n\n\n*What We Offer:*\n* Opportunity to lead a talented team working on cutting-edge cybersecurity technologies.\n* A collaborative and innovative work environment.\n* Competitive salary and benefits package\n\nInterested candidates can share their CV over the given mail\n\n*Thanks and Regards*\n\n\n\n*Hr. Diksha dixit*\n\n*Ph.no :- 9289237370*\n\n*Email id:- diksha@orbitouch-hr.com*\n\n*Orbitouch Outsourcing Private Limited*\n\nJob Type: Full-time\n\nPay: ₹300,000.00 - ₹2,000,000.00 per year\n\nSchedule:\n* Day shift\n\n\n\nApplication Question(s):\n* do you have experience in team lead ?\n\nExperience:\n* software engineer: 5 years (Required)\n* Firewall: 3 years (Required)\n\nWork Location: In person",
        "Salary": "₹300,000 - ₹2,000,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=5c5807c9405ff3a4",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Senior Full Stack Developer",
        "Company": "Networth Tracker Solutions Pvt Ltd",
        "Location": "Andheri, Mumbai, Maharashtra",
        "Description": "*Company Overview:*\n\nNetworth Tracker is an AI-powered fintech platform designed to offer intelligent financial tracking, analytics, and advisory services. Our mission is to provide users with real-time insights into their financial health by integrating data from various sources, including income, expenses, assets, liabilities, and investments. We are building a scalable, high-performance, and secure platform that is revolutionizing personal finance management.\n\n*Position: Senior Full Stack Developer – Urgent Hiring*\n\nWe are urgently looking for a highly skilled Senior Full Stack Developer to join our dynamic team and play a key role in the development of the Networth Tracker platform. This is an excellent opportunity for an experienced developer with strong expertise in modern technologies, including React.js, React Native, Node.js, Python, and Google Cloud Platform (GCP). If you are passionate about fintech and want to make an impact in an innovative environment, we want to hear from you!\n\n*Key Responsibilities:*\n* *Full Stack Development* – Lead the development of both the front-end and back-end systems, ensuring they are scalable, efficient, and optimized. Integrate diverse financial data sources seamlessly into the platform.\n* *GCP & Cloud Infrastructure* – Design and implement scalable, secure, and cost-efficient solutions on Google Cloud Platform (GCP).\n* *System Architecture & Design* – Collaborate on defining and implementing the architecture of the platform, ensuring it can grow and scale with the product.\n* *API Development* – Design and implement RESTful APIs for secure integration of various financial services.\n* *Code Quality & Best Practices* – Write clean, maintainable, and secure code. Perform regular code reviews and encourage best practices across the development team.\n* *Database Management* – Work with both NoSQL (Firestore, MongoDB) and relational databases (MySQL, PostgreSQL) to ensure optimal data storage and management.\n* *Security & Compliance* – Implement best practices for data security, encryption, and financial compliance standards.\n* *Performance Optimization* – Continuously monitor, evaluate, and optimize the performance of the platform to ensure high availability, speed, and reliability.\n\n*Requirements:*\n* *8+ years of experience* as a Full Stack Developer or Senior Engineer with expertise in both front-end and back-end technologies.\n* *Strong proficiency in JavaScript*, especially in frameworks such as *React.js, React Native*, and *Node.js*.\n* *Experience with Python* for backend development.\n* *In-depth knowledge of Google Cloud Platform (GCP)* and cloud infrastructure management.\n* Strong understanding of *NoSQL (Firestore, MongoDB)* and *relational databases (MySQL, PostgreSQL)*.\n* *Experience in CI/CD pipelines*, version control with GitHub, and overall system design.\n* Proven track record in developing *secure applications* with a focus on *data encryption* and *financial compliance*.\n* *Excellent problem-solving* skills and the ability to lead and mentor junior developers.\n\n*Preferred Skills:*\n* Experience in *fintech platforms* or *financial applications*.\n* Familiarity with *data privacy regulations* (e.g., DPDP Act).\n* *Leadership experience* and ability to guide teams.\n\n*Job Type:* Full-time, Permanent\n\n*Location:* *Andheri, Mumbai, Maharashtra*\n* Must be able to *reliably commute* or plan to relocate before starting work.\n\n*Benefits:*\n* Paid time off\n* Opportunity for growth in an innovative and fast-paced environment\n\n*Schedule:* Day shift\n\n*Application Questions:*\n* Can you start immediately?\n* Are you willing to work on an assignment as part of the hiring process?\n\n*Experience:*\n* *Node.js:* 3 years (Required)\n* *APIs:* 3 years (Required)\n\nIf you are looking to join a high-impact fintech company and have the skills to make a difference, *apply now* and become part of our team!\n\n*Apply Here:*\nhttps://forms.gle/gYQzvfPwn3W9NFnSA\n\nJob Types: Full-time, Permanent\n\nBenefits:\n* Paid time off\nSchedule:\n* Day shift\n\n\n\nAbility to commute/relocate:\n* Andheri, Mumbai, Maharashtra: Reliably commute or planning to relocate before starting work (Required)\n\nApplication Question(s):\n* We must fill this position urgently. Can you start immediately?\n* Are you willing to undertake and work on an assignment as a part of the hiring process?\n\nExperience:\n* Node.js: 3 years (Required)\n* APIs: 3 years (Required)\n\nWork Location: In person",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=04fd76cd69eebf50",
        "JobType": [
            "Permanent",
            "Full-time"
        ],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "MS Copilot Studio Developer",
        "Company": "Clowise Business Solutions",
        "Location": "Mumbai, Maharashtra",
        "Description": "This role involves collaborating with the client and internal cross-functional teams *to develop and implement Virtual Assistants using Microsoft Copilot Studio.* The successful candidate will be adept at gathering and analysing the business requirements, developing the solution (P.O.C., Pilot, Production) and with necessary solution documentation.\n\n*Responsibilities: *\n* Understand customer requirements and challenges and recommend suitable and optimal technology solution\n* Develop POC’s and Minimal Viable Product (MVP) to demonstrate capabilities of CoPilot Studio (Power Virtual Agents), Power Apps and Power Automate\n* Develop conversational assistants and generative AI solutions from scratch and enhance it.\n* Create bots with Microsoft Copilot Studio using natural language to generate topics, trigger phrases and responses.\n* Develop Copilot plugins and connectors for Copilot extensibility.\n* Automate business process by developing and delivering Power Platform based solutions.\n\n*Required Qualifications:*\n* Hands on Development Experience with Microsoft Cloud technologies such as Azure, Power Platform, Dynamics 365, Microsoft 365, etc.\n* Proficiency in one or more programming languages such as C#, Python, JavaScript, etc. Familiarity with AI concepts and frameworks such as Large Language Models, OpenAI, etc.\n* Excellent communication and problem-solving skills\n* *Microsoft Copilot Studio skills:* You need to know how to use Microsoft Copilot Studio / PVA to create and manage bots, topics, actions, variables, plugins and analytics.\n* *Microsoft Power Platform skills:* You need to know how to use Power Apps, Power Automate, Power Virtual Agents, and AI Builder to build low-code applications that can leverage Microsoft Copilot capabilities.\n* *Microsoft Azure skills:* You need to know how to use Azure OpenAI, Azure Cognitive Services, Azure Machine Learning, and other Azure services to run chat models, generate natural language, and create custom AI solutions for your Microsoft Copilot applications.\n* Experience in integrating Power Platform with other systems using Azure integration services or other API Management platforms.\n* Experience in other conversational AI platform Microsoft Bot Framework will be an advantage, but not a necessary requirement.\n* Communication Skills: Ability to clearly communicate requirements, findings, and project updates to stakeholders\n\nLocation: Mumbai (Work from Office)\n\nJob Type: Full-time\n\nPay: ₹1,000,000.00 - ₹1,600,000.00 per year\n\nLocation Type:\n* In-person\nSchedule:\n* Day shift\n\n\n\nAbility to commute/relocate:\n* Mumbai, Maharashtra: Reliably commute or planning to relocate before starting work (Required)\n\nExperience:\n* MS Copilot Studio: 1 year (Required)\n* Power Automate: 1 year (Required)\n\nWork Location: In person",
        "Salary": "₹1,000,000 - ₹1,600,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=52eaf0c7051f06b6",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Night Shift- Python developer: microservies",
        "Company": "Neural IT",
        "Location": "Thane, Maharashtra",
        "Description": "*Share resume at careers@neuralit.com*\n\n*Python Developer Microservices - FASTAPI ( Night Shift 8PM-5AM )*We are looking for a skilled Python Developer - Microservices architecture.The ideal candidate will have experience in building web applications using Python.As a microservices developer, you are required to build software systems that have well-defined interfaces.*Key Responsibilities*:\n* Develop and maintain the backend of a case management system using Python.\n* Design and implement RESTful APIs to support various features of the system, using FAST API Framework.\n* Collaborate with front-end developers to integrate user-facing elements with server-side logic.\n* Write clean, maintainable, and well-documented code.\n* Implement security and data protection measures.\n* Troubleshoot, debug, and upgrade existing systems.\n\n*Qualifications*:\n* 0-2 Years of experience in developing RESTful APIs, specifically using FAST API Framework- MANDATORY\n* Familiarity with front-end technologies (e.g., HTML, JavaScript, CSS and React.JS) is a plus.\n* Experience with database systems like MySQL, PostgreSQL, or MongoDB.\n* Knowledge of version control systems, particularly Git.\n* Strong problem-solving skills and attention to detail.\n* Excellent communication and teamwork skills.\n* Ability to work independently and manage your time effectively.\n\n*Preferred Skills*:\n* Experience with API documentation tools like Swagger or Postman.\n* Familiarity with Docker and containerization.\n* Understanding of CI/CD pipelines and DevOps practices.\n\nJob Types: Full-time, Permanent\n\nPay: ₹20,000.00 - ₹35,000.00 per month\n\nBenefits:\n* Health insurance\n* Provident Fund\nSchedule:\n* Fixed shift\n* Monday to Friday\n* US shift\nSupplemental Pay:\n* Yearly bonus\n\nWork Location: In person",
        "Salary": "₹240,000 - ₹420,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=c49907eeb6b392e9",
        "JobType": [
            "Permanent",
            "Full-time"
        ],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Systems Integration Advisor",
        "Company": "NTT DATA",
        "Location": "Mumbai, Maharashtra",
        "Description": "Req ID: 307844\n\nNTT DATA strives to hire exceptional, innovative and passionate individuals who want to grow with us. If you want to be part of an inclusive, adaptable, and forward-thinking organization, apply now.\n\nWe are currently seeking a Systems Integration Advisor to join our team in Mumbai, Mahārāshtra (IN-MH), India (IN).\n\nCandidate must be well versed on Middleware products and services hosted in virtual machines, containers, and public cloud. They should come with working knowledge of orchestration platforms such as Ansible, Puppet & Terraform as well as CI/CD process automation. Candidate should have experience delivering and managing cloud solutions in support of a large-scale application migration strategy. They will enable and configure middleware products for application onboarding. They will also enhance monitoring as appropriate to allow proactive responses to issues. AWS Cloud Engineering - Strong understanding of AWS services and architecture. - Experience with Amazon EC2, VPC, IAM, and other core AWS services. - Ability to design and implement cloud-based solutions. Terraform: - Proficiency in Infrastructure as Code (IaC) using Terraform - Experience writing and managing Terraform configurations - Understanding of Terraform workflow, including plan and apply phases Kubernetes - Proficiency in container orchestration and Kubernetes architecture. - Experience with deploying and managing containerized applications. - Knowledge of Kubernetes components. - Familiarity with Helm charts for application deployment. VS Code - Experience using VS Code as a primary development environment. Additional Skills - CI/CD pipeline integration with Kubernetes. - Monitoring and logging in Kubernetes environments. - Security best practices for both AWS and Kubernetes. - Scripting skills, particularly in Bash or Python. - Understanding of cloud networking concepts and protocols - Working knowledge of monitoring and logging tools - Strong problem-solving and analytical skills - Good communication and team collaboration skills - Expertise with installing and deploying applications to the cloud - Experience with Agile methodology - Knowledge of Identity management tools and their usage (PingIdentity, EntraID, MFA, etc) - Ability to collaborate with application developer teams on their cloud strategy - Execution mindset to deliver fast results - Well versed with IaaS, PaaS & SaaS frameworks\n\nAbout NTT DATA\n\nNTT DATA is a $30 billion trusted global innovator of business and technology services. We serve 75% of the Fortune Global 100 and are committed to helping clients innovate, optimize and transform for long term success. As a Global Top Employer, we have diverse experts in more than 50 countries and a robust partner ecosystem of established and start-up companies. Our services include business and technology consulting, data and artificial intelligence, industry solutions, as well as the development, implementation and management of applications, infrastructure and connectivity. We are one of the leading providers of digital and AI infrastructure in the world. NTT DATA is a part of NTT Group, which invests over $3.6 billion each year in R&D to help organizations and society move confidently and sustainably into the digital future. Visit us at us.nttdata.com\n\nNTT DATA endeavors to make https://us.nttdata.com accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact us at https://us.nttdata.com/en/contact-us. This contact information is for accommodation requests only and cannot be used to inquire about the status of applications. NTT DATA is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status. For our EEO Policy Statement, please click here. If you'd like more information on your EEO rights under the law, please click here. For Pay Transparency information, please click here.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=f0d5acfbd146c48f",
        "JobType": [],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Data Engineering Lead",
        "Company": "Mahindra & Mahindra Ltd",
        "Location": "Mumbai, Maharashtra",
        "Description": "Responsibilities & Key Deliverables\n\nEngineering Lead / BI Architect provide vision and direction for the data engineering and BI analytics teams, aligning their efforts with the organization's overall business goals and strategies. Oversee the design, implementation, and maintenance of robust data pipelines and architectures that ensure the efficient collection, storage, and retrieval of data. Lead the development of advanced analytics and reporting frameworks that transform raw data into actionable insights, enabling informed decision-making across the organization. Establish and enforce data governance policies to ensure data accuracy, consistency, and security, thereby maintaining high data quality standards across all organizational data assets. Work closely with other departments, such as IT, marketing, finance, and operations, to understand their data needs and deliver tailored BI solutions that drive business performance. Mentor and develop a high-performing team of data engineers, analysts, and BI professionals, ensuring they have the skills and resources needed to succeed and contribute to the organization’s data-driven objectives.\n\nExperience\nData Architecture Design:\nDevelop and implement data architectures that align with the organization’s business goals.\nDesign data models, establish data standards, and oversee data integration, migration, and management processes.\nArchitect and optimize data storage and retrieval systems to handle large-scale data processing effectively.\nLeadership and Mentorship:\nLead and mentor a team of data engineers in designing and developing data pipelines, ETL/ELT processes, and data integration solutions.\nManage project priorities, allocate resources, and track progress to ensure timely delivery of projects.\nData Governance and Security:\nCreate and maintain data dictionaries, providing context and clarity for organizational data assets.\nImplement and enforce data governance policies and security protocols to protect sensitive data.\nCollaboration and Stakeholder Communication:\nPartner with database administrators, developers, data analysts, and other IT professionals to align data architecture with organizational systems.\nEngage with stakeholders to understand business requirements and ensure alignment of data solutions with strategic objectives.\nQualifications\nEducation and Certification:\nBachelor’s or Master’s degree in Computer Science, Information Technology, or a related field.\nCertifications in Database Management or Cloud Data Architecture (e.g., GCP, AWS, Azure) are preferred.\nTechnical Expertise:\nProven expertise in data modelling and design, including conceptual, logical, and physical data models.\nAdvanced knowledge of ETL/ELT processes and data integration workflows.\nProficiency with a variety of data technologies, including relational databases, NoSQL databases, data warehouses, and data lakes.\nStrong hands-on experience with tools such as Apache Kafka, Apache Spark, Hadoop, and PySpark.\nGeneral Requirements\n\nProgramming expertise in languages like Python,Scala and Java\n\nJob Segment: Engineer, Engineering",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=68af3adbab23ac47",
        "JobType": [],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Data Scientist",
        "Company": "Husqvarna",
        "Location": "Mumbai, Maharashtra",
        "Description": "Welcome to a new and exciting role at Husqvarna Group, where your passion for AI can truly make a difference.\n\nHere, we’re driving AI innovation with visible, business-focused applications that are transforming how we work. We’re shaping the future of innovation - and now we want you to be a part of it!\n\nAbout the role:\n\nAs our new Data Scientist, you’ll be at the heart of our AI transformation, responsible for developing and implementing AI solutions that change the way we work as a company. Your role will be central in building the bridge between innovative technology and everyday application, and you’ll collaborate across departments, to ensure our teams are equipped and confident in leveraging AI solutions.\n\nAs part of a cross-functional team, you’ll work closely with key stakeholders to deliver innovative, practical solutions. Our agile approach ensures that every project is hands-on, relevant and focused on real business needs. You’ll be a part of building AI applications that are scalable, impactful, and tailored to Husqvarna’s specific challenges.\n\nWhat You’ll Do:\n\nCarry out end-to-end development and delivery of AI solutions including data pre-processing, data analysis, model building, fine tuning, deployment in cloud environments and maintenance.\n\nDesign, construct, install, test, and maintain data management systems to meet business requirements and industry practices.\n\nDevelop and implement scripts for database maintenance, deployment, and ETL operations.\n\nManage cloud services, particularly AWS and Azure, and other cloud storage systems relevant for the development of data and AI solutions.\n\nMonitor data performance and modify infrastructure as needed to improve existing pipelines and models.\n\nCollaborate with data architects, cloud architects, software developers and other IT specialists on project goals.\n\nAssist in developing and documenting feature lists, user stories, and roadmaps aligned with the overarching product vision.\n\nCollect and synthesize product feedback from stakeholders through data analysis, surveys, concept testing, analytics tools, and A/B testing.\n\nCommunicate complex concepts effectively to non-technical stakeholders.\n\nStay updated with the latest technology trends related to data science, data engineering and AI.\n\nBe involved in execution of academic and research projects relevant from the overall Enterprise AI organization perspective.\n\nSupport ideation process during various internal and external ideation sessions with own technical and entrepreneurial approach and experience.\n\nProactively identify business opportunities through technology driven innovation.\n\nParticipate in knowledge sharing activities to elevate company on AI related topics.\n\nWho You Are:\n\nAs the natural team player you are, you thrive on building strong relationships. You have great communication, presentation, collaboration, and teamwork skills, and shine when it comes to solving problems and making reliable decisions. You have the ability to translate business problems into data science solutions and with .strong problem-solving skills with a proactive approach.\n\nEfficient in prioritization and time management, you work seamlessly with cross-functional teams and stakeholders. Self-driven and curious, you bring an innovative approach to new technologies, especially AI and understand relevant cloud trends. Proven experience in multinational corporations and adept at collaborating with diverse, international teams.\n\nYour eagerness to learn keeps you current with industry trends. Balancing long-term goals with short-term needs, you drive success and innovation, and with a proactive mindset, you continuously push the boundaries of what’s possible.\n\nYour Qualifications:\n\nMinimum of 8 years of experience in end-to-end development and delivery of data and AI solutions.\n\nFamiliarity with Databricks and experience with repository management tools like Git.\n\nPreferable experience in working with Gen AI and chatbot / agents projects.\n\nMinimum of 8 years of experience with cloud services: primarily AWS and / or Azure.\n\nStrong knowledge of Python (including relevant libraries such as numpy, sci-kit learn, pandas, matplotlib, etc.), SQL, and experience in Java or Scala.\n\nExperience with big data technologies such as Spark.\n\nGood experience and knowledge of the principles, technologies, and algorithms of GenAI, AI, machine learning and operations research; ability to develop, implement, and deliver related systems, products, and services.\n\nEducation and Experience:\n\nBachelor’s / Master’s / Ph.D. degree in Computer Science, Software Engineering, or a related field.\n\nProven experience as a Data Scientist, Data Engineer, Software Developer, or similar role.\n\nExperience leading and collaborating on cross-functional projects to build products and address concerns in a collaborative and timely fashion.\n\nCertifications in AI technologies would be an advantage. Experience in end-to-end development and delivery of software products in cloud environments is mandatory.\n\nLocation: Location for this position is in Mumbai, India.\n\nBut, with our hybrid working environment, you'll have the flexibility to work both onsite and remotely, promoting work-life balance for all team members. We meet in the office at least 2-3 days a week (50%).\n\nYour application: Ready to be part of something big? Apply as soon as possible but no later than Friday, 21st February 2025. We apply ongoing selection.\n\nIf you have any questions regarding the recruitment process please contact : Rajani Menon – rajani.menon@husqvarnagroup.com\n\nAbout Husqvarna Group:\n\nHusqvarna Group is the world’s largest producer of outdoor power products including robotic lawn mowers, garden tractors, chainsaws and trimmers. The Group is also the European leader in consumer watering products and one of the world leaders in cutting equipment and diamond tools for the construction and stone industries. The Group’s products and solutions are sold via dealers and retailers to both consumers and professional users in more than 100 countries. The head office is located in Stockholm, Sweden, and the share is listed on NASDAQ OMX Stockholm Exchange.\n\nLast date to apply:\n\n21 February 2025",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=9ea030758c62665b",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Lead Developer",
        "Company": "Aeries Technology",
        "Location": "Mumbai, Maharashtra",
        "Description": "Job Id: Aeries/546/24-25\n Industry IT\n Location Bangalore,Hyderabad\n Experience Range 5 - 10 Years\n Qualification Graduate/ Post Graduate\nJob Description\nAbout Us\nAeries Technology is a Nasdaq listed global professional services and consulting partner, headquartered in Mumbai, India, with centers in the USA, Mexico, Singapore, and Dubai. We provide mid-size technology companies with the right mix of deep vertical specialty, functional expertise, and the right systems & solutions to scale, optimize and transform their business operations with unique customized engagement models. Aeries is Great Place to Work certified by GPTW India, reflecting our commitment to fostering a positive and inclusive workplace culture for our employees. Read about us at https://aeriestechnology.com\nAbout Business Unit\nCorporate BU\nRoles and Responsibility\n\nPosition/Title: Lead Developer\n\nDepartment: Aeries Research & Innovation\n\nEmployment Type: Full-time\n\nLocation: Bangalore, Hyderabad, and Mumbai\n\nShifts (if any): 11:00 AM onwards (candidate should be flexible to work as per business requirement)\n\nExperience: 5+ years\n\nAbout the Role: Position Summary\n\nIn this role as a Lead Developer, you will be responsible for providing technical leadership and guidance to engineering team members. You will also create technical documentation such as design and architectural diagrams, work with technical teams to ensure high quality software development. You will also be responsible for interacting with stakeholders to refine product requirements and identify business needs. In addition you will be responsible for ensuring that the products comply security standards, data privacy regulations and industry best practices. This position requires a hands on engineer who is well versed in full stack development and is capable of leading team members.\n\nESSENTIAL DUTIES & RESPONSIBILITIES:\n\n· Perform design, development, and support of existing and new products.\n· Understand product vision and business needs to define product requirements and product architectural solutions.\n· Develop architectural and design principles to improve performance, capacity, and scalability of product.\n· Work with Product Manager in planning and execution of new product releases.\n· Consult business management team to clarify objectives and functional requirements for new or modified products.\n· Work with pre-sales and product management teams in solution demonstrations.\n· Facilitate the creation, review, and sign off of project deliverables.\n· Provide support for production escalations and problem resolution for customers.\n· Assist technical team with issues needing technical expertise or complex systems knowledge.\n· Develop broad knowledge about current and future product features.\n\nRequired Skills:\n\n· Strong organizational and project management skills.\n· Proficiency with server-side languages such as Python, Ruby, Java, PHP, and .Net.\n· Proficiency with Angular JS, React, and Amber.\n· Proficiency with database technology such as MySQL, Oracle, and MongoDB.\n· Proficiency with fundamental front-end languages such as HTML, CSS, and JavaScript.\n· Excellent verbal communication skills.\n· Good problem-solving skills.\n· Attention to detail.\n· Obsession with clean coding practices while building scalable, maintainable and performant code\n· Strong and accurate analytical and communication skills\n· Self-motivated and initiative personality with a can-do attitude and the ability to learn quickly\n· Dedication to fostering an inclusive culture and value diverse perspectives Knowledge or Experience in Angular2+ or similar frameworks\n\nEducational Qualification:\n\n· Degree in computer science. Bachelor’s degree (BE, BTech, BCA, BSc Comp.) or Skill Certification such as CDAC etc.\n· 5 + years’ Experience in a fast-paced technology products or services organization\n· Should be comfortable working as an individual contributor and leading other team members\n· Good communication skills should be a team player & self-learner.\n· Ability to manage / support multiple priorities.\n· Strong creative thinking ability to always come with impactful and unique ideas.\n· Ability to adapt to the evolving needs of the organization, in a fast-paced agile setup.\n\nThe Job responsibilities of the candidate shall include but not limited to the Job Description & to perform any other tasks/functions as required by the Company",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=71d2839c448b905a",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "ERPNext Development |",
        "Company": "Rajlaxmi Solutions Pvt. Ltd",
        "Location": "Wagle Estate, Thane, Maharashtra",
        "Description": "*Job Summary*:\nWe are seeking a skilled and experienced *ERPNext/Frappe Developer* to join our team. The ideal candidate will be responsible for designing, developing, and maintaining custom modules, applications, and integrations within the ERPNext/Frappe framework. You will collaborate closely with the business team to understand requirements and deliver high-quality solutions.\n\n*Key Responsibilities*:\n* Develop and customize ERPNext modules and applications as per business requirements.\n* Create and maintain custom scripts, reports, and workflows within the Frappe framework.\n* Design and implement API integrations with third-party systems.\n* Troubleshoot and debug issues in the existing ERPNext implementation.\n* Optimize system performance and ensure scalability.\n* Collaborate with cross-functional teams to understand business requirements and deliver solutions.\n* Provide technical support and training to users as needed.\n* Stay updated with the latest developments in ERPNext and Frappe technologies.\n\n*Requirements*:\n* Proven experience with ERPNext and Frappe Framework.\n* Strong proficiency in Python, JavaScript, and MySQL/PostgreSQL.\n* Experience with RESTful APIs and third-party integrations.\n* Knowledge of web technologies like HTML, CSS, and Bootstrap.\n* Familiarity with Git for version control.\n* Strong problem-solving skills and attention to detail.\n* Excellent communication and teamwork skills.\n* Bachelor’s degree in Computer Science, Information Technology, or a related field.\n\nJob Types: Full-time, Permanent\n\nPay: ₹30,000.00 - ₹45,000.00 per month\n\nBenefits:\n* Provident Fund\n\n\n\nApplication Question(s):\n* ERPNext Implementation\n\nExperience:\n* total work: 2 years (Preferred)\n\nWork Location: In person",
        "Salary": "₹360,000 - ₹540,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=d4f2e0d1fb73f740",
        "JobType": [
            "Permanent",
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Python Developer Intern",
        "Company": "Kan Innovations Pvt Ltd",
        "Location": "Andheri, Mumbai, Maharashtra",
        "Description": "*Job Title: Python and AI and Data Analytics Intern*\n\nLocation: Mumbai\nJob Type: Full-time\nExperience: AI, Data Analytics, and Software Development or knowledge of it\n\n*\\*\\*Position Overview:\\*\\**\n\nWe are seeking a motivated and detail-oriented AI and Data Analytics Intern to assist in developing AI and LLM-based Retrieval-Augmented Generation (RAG) systems and intelligent agents. The goal is to create systems that provide accurate and meaningful support to customers on technical and medical matters. The intern will work with open-source Large Language Models (LLMs), workflow automation tools like n8n, and other AI-driven technologies. This role is ideal for individuals eager to gain hands-on experience in AI, machine learning, and data-driven solutions.\n\n---\n\n*\\*\\*Key Responsibilities: \\*\\**\n\n- Utilize workflow automation software like n8n to streamline processes.\n\n- Explore and implement task automation to enhance system efficiency.\n\n- Assist in building and optimizing AI and LLM-based RAG systems.\n\n- Integrate open-source LLM models for query-based retrieval and contextual response generation.\n\n- Help develop intelligent agents to assist customers on technical and medical topics.\n\n- Help program multi-agent systems capable of communicating effectively for complex tasks.\n\n- Handle structured and unstructured data to train and test AI models.\n\n- Develop APIs or pipelines for efficient data retrieval and processing.\n\n- Explore and experiment with open-source LLMs and frameworks.\n\n- Work closely with the team to understand project goals and requirements.\n\n- Participate in knowledge-sharing sessions to improve technical skills.\n\n---\n\n*\\*\\*Requirements:\\*\\**\n\n- \\*\\*Educational Background:\\*\\*\n\n- Recently completed a degree in Computer Science, Data Science, AI, or a related field.\n\n- and/or has done related projects as part of course or other internships\n\n- \\*\\*Technical Skills:\\*\\*\n\n- Familiarity with open-source LLMs and RAG methodologies.\n\n- Knowledge of neural networks, computer vision (CV) models, and machine learning fundamentals.\n\n- Experience with Python, TensorFlow, PyTorch, or similar frameworks is a plus.\n\n- Familiarity with APIs, JSON, and data formats like XML or CSV.\n\n*\\*\\*Soft Skills:\\*\\**\n\n- Quick learner with a proactive approach to problem-solving.\n\n- Strong analytical and communication skills.\n\n- Ability to work independently and collaboratively in a dynamic environment.\n\n*\\*\\*What We Offer:\\*\\**\n\n- Hands-on experience with cutting-edge AI and LLM technologies.\n\n- Mentorship and guidance from experienced professionals.\n\n- Opportunity to work on impactful projects in the technical and medical domains.\n\n- A collaborative and inclusive learning environment.\n\nThis internship is ideal for those who are passionate about AI and data analytics and eager to make meaningful contributions to real-world projects.\n\nJob Types: Full-time, Internship\n\nPay: ₹180,000.00 - ₹400,000.00 per year\n\nBenefits:\n* Cell phone reimbursement\n* Internet reimbursement\n* Provident Fund\n* Work from home\nLocation Type:\n* In-person\nSchedule:\n* Day shift\n\nWork Location: In person\n\n*Speak with the employer*\n+91 9321974284",
        "Salary": "₹180,000 - ₹400,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=4cd367d1f5f87082",
        "JobType": [
            "Full-time",
            "Internship"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "QR Wholesale Credit Data Engineer - Associate",
        "Company": "JPMorganChase",
        "Location": "Mumbai, Maharashtra",
        "Description": "JOB DESCRIPTION\n\nAre you looking for an exciting opportunity to join a dynamic and growing team in a fast paced and challenging area? This is a unique opportunity for you to work in our team to partner with the Business to provide a comprehensive view.\n\nAs a Quantitative Research Data Engineering Associate within our Wholesale Credit Data QR team, you will be part of a mission to design, analyze, and deliver firm-wide data to support the firm’s Wholesale Credit Stress (CCAR, ICAAP, Risk Appetite) and Loan loss reserves models. In this role, you will focus on data model definition, evolution of Data Dictionary to enable deep dive Data Analysis and Analytical explorations. You will work on the evolution of our frameworks, underlying data platforms and related tools to enhance ease of integration of pricing and forecast models, improve flexibility and extendibility of the framework as well as improve scalability and performance. This role will provide you with the opportunity to work with other experienced Wholesale Credit model developers and business partners, enhancing your quantitative as well as business skills.\n\nJob Responsibilities\n\nWork as data engineer, to create or build data pipeline, define API to source data from different systems, perform complex transformation or enhancements to data and optimize end to end run.\nWrite business requirements in the form of JIRA epics & user stories to develop data and system requirements for credit risk modelling platform\nPerform data analysis to support model development and analytics\nLiaise with various lines of business and risk modelers, thoroughly understand various models for BASEL, CCAR, CECL and other credit risk models\nWork with multiple stakeholders to elicit, analyze, refine and document business process and data requirements\nCollaborate through the entire Software Development Life Cycle (SDLC) including planning, analysis and testing of new applications and enhancements to existing applications\nPerform user acceptance testing and deliver demos to stakeholders by SQL queries or Python scripts\n\nRequired qualifications, capabilities, and skills\n\nBachelor’s or Master’s in Computer Science, Data Analytics or equivalent discipline. Experience of 3+ years in data engineering role in financial services, data analytics with focus on frameworks to handle large datasets and similar.\nData Analysis and data manipulation skills using SQL , Python, object orient programming & MS Excel is required. Strong analytical skills in forecasting and interpreting results and comfortable working with large quantities of data\nExperience on building data architecture to source data from different systems, handling complex transformation ad optimizing the end to end solution\nAbility to solve problems creatively while working in a dynamic and challenging environment under tight deadlines. Eagerness to learn about Credit Risk, Risk Parameters, Regulatory and Accounting concepts\nDetail oriented and strong organizational skills. Excellent communication abilities, both written and oral\nExperience implementing analytics frameworks in finance. Experience with source control, automated build/test systems, code coverage, unit testing and release processes\n\nPreferred qualifications, capabilities, and skills\n\nExperience in software engineering to build data architecture based on python, object orient programming, SQL etc. is preferable\nKnowledge of Wholesale Credit, CCAR, Allowance (IFRS 9/CECL), Basel II/III regulatory capital\nProven ability to develop collaborative relationships with key internal partners to achieve objectives and prioritizations\nABOUT US\n\nJPMorganChase, one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. We also make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as mental health or physical disability needs. Visit our FAQs for more information about requesting an accommodation.\n\nABOUT THE TEAM\n\nJ.P. Morgan’s Commercial & Investment Bank is a global leader across banking, markets, securities services and payments. Corporations, governments and institutions throughout the world entrust us with their business in more than 100 countries. The Commercial & Investment Bank provides strategic advice, raises capital, manages risk and extends liquidity in markets around the world.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=07ff2b4b6bd9b3df",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "Just posted"
    },
    {
        "JobTitle": "Lead-Quality Analyst(Remote)",
        "Company": "Nexifyr Consulting Pvt Ltd",
        "Location": "Mumbai, Maharashtra",
        "Description": "About Company :\nIt is a boutique software development company based out of India. We are a lean team of designers and developers fuelled by our love for new innovations and problem-solving products. By using design, data and technology, we help businesses build, grow and transform themselves.\nWe also take pride in filtering & training the top 5% of talent in developing nations to build efficient extended product development teams for growing startups and companies.\nAbout the Job :\nThis is a full time role for a Senior Quality Analyst. We are looking for a tester who is not just a tech expert but also passionate about building products. This role involves contributing to world class products, building scalable systems and mentoring junior testers. The job location is flexible with preference for the Delhi NCR region.\n\nResponsibilities :\n\nPerform hands-on testing, including manual and automated, to validate software functionality, performance, and reliability\n\nDesign, develop, and maintain test automation frameworks and scripts, ensuring efficiency and scalability in the testing process\n\nExecute all levels of testing, including unit, system, integration, regression, performance, and user acceptance testing\n\nAnalyze user stories, use cases, and system requirements for feasibility and test coverage\n\nPromote and implement best practices in quality assurance, test methodologies, and defect prevention across the team.\n\nDevelop and execute comprehensive testing strategies, plans, and schedules to support product releases and projects\n\nCollaborate closely with Product Managers, Developers, and other stakeholders to define quality standards and align testing efforts with project goals\n\nLead and mentor the QA team, providing technical guidance, fostering collaboration, and ensuring the delivery of high-quality software\nRequirements :\n\nBachelors or Masters degree in Computer Science or equivalent subjects\n\n5+ years of experience in software testing, with some experience of managing junior testers.\n\nExpertise in both manual and automated testing techniques, including designing and maintaining test automation frameworks\n\nProficiency with automation tools such as Selenium, Appium, or equivalent, and scripting languages like Python, Java, or JavaScript\n\nHands-on experience with test management tools (e.g., JIRA, Clickup).\n\nExcellent ability to analyze user stories, requirements, and use cases for test coverage and feasibility\n\nStrong knowledge of testing across multiple platforms (e.g., web, mobile, APIs, databases)\n\nExperience with performance testing tools such as JMeter, LoadRunner, or equivalent\n\nExceptional communication and collaboration skills to work effectively with cross-functional teams and stakeholders\n\nStrong attention to detail, organizational skills, and the ability to prioritize and multitask in a fast-paced environment\n\nBenefits :\n\nGenerous time-off policy, promoting a healthy work environment.\n\nFlexible work timings to promote work-life balance.\n\nComprehensive health insurance coverage.\n\nOpportunities for continuous learning and professional growth.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=39b94b2c5d826442",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "2 days ago"
    },
    {
        "JobTitle": "Python Full Stack Developer",
        "Company": "Upholic",
        "Location": "Majiwada, Thane, Maharashtra",
        "Description": "We are seeking a highly skilled *Software Developer* proficient in *Python* to join our dynamic team. The ideal candidate will be responsible for designing, developing, and maintaining software applications using Python. The role involves working on backend systems, APIs, and ensuring optimal performance and scalability.\n\n*Key Responsibilities:*\n* Develop, test, and maintain Python-based applications.\n* Design and implement APIs, databases, and microservices.\n* Collaborate with cross-functional teams to define and deliver software solutions.\n* Write clean, maintainable, and efficient code.\n* Debug and troubleshoot software issues, ensuring high code quality.\n* Stay up to date with the latest Python technologies and trends.\n\n*Required Skills:*\n* Proficiency in Python and frameworks like Django/Flask.\n* Experience with database management (SQL/NoSQL).\n* Strong understanding of algorithms and data structures.\n* Familiarity with version control systems (e.g., Git).\n* Problem-solving and debugging skills.\n\n*Qualifications:*\n* Bachelor’s degree in Computer Science or a related field.\n* Experience in software development with Python.\n* Self-developed projects\n\nJob Type: Full-time\n\nPay: ₹20,000.00 - ₹40,000.00 per month\n\nLocation Type:\n* In-person\nSchedule:\n* Day shift\n\n\n\nEducation:\n* Bachelor's (Preferred)\n\nExperience:\n* Software development: 2 years (Preferred)\n\nWork Location: In person",
        "Salary": "₹240,000 - ₹480,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=eb9182e2fc4afc11",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "2 days ago"
    },
    {
        "JobTitle": "Senior Solutions Architect",
        "Company": "MongoDB",
        "Location": "Mumbai, Maharashtra",
        "Description": "MongoDB's mission is to empower innovators to create, transform, and disrupt industries by unleashing the power of software and data. We enable organizations of all sizes to easily build, scale, and run modern applications by helping them modernize legacy workloads, embrace innovation, and unleash AI. Our industry-leading developer data platform, MongoDB Atlas, is the only globally distributed, multi-cloud database and is available in more than 115 regions across AWS, Google Cloud, and Microsoft Azure. Atlas allows customers to build and run applications anywhere—on premises, or across cloud providers. With offices worldwide and over 175,000 new developers signing up to use MongoDB every month, it's no wonder that leading organizations, like Samsung and Toyota, trust MongoDB to build next-generation, AI-powered applications.\n\nWe are looking for passionate technologists to join our Pre-Sales organization to ensure that our growth is grounded and guided by strong technical alignment with our platform and the needs of our customers.\n\nMongoDB Pre-Sales Solution Architects are responsible for guiding our customers and users to design and build reliable, scalable systems using our data platform. Our team is made up of seasoned technical sales professionals, software architects, entrepreneurs, and developers who take direct responsibility for customer success, including the design of their software, deployment, and operations. You'll work closely with our sales executives, helping customers solve business problems by leveraging our solutions, playing a key role in winning deals and driving the business forward. You'll be a trusted advisor to a wide range of users from startups to the world's largest enterprise IT organizations.\n\nWe are looking to speak to candidates who are based in Mumbai for our hybrid working model.\n\nAs an ideal candidate, you will have\nIdeally 8 - 11 years of related experience in a customer facing role, minimum 3 years of experience in pre-sales with enterprise software\nMinimum of 3 years experience with modern scripting languages (e.g. Python, Node.js, SQL) and/or popular programming languages (e.g. C/C++, Java, C#) in a professional capacity\nExperience designing with scalable and highly available distributed systems in the cloud and on-prem\nDemonstrated ability to work with customers to review complex architecture of existing applications, providing guidance on how to improve by leveraging technology\nExcellent presentation, communication, and interpersonal skills, with the ability to convey complex technical and business concepts in a clear and compelling manner to technology and business leadership\nAbility to strategize with sales teams and provide recommendations on how to drive a multi-threaded account strategy, aligning other MongoDB and ecosystem resources to move towards a mutually beneficial account plan\nThe ability to travel up to 25%\nA Bachelor's degree or equivalent work experience\nYou may also have\nExperience selling databases and/or deploying applications with any of the major cloud providers\nExperience with database programming and data models\nExperience in data engineering or AI/ML projects\nExperience in transforming legacy systems and platforms into modern, scalable, and efficient technology stacks\nUnderstanding of popular sales methodologies/ frameworks such as MEDDPICC/ Command of the Message\nA MongoDB Certification\nA Cloud Provider Certification\nWhat you do at MongoDB\n\nIn this role, you will work on complex opportunities where analysis of situations or data requires an in-depth evaluation of various factors. You will\n\nDesign and Architect: Design scalable and performant applications, systems and infrastructure for large software projects leveraging MongoDB\nCustomer Advising and Value Articulation: Guide customers on architecture patterns and optimisation strategies for MongoDB, while clearly communicating its business value to the relevant stakeholders\nSales Partnership: Collaborate with the sales team to drive account success through account planning, opportunity prioritization/qualification and pipeline generation strategy, while taking ownership of the technical aspects (including but not limited to technical discovery, demos, proof of value, presentations, sizing and documentation)\nDemand Generation: Proactively generate demand within the sales territory through self-driven technical initiatives, participation in events such as industry trade shows and account-based marketing events\nCustomer Success: Foster strong customer relationships, build champions and ensure customer success and satisfaction\nInnovation and Improvement: Continuously seek opportunities to innovate and improve MongoDB solutions and processes (e.g. by relaying field feedback to the product team), as well as proactively mentor other Solutions Consulting team members\nPersonal Training and Development: Engage in ongoing training and professional development to stay abreast of MongoDB product suite as well as industry trends\nWhat you will learn\nMongoDB Product Suite Mastery\nCore Database Server: Master the fundamentals and advanced features of MongoDB's core database\nAtlas and Advanced Services: Gain expertise in Atlas (fully managed cloud database service), Atlas Stream Processing, Atlas Data Lake, Atlas Full-Text Search, Atlas Vector Search, and Charts\nRelational Migrator: Learn to migrate from relational databases seamlessly\nMarket-Relevant Technologies\nHyperscaler Ecosystem: Gain expertise in designing complex systems utilizing cloud services on hyperscaler platforms\nComplementary Technologies: Enhance your skills with partner and complementary technologies such as Apache Kafka and Kubernetes\nModern Architecture Design\nDesign Patterns and Methodologies: Embrace best practices in microservices, DevOps, cloud, and security\nCutting Edge RAG and AI Architectures: Help customers on their generative AI journeys and working with industry leading partners in the space\nSales Techniques and Soft Skills\nEffective Communication: Master presentations, demonstrations, and whiteboarding\nClient Interaction: Develop strategies for discovery and objection handling\nIndustry Insights\nDiverse Market Verticals: Gain exposure to a broad spectrum of interesting use cases across various industries\n\nTo drive the personal growth and business impact of our employees, we're committed to developing a supportive and enriching culture for everyone. From employee affinity groups, to fertility assistance and a generous parental leave policy, we value our employees' wellbeing and want to support them along every step of their professional and personal journeys. Learn more about what it's like to work at MongoDB, and help us make an impact on the world!\n\nMongoDB is committed to providing any necessary accommodations for individuals with disabilities within our application and interview process. To request an accommodation due to a disability, please inform your recruiter.\n\nMongoDB is an equal opportunities employer.\n\nReq ID - 425132",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=275f356fa7c98237",
        "JobType": [],
        "PostedDate": "2 days ago"
    },
    {
        "JobTitle": "Sr. Associate - Projects",
        "Company": "Cognizant",
        "Location": "Mumbai, Maharashtra",
        "Description": "Job Summary\n\nWe are seeking a Sr. Developer with 6 to 9 years of experience to join our team as a Sr. Associate - Projects. The ideal candidate will have strong technical skills in PL/SQL Oracle and Python with additional experience in Oracle Forms Shell scripting and 3NF data modeling. This role involves developing and maintaining high-quality software solutions that align with our business goals.\n\nResponsibilities\n\nDevelop and maintain high-quality software solutions using PL/SQL Oracle and Python.\nCollaborate with cross-functional teams to gather and analyze requirements.\nDesign and implement efficient database structures in 3NF data modeling.\nUtilize Oracle Forms and Shell scripting to enhance application functionality.\nEnsure data integrity and optimize performance through effective RDBMS management.\nImplement and manage scheduling basics for automated tasks.\nUse Oracle SQL Loader for data import and export tasks.\nConduct code reviews and provide constructive feedback to team members.\nTroubleshoot and resolve complex technical issues in a timely manner.\nParticipate in the full software development lifecycle from design to deployment.\nMaintain up-to-date knowledge of industry trends and technologies.\nProvide technical guidance and mentorship to junior developers.\nCollaborate with stakeholders to ensure project alignment with business objectives.\n\nQualifications\n\nPossess strong technical skills in PL/SQL Oracle and Python.\nHave experience with Oracle Forms and Shell scripting.\nDemonstrate proficiency in 3NF data modeling and RDBMS management.\nBe familiar with scheduling basics and Oracle SQL Loader.\nNice to have domain experience in Cards & Payments.\nShow excellent problem-solving and analytical skills.\nExhibit strong communication and teamwork abilities.\nBe committed to continuous learning and professional development.\n\nCertifications Required\n\nORACLE CERTIFIED PROFESSIONAL PYTHON INSTITUTE CERTIFICATION",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=7315fc74d931a265",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "2 days ago"
    },
    {
        "JobTitle": "Data Scientist - Sr Associate",
        "Company": "JPMorganChase",
        "Location": "Mumbai, Maharashtra",
        "Description": "JOB DESCRIPTION\n\nYou are a strategic thinker passionate about driving solutions in Data Science and LLM developer. You have found the right team.\n\nAs a Data Science and LLM developer – Sr Associate in our MIS and Platforms team , you will spend each day defining, refining and delivering set goals for our firm.\n\nJob Responsibilities:\n\nImplement various exploratory data analysis techniques . Analyze for Trends and Patterns .\nIdentify key data sources that can make business impacts.\nScope, prioritize and co-ordinate activities with the product owners. Partner with product teams to identify strategic solutions.\nDesign and develop datamining queries from large data sets (Both Structured and Unstructured) . Experienced in conversion of data into information.\nProficient in Visualization and story telling which can make an impact to the business .\nEmploys scalable automation solutions for faster and robust data preparation\nTransform model outputs into formats that is understandable to the end users through visualization, clear tables, and/or thoughtful presentations. Assist technical and non-technical end users in how to leverage and interpret the analysis.\n\nRequired qualifications, capabilities and skills\n\nSelf-starter, attention to details and results orientated, able to work under minimal guidance.\nUses pertinent data and facts to identify and solve a range of problems within area of expertise.\nHaving mandatory experience in Statistics along with Exploratory and regression data analysis\nStrong proficiency in LLM, embedding, concept of vectorization/ vector stores, database optimization, performance tuning,and relevant query languages.\nFamiliarity with embedding, retrieval algorithms, RAG based agents, data modelling for vector development graphs.\nExperience with LLM and other related frameworks like Langchain, LLamaIndex,AutoGen, ReAct\nExperience in model development using Machine Learning techniques [Data Analysis /Model Tuning}.\nPreferred data querying skills on SQL (Snowflake, Databricks) and , Python (packages and libraries like Scikit , Kera’s, Pandas, PySpark/PySQL)\nBachelor’s Degree in, Data science Computer Science, or Engineering. Different field of study, with significant professional experience in Analytics and BI development, is acceptable.\nExperience Required: Minimum 8 years in Data related projects and minimum 3 years in Data Science\nGood communication and analytical skills\n\nPreferred qualifications, capabilities and skills\n\nSSIS/Alteryx exposure for complex ETL development is an added advantage..\nABOUT US\n\nJPMorganChase, one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. We also make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as mental health or physical disability needs. Visit our FAQs for more information about requesting an accommodation.\n\nABOUT THE TEAM\n\nJ.P. Morgan Asset & Wealth Management delivers industry-leading investment management and private banking solutions. Asset Management provides individuals, advisors and institutions with strategies and expertise that span the full spectrum of asset classes through our global network of investment professionals. Wealth Management helps individuals, families and foundations take a more intentional approach to their wealth or finances to better define, focus and realize their goals.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=cb4fe46d86afd0f3",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "2 days ago"
    },
    {
        "JobTitle": "Infrastructure Specialist",
        "Company": "Kyndryl",
        "Location": "Mumbai, Maharashtra",
        "Description": "Who We Are\n\nAt Kyndryl, we design, build, manage and modernize the mission-critical technology systems that the world depends on every day. So why work at Kyndryl? We are always moving forward – always pushing ourselves to go further in our efforts to build a more equitable, inclusive world for our employees, our customers and our communities.\n\nThe Role\n\nAre you passionate about solving complex problems? Do you thrive in a fast-paced environment? Then there’s a good chance you will love being a part of our Software Engineering – Development team at Kyndryl, where you will be able to see the immediate value of your work.\n\nAs a Software Engineering - Developer at Kyndryl, you will be at the forefront of designing, developing, and implementing cutting-edge software solutions. Your work will play a critical role in our business offering, your code will deliver value to our customers faster than ever before, and your attention to detail and commitment to quality will be critical in ensuring the success of our products.\n\nUsing design documentation and functional programming specifications, you will be responsible for implementing identified components. You will ensure that implemented components are appropriately documented, unit-tested, and ready for integration into the final product. You will have the opportunity to architect the solution, test the code, and deploy and build a CI/CD pipeline for it.\n\nAs a valued member of our team, you will provide work estimates for assigned development work, and guide features, functional objectives, or technologies being built for interested parties. Your contributions will have a significant impact on our products' success, and you will be part of a team that is passionate about innovation, creativity, and excellence. Above all else, you will have the freedom to drive innovation and take ownership of your work while honing your problem-solving, collaboration, and automation skills. Together, we can make a difference in the world of cloud-based managed services.\n\nYour Future at Kyndryl\nThe career path ahead is full of exciting opportunities to grow and advance within the job family. With dedication and hard work, you can climb the ladder to higher bands, achieving coveted positions such as Principal Engineer or Vice President of Software. These roles not only offer the chance to inspire and innovate, but also bring with them a sense of pride and accomplishment for having reached the pinnacle of your career in the software industry.\n\nWho You Are\n\nYou’re good at what you do and possess the required experience to prove it. However, equally as important – you have a growth mindset; keen to drive your own personal and professional development. You are customer-focused – someone who prioritizes customer success in their work. And finally, you’re open and borderless – naturally inclusive in how you work with others.\n\nRequired Technical and Professional Experience\n\n4-7 years of experience working as a software engineer on complex software projects.\nExcellent coding skills and solid development experience (Java, Python, .Net etc.) with debugging and problem-solving skills.\nSoftware development methodologies, with demonstrated experience developing scalable and robust software.\nExperienced in relational and NoSQL databases, data mapping, XML/JSON, Rest based web services.\nKnowledge of architecture design - Microservices architecture, containers (Docker & k8s), messaging queues.\nDeep understanding of OOP and Design patterns.\n\nPreferred Technical and Professional Experience\n\nBachelor's degree in computer science, related technical field, or equivalent practical experience.\nCertification in one or more of the hyperscale's (Azure, AWS, and Google GCP) - otherwise, you can obtain certifications with Kyndryl.\nExperience with DevOps tools and modern engineering practices.\n\nBeing You\n\nDiversity is a whole lot more than what we look like or where we come from, it’s how we think and who we are. We welcome people of all cultures, backgrounds, and experiences. But we’re not doing it single-handily: Our Kyndryl Inclusion Networks are only one of many ways we create a workplace where all Kyndryls can find and provide support and advice. This dedication to welcoming everyone into our company means that Kyndryl gives you – and everyone next to you – the ability to bring your whole self to work, individually and collectively, and support the activation of our equitable culture. That’s the Kyndryl Way.\n\nWhat You Can Expect\n\nWith state-of-the-art resources and Fortune 100 clients, every day is an opportunity to innovate, build new capabilities, new relationships, new processes, and new value. Kyndryl cares about your well-being and prides itself on offering benefits that give you choice, reflect the diversity of our employees and support you and your family through the moments that matter – wherever you are in your life journey. Our employee learning programs give you access to the best learning in the industry to receive certifications, including Microsoft, Google, Amazon, Skillsoft, and many more. Through our company-wide volunteering and giving platform, you can donate, start fundraisers, volunteer, and search over 2 million non-profit organizations. At Kyndryl, we invest heavily in you, we want you to succeed so that together, we will all succeed.\n\nGet Referred!\n\nIf you know someone that works at Kyndryl, when asked ‘How Did You Hear About Us’ during the application process, select ‘Employee Referral’ and enter your contact's Kyndryl email address.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=2b9e99644eabc28e",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "2 days ago"
    },
    {
        "JobTitle": "Sr. Python Developer",
        "Company": "CALLISTOFUSION",
        "Location": "Mumbai, Maharashtra",
        "Description": "Hi,\n\nWe have a 6 plus months contract role for *Sr. Python Developer* for location *Mumbai *\n\n\n\n*Position:- Sr. Python Developer *\n\nLocation: Mumbai\n\nDuration: 12+ Months Contract\n\nWorking Hours: Day Shift (9-6)\n\n*Experience :- 8-10 years *\n\n\n\n*Job Summary:*\n\n\n\n*We are seeking a skilled and motivated Python Developer to join our team. The ideal candidate will be responsible for developing, testing, and maintaining scalable Python applications. They should have a strong understanding of Python programming, frameworks, and libraries, along with experience in back-end development, data processing, and API integration.*\n\n\n\n*Key Responsibilities:*\n* Develop, test, and maintain high-quality Python applications.\n* Write reusable, efficient, and scalable code.\n* Collaborate with cross-functional teams to define and implement software solutions.\n* Integrate third-party services, APIs, and databases.\n* Troubleshoot and debug applications to optimize performance.\n* Implement security and data protection solutions.\n* Stay updated with the latest industry trends, technologies, and best practices.\n*\n\n*Required Skills & Qualifications:*\n* Bachelor's degree in Computer Science, Engineering, or a related field.\n* Proven experience as a Python Developer or in a similar role.\n* Strong proficiency in Python and familiarity with frameworks such as Django or Flask.\n* Experience with databases (SQL, PostgreSQL, MongoDB, etc.).\n* Knowledge of front-end technologies (JavaScript, HTML, CSS) is a plus.\n* Familiarity with version control systems like Git.\n* Experience with cloud platforms (AWS, Azure, GCP) is a plus.\n* Excellent problem-solving and analytical skills.\n* Ability to work independently and in a team-oriented environment.\n\nJob Type: Contractual / Temporary\nContract length: 12 months\n\nPay: ₹1,000,000.00 - ₹1,500,000.00 per year\n\nBenefits:\n* Health insurance\nLocation Type:\n* In-person\n\n\n\nApplication Question(s):\n* Hi,\nPlease submit the following details with an updated word format resume so that we can submit your profile.\n\nFull Name (As per Passport: - --------------\nTotal Experience: -----------------------\nCurrent Salary P.A ------------------\nExpected Annual Salary: ------\nContact Number: -------------------\nBest time to call:---\nEmail Address: -----------------\nCurrent City/ State: -------------------\nLinkedIn Profile(Y/N), IF (Y) then provide link……………………..\nNotice Period: ---------------------\n\nExperience:\n* Python: 7 years (Preferred)\n\nWork Location: In person\n\n*Speak with the employer*\n+91 6092493855",
        "Salary": "₹1,000,000 - ₹1,500,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=14097232cda4af2d",
        "JobType": [
            "Contractual / Temporary"
        ],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Senior DataStage Developer",
        "Company": "Sodo",
        "Location": "Mumbai, Maharashtra",
        "Description": "DataStage, Python, SQL, API, AWS, Unix\n\n\n\nTitle: Data Engineer\n\nJob Type: Full-Time\n\nAbout the Role: We are seeking a highly skilled Data Engineer to join our team. The successful candidate will be responsible for supporting batch jobs for the MTS Team, managing and troubleshooting Datastage and Python job failures, handling new tasks in Datastage, Python, and AWS, researching Remedy Incidents, monitoring Brinqa scores, and following up with admins. Additionally, they will upgrade Datastage and Python jobs and perform monthly updates on Spectrum and Verimove DB files.\n\n\n\nKey Responsibilities:\n\n• Support batch jobs for the MTS Team.• Manage and troubleshoot Datastage and Python job failures.• Handle new tasks in Datastage, Python, and AWS.• Research and resolve Remedy Incidents.• Monitor Brinqa scores and follow up with admins.• Upgrade Datastage and Python jobs.• Perform monthly updates on Spectrum and Verimove DB files.\n\n\n\nRequired Qualifications:\n\n• High-level proficiency in Datastage and SQL.• Strong experience with SQL, Unix, Datastage, Python, and API.• Ability to manage and troubleshoot job failures effectively.• Experience in handling new tasks in Datastage, Python, and AWS.\n\n\n\nPreferred Qualifications:\n\n• Experience with PLSQL, AWS (RDS, React, Glue, API), XML, and Facets.• Strong problem-solving skills and attention to detail.• Excellent communication and teamwork skills.\n\n\n\nTechnologies:\n\n• Datastage: High-level proficiency required.• SQL: High-level proficiency required.• Unix, Python, API: Strong experience required.• AWS (RDS, React, Glue, API), XML, Facets: Preferred experience.\n\nJob Type: Full-time\n\nPay: Up to ₹2,700,000.00 per year\n\nSchedule:\n* Day shift\n\n\n\nEducation:\n* Bachelor's (Required)\n\nExperience:\n* DataStage: 5 years (Required)\n* Python: 4 years (Required)\n* AWS: 3 years (Required)\n* SQL: 4 years (Required)\n* UNIX: 2 years (Required)\n\nWork Location: In person\n\n\nExpected Start Date: 12/02/2025",
        "Salary": "₹2,700,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=1dff969909f4fbdc",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "1 day ago"
    },
    {
        "JobTitle": "Senior Python Developer",
        "Company": "Logicloop Ventures LLP",
        "Location": "Mumbai, Maharashtra",
        "Description": "Specific skills required\n\nMinimum 7 years of experience within this field.\n\nExpert in the below field/technology:\n\nHands-on experience in Python\n\nGood experience in libraries like Pandas, NumPy, SQLAlchemy, and Matplotlib for data processing\n\nGood understanding of VB.Net/C#.Net\n\nSkilled in data modeling and data analysis\n\nExperience with data pipeline creation using REST API, Python, SSIS, and shell scripting\n\nGood understanding of JSON files to explode in Python\n\nData modeling (Understand the data structure, model the data for enterprise use)\n\nMicrosoft SQL Server 2017 and above and query language\n\nDatabase views and complex joins\n\nConcepts like Star & Snowflake schema, Fact & Dimensions, OLTP/OLAP\n\nProficient in Power BI apps and workspaces\n\nKnowledge in the below area is an advantage:\n\nWorking in Agile/Scrum framework\n\nShell scripting\n\nYou are responsible for understanding the existing data structure and tables.\n\nUsing Python to manipulate the data and cleanse it for ease of use.\n\nRead data from REST API using Python and create a data pipeline and schedule them to ingest the data into SQL Server tables.\n\nYou are also expected to troubleshoot the publishing web and Windows applications.\n\nAnalyze the data based on use cases for bringing business value like predictive and proactive service management.\n\nJob Type: Permanent\n\nPay: ₹1,000,000.00 - ₹1,700,000.00 per year\n\nWork Location: In person",
        "Salary": "₹1,000,000 - ₹1,700,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=d281a8e9925372ce",
        "JobType": [
            "Permanent"
        ],
        "PostedDate": "5 days ago"
    },
    {
        "JobTitle": "Full Stack Developer",
        "Company": "Bitkraft Technologies LLP",
        "Location": "Fort, Mumbai, Maharashtra",
        "Description": "*Summary*\n\nBitkraft Technologies LLP is looking for Full-stack Engineers to join our software engineering team. You will be working across the stack on cutting edge web development projects for our custom services business.\n\nAs a Full-stack Engineer, you should be comfortable with front-end and back-end technologies, well versed with popular frameworks and third-party libraries. It is essential that you are passionate about good user experience - a keen eye for quality visual design would be a plus!\n\nIf you love solving problems, are a team player and want to work in a fast paced environment with core technical and business challenges, we would like to meet you.\n\n*Essential Skills*\n\nFrontend - Experience working with at least two of the below at an intermediate to expert level\n\n● Mandatory: JavaScript, HTML5 and CSS\n\n● React\n\nBackend - Experience working with at least one of the below at an intermediate to expert level\n\n● Mandatory : Python\n\n● Python (Django/Flask/Jupyter Notebook)\n\nDatabases - Experience working with at least one of the below at an intermediate to expert level\n\n● MySQL\n\n● Postgresql\n\n● MongoDB\n\n● Graph Databases\n\n● Oracle\n\nCloud Infrastructure - Experience working with at least one of the below at an intermediate to expert level\n\n● AWS\n\n● Azure\n\n● Google Cloud / Firebase\n\nOther Essential Skills / Requirements\n\n● Great attention to detail\n\n● Experience in working in Agile projects - with familiarity with tools such Jira\n\n● Ready to work on technologies, platforms and frameworks as required on future projects ● Strong work ethic and commitment to meet deadlines and support team members meet goals\n\n● Be flexible with working across time zones with overseas customers if required\n\n*Desirable Skills *\n\nMobile Technologies - Knowledge of at least one of the following\n\n● Native Android\n\n● Native iOS\n\n● Hybrid Mobile App Development – Ionic/Flutter/React Native\n\nKey Responsibilities\n\n● Gathering & understanding client requirements and providing technical solutions to business needs\n\n● Ability to resolve business problems through technology\n\n● Deliver work within timelines and quality specifications\n\n● Strive to develop reusable code\n\n● Respond to technical queries from clients, management and team members\n\n● Evaluating existing technical architecture and recommended improvements\n\n● Work with development teams and product managers to ideate software solutions\n\n● Design client-side and server-side architecture\n\n● Build responsive UX/UI\n\n● Develop and manage well-functioning databases and applications\n\n● Ability to write REST API’s\n\n● Perform unit testing and scenario based testing to build robust systems\n\n● Troubleshoot, debug and update existing applications\n\n● Create security and data protection mechanisms to ensure application security\n\n● Create technical documentation, flow diagrams, use-case diagrams, charts as required\n\n● Communicate with team members and clients for efficient project functioning\n\n● Staying abreast of latest developments in web technologies and related programming languages/frameworks\n\nExperience 2 - 5 years\n\nJob Location Fort, Mumbai\n\n*Why join Bitkraft?*\n\n● Your inputs and opinions are valued\n\n● Exposure to latest technologies\n\n● Working directly with client teams\n\n● International project experience\n\n● You get to see the big picture on the project\n\n● Fast paced environment with quick project completions\n\n● Manage your own time for efficient working\n\n● A friendly and easy going work environment\n\n*About Bitkraft Technologies LLP*\n\nBitkraft Technologies LLP is an award winning Software Engineering Consultancy focused on Enterprise Software Solutions, Mobile Apps Development, ML/AI Solution Engineering, Extended Reality, Managed Cloud Services and Technology Skill-sourcing, with an extraordinary track record. We are driven by technology and push the limits of what can be done to realise the business needs of our customers. Our team is committed towards delivering products of the highest standards and we take pride in creating robust user-driven solutions that meet business needs. Bitkraft boasts of clients across over 10+ countries including US, UK, UAE, Oman, Australia and India to name a few. To know more about Bitkraft visit our website bitkraft.co.in\n\nJob Types: Full-time, Permanent\n\nPay: ₹500,000.00 - ₹1,500,000.00 per year\n\nBenefits:\n* Paid time off\nSchedule:\n* Day shift\n\n\n\nApplication Question(s):\n* In how many days you can join the company?\n* Do you stay in Mumbai?\n\nExperience:\n* React: 2 years (Required)\n* total work: 2 years (Required)\n* Python: 2 years (Required)\n\nWork Location: In person",
        "Salary": "₹500,000 - ₹1,500,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=f554b7a20305bbaa",
        "JobType": [
            "Permanent",
            "Full-time"
        ],
        "PostedDate": "5 days ago"
    },
    {
        "JobTitle": "Developer - Smart Automation (1 year Contract)",
        "Company": "Clariant",
        "Location": "Airoli, Navi Mumbai, Maharashtra",
        "Description": "Job ID: 39646 | Location: Airoli, Maharashtra, India\n\nClariant is a Swiss-based global specialty chemicals company, which is concentrated and developed in three business units: Care Chemicals, Catalysts and Adsorbents & Additives. Our purpose as a company is reflected in our tagline \"Greater chemistry - between people and planet\", which considers the principles of customer, innovation and people orientation, as well as a focus on creating solutions to foster sustainability in different industries by offering high-value and high-performance chemical specialties.\n\nAt Clariant, we believe that diversity, equity and inclusion are essential to our success. We strive to cultivate a workplace where all employees feel welcomed, respected, supported, and valued. Our diverse workforce allows us to tap into a wealth of perspectives, experiences, and capabilities that drive innovation. We are committed to ensuring equal opportunities for professional growth and advancement across all levels of the organization, based on objective criteria and regardless of gender, gender identity, race, ethnicity, religion, protected veteran status ,age, disability, sexual orientation or other aspects of diversity in accordance with the relevant governing laws. By bringing together talented individuals with diverse backgrounds and viewpoints, we gain the agility to meet the evolving needs of our global customers and communities. Join our team to help advance our mission of fostering a culture of belonging where everyone can thrive.\n\nThe job focuses on leading and executing complex automation projects using various smart automation tools and technologies such as Robotic Process Automation (RPA), Artificial Intelligence (AI)/ Machine Learning (ML), Natural Language Processing (NLP), and Optical Character Recognition (OCR). The role involves collaborating with solution architects, performing code reviews, ensuring compliance with standards, and optimizing automated processes. It plays a crucial part in providing technical leadership, identifying skill gaps, and recommending innovative automation solutions to meet evolving business needs.\n\nResponsibilities\n\nLead and execute complex Smart Automation projects\nCollaborate with solution architects on scalability and maintainability\nPerform code reviews, unit testing, and maintain quality standards\nEnsure compliance with industry standards, regulations, and security protocols\nLead project planning, estimation, and execution\nIdentify potential risks associated with automation projects\nWork closely with cross-functional teams for seamless project execution\nIdentify skill gaps and provide mentorship/coaching to team members\nCoordinate with various stakeholders (business leaders, analysts, Information Technology teams)\nIdentify and recommend innovative automation solutions, tools, and technologies\n\nRequirements\n\nAt least a Bachelor’s degree in Information Technology/Engineering or a related field\n4+ years of hands-on development experience in Smart Automation tools & technologies\nExpertise in Smart Automation tools & technologies – Robotic Process Automation (RPA), Artificial Intelligence (AI)/ Machine Learning (ML), Natural Language Processing (NLP), and Optical Character Recognition (OCR)\nStrong programming skills in languages such as Python, Java, or .NET\nVery good communication and interpersonal abilities\nProject management certifications will be preferred (e.g., Project Management Professional (PMP), Projects IN Controlled Environments (PRINCE2)\nTechnical skills in Infrastructure, Data Management, Databases, DevOps will be a good addition to have\nExperience in contributing to knowledge-sharing platforms, presentations, or training sessions is preferred\n\nOur Offer\n\nCompany Culture\n\nBe part of an amazing team, who will be there to support you. A forward-looking company, with a culture of innovation and a strong portfolio in sustainable technologies. Ongoing Professional Development Opportunities Inclusive Work Environment\nApproachable Leadership\nLong-term growth opportunity\nWork-Life Balance\nSpeak Up Culture\nWomen's Inclusion Network of Clariant (WIN)\n\nBenefits\n\nHybrid Work Model- 3 days in office and 2 days remote\nChild Day Care facility fully sponsored by Clariant In-house Cafeteria & Subsidized meals\n30 Days Annual Paid Leaves\nClariant-Sponsored Annual Health Check-Up\nCentralized Company Transport for Designated Routes (Regular shift)\nEmployee Wellbeing & Assistance Program\nGroup Medical Insurance, Group Personal Accident Insurance and Life Insurance\nMaternity & Parental leave policies\nPerformance-Based Competitive Annual Bonus Plan\n\nYour Contact\nAdelaide D'Mello\nadelaide.dmello@clariant.com",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=aa440b4f4782c56e",
        "JobType": [],
        "PostedDate": "5 days ago"
    },
    {
        "JobTitle": "Senior Full stack Developer",
        "Company": "Unity Jewels",
        "Location": "Andheri, Mumbai, Maharashtra",
        "Description": "*What You’ll Do:*\n* Build and maintain web applications using React to deliver an exceptional user experience.\n* Write clean, well-structured code for APIs using Python, preferably with Flask or FastAPI.\n* Work closely with UI/UX designers to ensure the website looks and functions as intended.\n* Use state management tools like Redux or Context API to manage complex application state.\n* Collaborate with other teams to understand project requirements and contribute to solution development.\n* Troubleshoot and resolve issues while continuously optimizing the performance of existing applications.\n* Ensure the web applications are optimized for speed and responsiveness across all devices.\n\n*What You Need to Know:*\n* *React:* You should be comfortable with React and related tools like Redux and React Router.\n* *Python API Development:* You should know how to build APIs with Python, with a preference for Flask or FastAPI.\n* *JavaScript & Web:* You should be skilled with JavaScript (including ES6+), HTML, CSS, and other web technologies.\n* *Version Control:* You should be familiar with Git for source control and collaborative development.\n* *Databases:* Understanding of SQL or NoSQL databases, such as PostgreSQL or MongoDB, is a plus.\n* *Problem Solving:* You should be able to debug and resolve issues independently.\n* *Teamwork:* You should be able to work well with others, communicate effectively, and collaborate across teams.\n\n*Nice to Have:*\n* Experience with testing frameworks (e.g., Jest, Mocha) to ensure application quality.\n* Familiarity with cloud platforms (AWS, Azure) and setting up deployment pipelines.\n* Knowledge of web security best practices and performance optimization techniques.\n\n*Qualifications:*\n* *Educational Background:* A bachelor’s degree in Information Technology (BSIT), Master’s in Computer Science (MScIT), Bachelor’s in Computer Applications (BCA), or Master’s in Computer Applications (MCA), with a minimum of 60% marks or equivalent.\n* *Experience:*\n* *Senior Developer:* 7+ years of hands-on experience in front-end development with React and back-end API development using Python\n* *Communication Skills:* Excellent written and verbal communication skills in English, enabling effective interaction within the team and with stakeholders.\n\n*Why Join Us?*\nWe offer a dynamic work environment that fosters innovation and growth. You will be part of a talented team that values collaboration and continuous improvement, with opportunities for career development in a fast-paced, technology-driven industry.\n\nJob Types: Full-time, Permanent\n\nPay: ₹600,000.00 - ₹2,002,879.83 per year\n\nBenefits:\n* Provident Fund\nLocation Type:\n* In-person\nSchedule:\n* Morning shift\n\n\n\nEducation:\n* Bachelor's (Preferred)\n\nExperience:\n* Angular: 1 year (Preferred)\n* total work: 1 year (Preferred)\n* Java: 1 year (Preferred)\n\nWork Location: In person",
        "Salary": "₹600,000 - ₹2,002,880 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=f1c38f3d902a9623",
        "JobType": [
            "Permanent",
            "Full-time"
        ],
        "PostedDate": "4 days ago"
    },
    {
        "JobTitle": "Full Stack Developer",
        "Company": "Opt4Solution Private Limited",
        "Location": "Jogeshwari East, Mumbai, Maharashtra",
        "Description": "Job Description-\n\n*Job Title: Senior Full Stack Developer (Dot Net)*\n\n*Department: IT*\n\n*Location: Head Office (HO) Mumbai *\n\n\n\n*Qualification: Bachelor’s degree in Computer Science, Information Technology, or a related field*\n\n\n\n*Salary: Upto 11 LPA*\n\n*Experience:*\n\n- 5 to 10+ years of experience in full stack web development, API development and integration, database design, and DevOps.\n\n- Proven expertise in building scalable, maintainable software systems with a deep understanding of both front-end and back-end technologies.\n\n\n\n*Key Responsibilities:*\n\n1. Lead the development of software applications, including the design, coding, testing, and debugging of both front-end and back-end components. Ensure that the code is of high quality, scalable, and maintainable.\n\n2. Collaborate with cross-functional teams—designers, testers, product managers, and stakeholders—to gather requirements and provide technical insights and recommendations. Communicate project progress, challenges, and solutions effectively.\n\n3. Analyze complex technical issues, identify root causes, and implement solutions. Conduct code reviews, debug code, and offer technical support to resolve issues during development.\n\n4. Conduct thorough testing, including unit, integration, and performance testing, to ensure the quality and reliability of software applications. Collaborate with testers to address bugs and improve application quality.\n\n5. Work closely with project managers to define project timelines, prioritize tasks, and deliver projects on time. Provide accurate development estimates and proactively communicate potential delays or risks.\n\n6. Create and maintain detailed technical documentation, such as system architecture diagrams, API documentation, and code documentation. Ensure project requirements, specifications, and guidelines are documented clearly for team understanding and knowledge transfer.\n\n7. Utilize collaboration tools, version control systems, and project management tools to support efficient communication and teamwork. Follow development processes and agile methodologies to ensure consistency and efficiency.\n\n8. A working knowledge of Python is a plus and will be an advantage in day-to-day development.\n\n*Technical Skills:*\n\n- Proficiency in web application development, mobile applications, and fintech applications.\n\n- Strong knowledge of SQL and database management.\n\n- Familiarity with DevOps, Continuous Integration/Deployment processes.\n\n- Certifications in relevant fields such as Azure Developer Associate, Certified Scrum Developer, or Certified Full Stack Developer are preferred.\n\n*Behavioral Skills: *\n\n- Strong communication, leadership, and collaboration skills.\n\n- Ability to manage stakeholders and drive team performance.\n\n- Exceptional problem-solving and critical thinking abilities.\n\n- Excellent time management skills with the ability to prioritize tasks and work on multiple assignments simultaneously.\n\n- Ability to work effectively in time-bound and result-oriented environments.\n\nJob Type: Full-time\n\nPay: ₹600,000.00 - ₹1,100,000.00 per year\n\nSchedule:\n* Day shift\n\n\n\nEducation:\n* Bachelor's (Required)\n\nExperience:\n* Azure: 2 years (Preferred)\n* Full-stack development: 6 years (Preferred)\n* SQL: 6 years (Preferred)\n* DevOps: 2 years (Preferred)\n\nWork Location: In person",
        "Salary": "₹600,000 - ₹1,100,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=476a028f121b04e9",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "5 days ago"
    },
    {
        "JobTitle": "Python Developer",
        "Company": "QuantInsti Quantitative Learning",
        "Location": "Mumbai, Maharashtra",
        "Description": "About the Position:\n\nWe are looking for a passionate and experienced software engineer to join our team at Mumbai (option given for remote working/WFH). In this role, your primary responsibilities will be to take ownership of developing low/mid frequency algorithmic trading engine, related data and microservices.\n\nWhat you will do at QI?\n\n1. Work on core low frequency algo trading engine (CEP engine).\n\n2. Enhance existing or develop new microservices.\n\n3. Design and develop data ingestion systems for different data sources and data types.\n\n4. Optimize applications for performance and latency.\n\n5. Build reusable codes and libraries. Contribute to open-source projects.\n\n6. Stay up to date with new technologies with an eye of constantly adapting and improving our systems and methods.\n\nBasic Job Requirements\n\n1. More than 2 years’ work experience in a similar role.\n\n2. Strong experience in developing python based large scale OO systems (not just scripting).\n\n3. Excellent concepts and command over Python and exposure to Cython/ C/ C++.\n\n4. Strong concepts and commercial experience in event driven systems.\n\n5. Solid foundation in software development (algorithm design, data structure, SDLC).\n\n6. Good concepts of unit testing and automation testing for UI components\n\n7. Good understanding of microservices and their deployment in production set-up.\n\nPreferred Job Requirements\n\n1. Basic understanding of algo trading and financial markets.\n\n2. Good understanding of robust design patterns of microservices.\n\n3. Strong ability to learn new concepts and apply them to solve real life problems.\n\n4. Familiarity with JavaScript and frontend development is a plus.\n\nSalary - INR 1500000 - 2500000 Annually\n\nAbout QuantInsti®\n\nQuantInsti® was started in 2010, by the founders from iRage – a leading quant and algo trading firm in India. From its early days focused on bridging the industry knowledge gap in the field of highfrequency trading, we have come a long way in the last decade becoming one of the biggest globally in our domain with paying customers from 100+ countries.\n\nAt QuantInsti® , we swear by our goal of revolutionizing the way people approach the financial markets by empowering individuals and institutions with bleeding edge knowledge and technology offerings. We offer right from learning tools like high quality live-online learning experience and best-in-class self-paced courses to institutional grade trading tools and platforms to democratize systematic and quantitative trading. We achieve this by putting technology at the core of our business.\n\nWe have a complex ecosystem of microservices and applications deployed over a fully cloud-based infrastructure. Our tech stack includes Node.js, Vue.js, Python and Docker. The team is driven by user experience, with strong focus on delivering scalable software solutions to complex and evolving business goals.\n\nWhy join us?\n\nAt QuantInsti, we work at the cutting edge of FinTech offerings. We work with newest technologies with a goal of delivering best experience to our users in a scalable manner, with high-performance and availability. If you love to be challenged intellectually, rest assured we have plenty of them for you. We follow an open and free work culture, where you are encouraged to ask questions and learn from each other. We offer a fast-paced environment where you take ownership of what you design and deliver. If you are looking for a move where you will find a reason to wake up every morning and rush to workstation happily, please be a part of us!",
        "Salary": "₹1,500,000 - ₹2,500,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=3207dd1308d8ae32",
        "JobType": [],
        "PostedDate": "5 days ago"
    },
    {
        "JobTitle": "Ruby on Rails Developer",
        "Company": "Codezen Tech Solutions",
        "Location": "Andheri, Mumbai, Maharashtra",
        "Description": "*About Company:* Codezen Tech Solutions is a technical consultancy and development firm that believes in increasing transparency and efficiency using cloud based platforms.\n\n*Responsibilities and Duties:*\n* Writing and maintaining reliable Ruby code.\n* Integrating user-facing elements designed by the front-end team.\n* Connecting applications with additional web servers.\n* Maintaining APIs.\n* The ideal candidate will be fluent in Ruby and proficient with Ruby on Rails\n* Extensive experience developing web applications in Object-Oriented Perl, Python, or Java can be substituted as long as there is a strong desire to work in Ruby\n* Design, build, and maintain efficient, reusable, and reliable Ruby code\n* Architecting, designing and developing scalable backend systems with ROR\n* Solid understanding of deploying and maintaining Rails apps within the AWS environment.\n* Set up workers and deploy across multiple instances.\n* Work on complex modules and be hands on on the product code as and when required\n\n*Required Experience, Skills and Qualifications:*\n* 2-4 years of experience required\n* Experience with Ruby on Rails, along with other common libraries such as RSpec and Resque\n* Good understanding of the syntax of Ruby and its nuances\n* Solid understanding of object-oriented programming\n* Good understanding of server-side templating languages {{such as Liquid, Slim, etc depending on your technology stack}}\n* Good understanding of server-side CSS preprocessors {{such as Sass, based on project requirements}}\n* A knack for writing clean, readable Ruby code\n* Proficient understanding of code versioning tools {{e.g. Git, Mercurial or SVN}}\n* Familiarity with development aiding tools {such as Bower, Bundler, Rake, etc.}\n* Familiarity with continuous integration\n* Familiarity with testing tools.\n* Ability to quickly adapt & independently work in a fast-paced Agile environment with minimum supervision.\n\nJob Type: Full-time\n\nPay: ₹900,000.00 - ₹1,100,000.00 per year\n\nBenefits:\n* Flexible schedule\n* Paid sick time\n* Work from home\nLocation Type:\n* In-person\nSchedule:\n* Day shift\n* Morning shift\n\n\n\nExperience:\n* Ruby on Rails: 2 years (Preferred)\n\nWillingness to travel:\n* 75% (Preferred)\n\nWork Location: In person\n\n*Speak with the employer*\n+91 9830000000",
        "Salary": "₹900,000 - ₹1,100,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=d9e0eb804f846501",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "4 days ago"
    },
    {
        "JobTitle": "Senior Snowflake Developer",
        "Company": "hyre global service pvt.ltd.",
        "Location": "Mumbai, Maharashtra",
        "Description": "Position: *Snowflake Developer*\n\nLocation: Mumbai, Pune, Bangalore, Chennai\n\nWork Mode: Hybrid & Permanent\n\nExperience: 7-10 Years\n\nN.P: Immediate Joiners\n\nMandatory Skills: Snowflake+DBT+Python\n\n\n\n*Job Description:*\n* Data profiling to identify primary keys and issues with the data.\n* ETL to bring data onto the Cambia Data Platform, de-duplicate data, create or update\n* dimensional data structures, and produce use case-specific output.\n* Unit testing, functional testing, and performance testing and tuning.\n* Interacting with the Product team to understand and refine requirements.\n* Interacting with QA to address reported findings.\n* Working individually and as a team to achieve our goals.\n* Taking initiative to take on additional work if the present work stream slows down\n* Other similar or related activities.\n\n\n\n*Top 3-5 REQUIREMENTS (you don’t want to see candidates without these)*\n* Expert level knowledge of Git CLI and managing git-based repositories\n* Previous CI/CD experience in working with either Gitlab Runners, Github Actions, Circle CI, or\n* Jenkins and configuring them into GitLab repositories\n* Intermediate to expert knowledge of Snowflake related technologies\n* Intermediate experience in developing and managing python code and python-based web\n\nservices\n\n\n\n*Top 3-5 “Desirements”*\n\nSpecific technologies to be used and level of proficiency?\n* Working with GitLab/Github repositories: Expert\n* CI/CD Pipelining Experience: Preferred\n* Snowflake: Intermediate to Expert\n* Python and building web services: Intermediate to Expert\n* Airflow/Control-M Orchestration tooling experience: Intermediate to Expert\n\nIf interested please share your resume with Khushi@hr-hyre.com OR contact us @99029 68612.\n\nJob Types: Full-time, Permanent\n\nPay: ₹1,000,000.00 - ₹2,400,000.00 per year\n\nBenefits:\n* Health insurance\n* Provident Fund\nLocation Type:\n* In-person\nSchedule:\n* Day shift\n* Fixed shift\n\n\n\nApplication Question(s):\n* Candidates with less than 6 years of experience are not allowed.\n\nExperience:\n* Snowflake Developer: 10 years (Preferred)\n\nWork Location: In person\n\n*Speak with the employer*\n+91 9902968612",
        "Salary": "₹1,000,000 - ₹2,400,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=5a547f3b3b6b55ac",
        "JobType": [
            "Permanent",
            "Full-time"
        ],
        "PostedDate": "4 days ago"
    },
    {
        "JobTitle": "Embedded Developer",
        "Company": "Niyara Workforce Solutions Private Limited",
        "Location": "Andheri, Mumbai, Maharashtra",
        "Description": "1. Embedded Software Development:\n\n- Design, develop, and debug embedded software for microcontroller-based systems and SoCs.\n\n- Write and maintain efficient, reusable, and reliable code in C, C++ and Python.\n\n- Work with advanced microcontroller platforms, including STMicroelectronics (STM32), Arduino, Raspberry Pi, Beagle Bone Black and NVIDIA Jetson Nano.\n\n\n\n2. Robotics Systems Development:\n\n- Design and implement control algorithms for robotic systems, including motion control, path planning, and sensor fusion.\n\n- Integrate sensors (e.g., LiDAR, ultrasonic, IMU) and actuators with embedded platforms for robotic applications.\n\n- Develop robotics solutions for autonomous navigation, object detection, and manipulation.\n\n\n\n3. Hardware Design & Integration:\n\n- Develop schematics and collaborate with hardware teams for PCB design and\n\nsystem architecture.\n\n- Perform hardware bring-up and validation of prototypes and production units.\n\n- Work with robotics platforms integrating microcontrollers like STM32, Arduino, and AI boards like NVIDIA Jetson Nano.\n\n\n\n4. AI & IoT Integration:\n\n- Deploy AI models for robotics applications such as vision-based object detection, edge computing, and decision-making.\n\n- Design IoT-enabled solutions for remote monitoring, diagnostics, and data analytics in robotics systems.\n\n\n\n5. Testing & Debugging:\n\n- Conduct rigorous testing to ensure stability in robotics systems, including hardware-in-the-loop testing.\n\n- Debug embedded and robotic systems using tools like oscilloscopes, logic analyzers, and simulators.\n\n6. Documentation & Collaboration:\n\n- Create and maintain technical documentation, including system design, firmware specifications, and test reports.\n\n- Collaborate with cross-functional teams, including hardware engineers, robotics engineers, and AI specialists.\n\n\n\n*Educational Background:*\n\n- Bachelor’s/Master’s degree in Electronics Engineering, Robotics, Computer Engineering, or related fields.\n\n\n\n*Preferred Experience:*\n\n- Hands-on experience with AI-enabled microcontrollers.\n\n- Familiarity with ML frameworks like TensorFlow Lite, PyTorch Mobile, or ONNX\n\nfor robotics applications.\n\n- Experience in power management and energy-efficient design for robotic systems.\n\n- Experience in Memory optimisation with speed.\n\n- Hands-on experience with hardware design, schematics, and PCB layout tools (e.g.,\n\nAltium, Eagle, KiCad).\n\nJob Types: Full-time, Permanent\n\nPay: ₹600,000.00 - ₹1,500,000.00 per year\n\nBenefits:\n* Health insurance\n* Provident Fund\nSchedule:\n* Day shift\n\nWork Location: In person\n\n*Speak with the employer*\n+91 8976229200",
        "Salary": "₹600,000 - ₹1,500,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=9f9faae63fd9cf36",
        "JobType": [
            "Permanent",
            "Full-time"
        ],
        "PostedDate": "4 days ago"
    },
    {
        "JobTitle": "Java Full Stack Developer",
        "Company": "Anebal Solutions",
        "Location": "Mumbai, Maharashtra",
        "Description": "*Java Developer , Dot Net Developer , Software Tester, & Python Developer*\n\nfor *1 - 3 years Experience Candidates.*\n\n*Freshers also can apply ..*\n\nImmediately Joiner only ..\n\nInterested Candidates can contact us.\n\nBE / BTECH / MTECH ( Com , IT , CSE , E&TC )/ MCA / MCS\n\nLocations :- Pune , Mumbai\n\nJob Type: Full-time\n\nPay: ₹350,000.00 - ₹750,000.00 per year\n\nBenefits:\n* Health insurance\nLocation Type:\n* In-person\nSchedule:\n* Day shift\n\n\n\nAbility to commute/relocate:\n* Mumbai, Maharashtra: Reliably commute or planning to relocate before starting work (Required)\n\nEducation:\n* Bachelor's (Preferred)\n\nExperience:\n* total work: 1 year (Preferred)\n* Java, .NET ,Python , Software Testing: 1 year (Preferred)\n\nWork Location: In person",
        "Salary": "₹350,000 - ₹750,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=44ed4322f28cb700",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "4 days ago"
    },
    {
        "JobTitle": "SFCC Developer",
        "Company": "IOSys Software India Private Limited",
        "Location": "Mumbai, Maharashtra",
        "Description": "* Position: SFCC Developer\nExperience: 5+ years\n\nKey Skills Required:\n\nStrong knowledge of AWS (including Lambda functions)\nExperience with AppFlow\nProficiency in Python coding\nFamiliarity with A/B testing\n* Location: Work from Office, Mumbai\n\nJob Type: Full-time\n\nPay: ₹1,800,000.00 - ₹2,500,000.00 per year\n\nBenefits:\n* Provident Fund\nLocation Type:\n* In-person\n\n\n\nEducation:\n* Bachelor's (Preferred)\n\nExperience:\n* Salesforce commerce cloud development: 2 years (Required)\n\nWork Location: In person",
        "Salary": "₹1,800,000 - ₹2,500,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=bc3025705fe7bf1c",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "4 days ago"
    },
    {
        "JobTitle": "Python Developer",
        "Company": "BDS STZ",
        "Location": "Kanjurmarg, Mumbai, Maharashtra",
        "Description": "*Responsibilities:*\n* We are looking for a Python developer who can automate and scrape websites.\n* Design, develop, and maintain scalable and efficient Python applications.\n* Experience in *Web Scraping* using *Selenium, Beautiful Soup*.\n* Collaborate with cross-functional teams to define, design, and ship new features.\n* Troubleshoot and debug applications to optimize performance.\n* Build automated solutions to scrape data from web and app platforms.\n* Experience in using python library such as *pandas*, *pyinstaller*.\n* Integrate user-facing elements developed by front-end developers with server-side logic.\n* Develop and maintain automated tests to ensure software quality.\n* Participate in code reviews to maintain code quality and share knowledge with the team.\n* Stay up-to-date with the latest industry trends and technologies to bring innovative ideas to the team.\n\n*Requirements:*\n* Proven experience as a Python Developer with a strong portfolio of projects.\n* Proficiency in Python and its libraries, such as *Pandas*, *NumPy*, *Flask*, or *Django*.\n* Experience with relational databases (e.g., *MySQL, PostgreSQL*) and non-relational databases (e.g., *MongoDB*).\n* Familiarity with front-end technologies (*HTML, CSS, JavaScript*) is a plus.\n* Experience with version control systems (e.g., *Git*).\n* Strong understanding of software development principles, design patterns, and best practices.\n* Excellent problem-solving skills and attention to detail.\n* Ability to work independently\n\nJob Type: Full-time\n\nPay: ₹20,000.00 - ₹25,000.00 per month\n\nSchedule:\n* Day shift\n\n\n\nApplication Question(s):\n* How many years of experience do you have as an Python Developer ?\n* Do you have experience working on Pandas, NumPy, Flask and Django ?\n* Do you have experience working on MySQL, PostgreSQL?\n* Do you have experience in Web Scraping ?\n\nWork Location: In person",
        "Salary": "₹240,000 - ₹300,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=8cc98b7670c98580",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "4 days ago"
    },
    {
        "JobTitle": "Data Experience, Aladdin Data, Director",
        "Company": "BlackRock Investments",
        "Location": "Mumbai, Maharashtra",
        "Description": "Job description\n\nAbout this role\n\nRole Brief\nWhen BlackRock was started in 1988, its founders envisioned a company that combined the best of financial services with cutting edge technology. They imagined a business that would provide financial services to clients as well as technology services to other financial firms. The result of their vision is Aladdin, our industry leading, end-to-end investment management platform. With assets valued over USD $7 trillion managed on Aladdin, our technology empowers millions of investors to save for retirement, pay for college, buy a home and improve their financial wellbeing.\n\nData is at the heart of Aladdin and increasingly the ability to consume, store, analyze and gain insight from data has become a key component of our competitive advantage. The Aladdin Data team is responsible for the data ecosystem within BlackRock. Our goal is to build and maintain a leading-edge data platform that provides highly available, consistent data of the highest quality for all users of the platform, notably investors, operations teams and data scientists. We focus on evolving our platform to deliver exponential scale to the firm, powering the future growth of Aladdin.\n\nStudio Engineers at BlackRock get to experience working at one of the most recognized financial companies in the world while being part of a software development team responsible for next generation technologies and solutions. Our engineers design and build large scale data storage, computation and distribution systems. They partner with data and analytics experts to deliver high quality analytical and derived data to our consumers.\n\nWe are looking for Full Stack engineers who like to innovate and seek complex problems. We recognize that strength comes from diversity and will embrace your unique skills, curiosity, drive, and passion while giving you the opportunity to grow technically and as an individual. We are committed to open source and we regularly give our work back to the community. Engineers looking to work in the areas of Digital, Events Orchestration, APIs, data distribution, distributed computation, consumption, visualization, and infrastructure are ideal candidates.\n\nResponsibilities\n\nStudio Engineers are expected to be involved from inception of projects, understand requirements, architect, develop, deploy, and maintain studio products and services. Typically, they work in a multi-disciplinary squad (we follow Agile!) which involves partnering with program and product managers to expand product offering based on business demands. Design is an iterative process, whether for UX, services or infrastructure. Our goal is to drive up user engagement and adoption of the platform while constantly working towards modernizing and improving platform performance and scalability.\n\nDeployment and maintenance require close interaction with various teams. This requires maintaining a positive and collaborative working relationship with teams within Studio as well as with wider Aladdin developer community. Production support for applications is usually required for issues that cannot be resolved by operations team. Creative and inventive problem-solving skills for reduced turnaround times are highly valued.\n\nManaging a highly functional team for both development and operations continuity is integral to the role. Adhering to BlackRock's UX and design standards is expected and contributing towards upkeep of those standards is encouraged.\n\nAnd Ideal candidate would have\n\nBA/BS in Computer Science or equivalent practical experience\n\nAt least 15+ years’ experience delivering large scale enterprise solutions.\n\nMust have experience architecting and building scalable distributed applications\n\nExperience in Java, React, Angular, Python, SQL, Linux is a must\n\nExperience with Event Driven Architecture, Micro Services and Cloud technologies\n\nExperience / Familiarity with object-oriented design patterns\n\nExperience with dev ops tools like Git, Maven, Jenkins, Gitlab CI, Azure DevOps\n\nExperience with Agile development concepts and related tools\n\nAbility to trouble shoot and fix performance issues across the codebase and database queries\n\nExcellent written and verbal communication skills\n\nPassion for learning and implementing new technologies\n\nAbility to operate under fast-paced environment\n\nSkills that would be a plus\n\nPerl\n\nC++\n\nExperience supporting large scale, complex analytics requirements\n\nOur benefits\n\nTo help you stay energized, engaged and inspired, we offer a wide range of benefits including a strong retirement plan, tuition reimbursement, comprehensive healthcare, support for working parents and Flexible Time Off (FTO) so you can relax, recharge and be there for the people you care about.\n\nOur hybrid work model\n\nBlackRock’s hybrid work model is designed to enable a culture of collaboration and apprenticeship that enriches the experience of our employees, while supporting flexibility for all. Employees are currently required to work at least 4 days in the office per week, with the flexibility to work from home 1 day a week. Some business groups may require more time in the office due to their roles and responsibilities. We remain focused on increasing the impactful moments that arise when we work together in person – aligned with our commitment to performance and innovation. As a new joiner, you can count on this hybrid model to accelerate your learning and onboarding experience here at BlackRock.\n\nAbout BlackRock\n\nAt BlackRock, we are all connected by one mission: to help more and more people experience financial well-being. Our clients, and the people they serve, are saving for retirement, paying for their children’s educations, buying homes and starting businesses. Their investments also help to strengthen the global economy: support businesses small and large; finance infrastructure projects that connect and power cities; and facilitate innovations that drive progress.\n\nThis mission would not be possible without our smartest investment – the one we make in our employees. It’s why we’re dedicated to creating an environment where our colleagues feel welcomed, valued and supported with networks, benefits and development opportunities to help them thrive.\n\nFor additional information on BlackRock, please visit @blackrock | Twitter: @blackrock | LinkedIn: www.linkedin.com/company/blackrock\n\nBlackRock is proud to be an Equal Opportunity Employer. We evaluate qualified applicants without regard to age, disability, family status, gender identity, race, religion, sex, sexual orientation and other protected attributes at law.\n\nJob Requisition #\nR250142",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=adf73dece385d309",
        "JobType": [
            "Internship"
        ],
        "PostedDate": "4 days ago"
    },
    {
        "JobTitle": "Technical Specialist-Data Engg",
        "Company": "BirlaSoft",
        "Location": "Mumbai, Maharashtra",
        "Description": "Country/Region: IN\nRequisition ID: 21809\nWork Model:\nPosition Type:\nSalary Range:\nLocation: INDIA - MUMBAI-CLIENT SITE\nTitle: Technical Specialist-Data Engg\nDescription:\nArea(s) of responsibility\n\nJob Responsibilities:\n\nCode high-risk and/or high-complexity modules and establish patterns & practices for the team to follow\nCollaborate with Architects, Product Owners, and Scrum Masters to establish requirements and to implement overall project plan & solution design\nInteract with business and technical stakeholders to understand requirements, challenges, and expectations\nDefine and ensure adherence to standards and guidelines and on-time delivery of team deliverables\nOwn Analysis, High Level Design/Architecture, and a direction for the project\nResearch new frameworks, solutions, tools, techniques, and best practices to improve team productivity\nLead design and implementation of new stories and bug fixes\nPerform thorough design and code reviews and support code deployments/post go-live activities\nConduct root cause analysis & corrective measures on defects/issues identified\nProvide technical direction and coaching to software developers in application development activities (2-8 people)\nPlay the role of a Scrum Master along with being a lead for the team\nAdhere to all organizational and IT policies and processes for software development and project management\nUnderstand, apply, promote, and contribute to the delivery methodologies, standards, and tools\nExplore innovative technology trends and apply them in appropriate scenarios to deliver value to Team, Customer and Organization\nAssist the Technical Manager for the successful execution of the project (estimation, dependency identification, reviews, customer satisfaction, etc.)\nHelp the Technical/Senior Project Manager identify and allocate the right resources, considering the project needs, skill set and aptitude of the resources\nContribute to Organizational knowledge base thus bringing in reusability and reducing operational cost\n\nRequirements and Qualifications:\n\n4 - 6 years of overall IT experience with hands-on experience in coding\n4+ years of experience in Python, SQL and Data Warehouse skills, Data Vault modeling would be a plus\n2+ years of experience working as a Technology Lead or any similar role with capability and strong desire to be a lead in an Agile environment\n1+ years of experience with Cloud native development on Azure or a related Cloud\nProven experience with Python/PySpark and related technologies\nProven skills with JavaScript/TypeScript, DHTML, HTML, CSS, AJAX, jQuery, Web Services, etc. would be beneficial\nExpert understanding of Design patterns, practices, and concepts with ability to implement these the technology solutions\nHands on with coding, unit testing and production issue troubleshooting\nExperience working in a full stack role with all layers of UI, middle-tier, and back end would be desirable\nExperience in release management process utilizing CICD and DevSecOps concepts\nExperience with Visual Studio 2017/2019/2022 and TFS (Team Foundation Server)/GIT\nExperience working as a direct point of contact with the business and/or key stakeholders\nExperience working in a fast-paced Agile environment\nExcellent verbal & written communication skills with strong interpersonal & influencing skills and ability to effect change in a matrix managed organization\nUnderstanding of Azure Cloud platform would be beneficial\nUnderstanding of Kafka, RabbitMQ, SQS like messaging services would be a plus\nAngular working knowledge would be a plus\nProficiency in MS Project, Outlook, Word, Excel, SharePoint, Visio, and PowerPoint",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=dfcbe87316b2ceb4",
        "JobType": [],
        "PostedDate": "4 days ago"
    },
    {
        "JobTitle": "Global Research: Python Developer",
        "Company": "JPMorganChase",
        "Location": "Mumbai, Maharashtra",
        "Description": "JOB DESCRIPTION\n\nAre you looking for an exciting opportunity to join a dynamic and growing team in a fast paced and challenging area? This is a unique opportunity for you to work in our team to partner with the Business to provide a comprehensive view.\n\nWe are seeking a dynamic and energetic individual with strong Python development experience to join our Research Modernization team.\n\nJob Summary\n\nAs a Python developer within our team, you will bring your dynamic energy, strong attention to detail, and ability to multitask to our Research Modernization team within Global Research. In this role, you will have the opportunity to be highly organized, proactive, and flexible. Your keen attention to detail, strong communication skills, and sense of urgency will be highly valued.\n\nJob Responsibilities\n\nBuild, deploy, and maintain business processes and web crawlers using Python.\nWork with Research Analysts to understand their data needs and translate their requirements into data/information solutions.\nUtilize Python for data handling and manipulation to prepare and transform data into a usable format for Research Analysts.\nCreate, productionize, and store enhanced and original datasets; improve data analysis and discovery tools; model the data with a focus on ease of storage, retrieval, and usability.\nDevelop scripts and tools to automate repetitive tasks, improve efficiency, and streamline workflows.\nMonitor and troubleshoot process performance and reliability issues in a timely manner.\nIdentify opportunities for process improvement and develop policies for data access and governance.\nEnsure data quality and integrity through effective validation and testing processes.\nAutomate publication and analytics workflows for Research Analysts.\nResearch and analyze datasets using a variety of analytical techniques in Python.\n\nRequired qualifications, capabilities, and skills\n\nBachelor’s degree in engineering, computer science, information technology, or other data science/analytics fields.\nMinimum 1 year of experience in data analysis, automation, and web crawling using Python.\nStrong knowledge of Python and relevant packages for data handling and manipulation. It is essential that the candidate has hands-on experience in Python programming and in-depth knowledge of libraries like Pandas and NumPy.\nUnderstanding of essential libraries for web scraping, such as BeautifulSoup and Selenium.\nStrong background in data structures, algorithms, and data engineering, with experience in multiple data/technology platforms.\nStrong analytical and problem-solving skills.\nExcellent communication, presentation, interpersonal, and organizational skills.\nDetail-oriented, with a highly disciplined approach to processes and controls.\n\nPreferred qualifications, capabilities, and skills\n\nDemonstrable interest in finance and research.\nABOUT US\n\nJPMorganChase, one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. We also make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as mental health or physical disability needs. Visit our FAQs for more information about requesting an accommodation.\n\nABOUT THE TEAM\n\nJ.P. Morgan’s Commercial & Investment Bank is a global leader across banking, markets, securities services and payments. Corporations, governments and institutions throughout the world entrust us with their business in more than 100 countries. The Commercial & Investment Bank provides strategic advice, raises capital, manages risk and extends liquidity in markets around the world.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=a6bff4cdcef271b9",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "4 days ago"
    },
    {
        "JobTitle": "C++ Developer",
        "Company": "Datrax Services Pvt Ltd",
        "Location": "Mumbai, Maharashtra",
        "Description": "We are a renowned manufacturer and supplier of Industrial Machine Control and Automation solutions in India, specializing in weighing, packing, and food processing. Color analysis software solutions, and Laboratory equipment. In line with our commitment to innovation and excellence, we are expanding our operations in software solutions, mobile apps, and Industrial IoT solutions to complement our existing products, which include Embedded Systems and PC application software.\n\nC++Developer Responsibilities:\n* Collaborating with internal stakeholders to define the scope of software development projects.\n* Working closely with the software development team to design and develop applications.\n* Developing software and overseeing its deployment across various platforms.\n* Conducting diagnostic tests and implementing debugging procedures.\n* Establishing channels for gathering end-user feedback on applications.\n* Optimizing software performance through regular maintenance, updates, and upgrades.\n* Documenting processes and maintaining comprehensive software development records.\n* Staying abreast of the latest C++ standards and advancements in application development.\n\nC++ Developer Requirements:\n* Bachelor's degree in computer science, information systems, or a related field.\n* C++ certification is desirable.\n* Minimum of 2 years' experience as a C++ software developer.\n* Up-to-date knowledge of C++ standards and specifications.\n* Proficiency in C++ compliant languages such as C, C++, Qt, Java, and Python.\n* Extensive experience in deploying software across various platforms and operating systems.\n* Familiarity with SQL, JavaScript, and XML.\n* Strong analytical and problem-solving abilities.\n* Excellent collaboration and communication skills.\n* Outstanding organizational and time management skills.\n* Utilizing Qt framework for cross-platform application development.\n* Designing and implementing user interfaces using Qt Widgets and QML.\n* Integrating Qt components and libraries into existing applications.\n* Ensuring compatibility and responsiveness of applications across different platforms.\n\nJob Types: Full-time, Permanent\n\nPay: ₹200,000.00 - ₹700,000.00 per year\n\nBenefits:\n* Health insurance\n* Paid sick time\n* Provident Fund\nLocation Type:\n* In-person\nSchedule:\n* Day shift\n\n\n\nExperience:\n* c++ developer: 3 years (Required)\n* QT/QML: 3 years (Required)\n* C, C++, Qt, Java, and Python: 3 years (Required)\n* SQL, JavaScript, and XML: 3 years (Required)\n\nWork Location: In person",
        "Salary": "₹200,000 - ₹700,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=f7f71f986920b9b3",
        "JobType": [
            "Permanent",
            "Full-time"
        ],
        "PostedDate": "3 days ago"
    },
    {
        "JobTitle": "Principal Consultant, Java",
        "Company": "Genpact",
        "Location": "Mumbai, Maharashtra",
        "Description": "Genpact (NYSE: G) is a global professional services and solutions firm delivering outcomes that shape the future. Our 125,000+ people across 30+ countries are driven by our innate curiosity, entrepreneurial agility, and desire to create lasting value for clients. Powered by our purpose – the relentless pursuit of a world that works better for people – we serve and transform leading enterprises, including the Fortune Global 500, with our deep business and industry knowledge, digital operations services, and expertise in data, technology, and AI\n\nInviting applications for the role of Principal Consultant, Java\nIn this role, you will be responsible for coding, testing and delivering high quality deliverables, and should be willing to learn new technologies.\n\nResponsibilities\n• Application Development: Design, develop, and maintain scalable Java-based applications using Spring Boot and microservices architecture.\n• Kafka Integration: Implement and manage real-time data streaming solutions using Apache Kafka, ensuring high availability and performance.\n• Database Management: Work with IBM DB2, including writing and optimizing complex SQL queries, stored procedures, and indexing strategies.\n• System Architecture: Contribute to the design and architecture of large-scale distributed systems with best practices in microservices, event-driven architecture, and cloud-native technologies.\n• Performance Optimization: Identify bottlenecks and improve system performance, scalability, and reliability.\n• Collaboration: Work closely with cross-functional teams, including business analysts, DevOps, and QA, to deliver high-quality software solutions.\n• Code Quality & Best Practices: Maintain high code quality through unit testing, integration testing, and code reviews while following Agile methodologies.\n• Security & Compliance: Ensure that applications meet industry standards and compliance requirements.\n• Mentoring: Provide technical guidance and mentorship to junior developers.\n\nQualifications we seek in you!\nMinimum Qualifications\n• BE/B Tech/MCA\n• Excellent written and verbal communication skills\n\nPreferred Qualifications/ Skills\n• Strong hands-on experience in Spring Boot, Spring Cloud, Spring MVC, Spring Security.\n• Apache Kafka experience, including Kafka Streams, Kafka Connect, and event-driven microservices.\n• Database expertise in IBM DB2, including schema design, stored procedures, and query optimization.\n• Strong knowledge of RESTful API development, API gateways, and authentication mechanisms.\n• Experience with Docker, Kubernetes, and cloud platforms (AWS, Azure) is a plus.\n• Basic knowledge of Python is a plus.\n• Proficiency in unit testing frameworks (JUnit, Mockito) and CI/CD pipelines.\n• Knowledge of messaging systems like Websphere MQ or ActiveMQ is an advantage.\n• Familiarity with monitoring and logging tools like Prometheus, Grafana, ELK stack.\n• Strong analytical and problem-solving skills.\n• Excellent communication skills and ability to work in an Agile environment\n\nGenpact is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, religion or belief, sex, age, national origin, citizenship status, marital status, military/veteran status, genetic information, sexual orientation, gender identity, physical or mental disability or any other characteristic protected by applicable laws. Genpact is committed to creating a dynamic work environment that values diversity and inclusion, respect and integrity, customer focus, and innovation. For more information, visit www.genpact.com . Follow us on Twitter, Facebook, LinkedIn, and YouTube.\nFurthermore, please do note that Genpact does not charge fees to process job applications and applicants are not required to pay to participate in our hiring process in any other way. Examples of such scams include purchasing a 'starter kit,' paying to apply, or purchasing equipment or training.\n\nJobPrincipal Consultant\nPrimary LocationIndia-Mumbai\nScheduleFull-time\nEducation LevelBachelor's / Graduation / Equivalent\nJob PostingFeb 5, 2025, 3:47:17 PM\nUnposting DateMar 8, 2025, 12:29:00 PM\nMaster Skills ListConsulting\nJob CategoryFull Time",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=8a1d05d027d3f2d6",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "3 days ago"
    },
    {
        "JobTitle": "Integration Developer",
        "Company": "WTW",
        "Location": "Thane, Maharashtra",
        "Description": "Description\n\nJob Summary:\n\nIntegration Developer will be responsible for designing, developing, and maintaining enterprise integration solutions using Azure services, with expertise in API Integration, Messaging, Event Hub events, Azure Function listeners, SQL Server databases, and low-code automation tools like Power Automate and Power Apps. The role focuses on enabling seamless data flow and automation across business systems. The role also involves working with Azure DevOps for work items and CI/CD pipelines to ensure efficient project delivery and automation\n\nRoles and Responsibilities:\n\nThe person will be working within a small team as integration developer.\n\nDesign, develop REST/SOAP API's. Implement azure APIM for security, throttling & analytics\n\nEnsure API security using OAuth2, JWT tokens & API keys. Develop unit test & integration test for all the integration components\n\nDevelop Azure Function Listeners, create event-based triggers using event hub, service hub, blob storage & HTTP triggers.\n\nDesign, implement messaging patterns using Azure Service Bus, Event Hub, and Event Grid. Build pub-sub architectures\n\nEnsure proper error handling, message serialization, and deserialization practices\n\nIntegrate & manage data using SQL server databases. Develop optimized T-SQL queries, Store Procedures , views, CDC.\n\nImplement power apps for custom business applications & data entry interfaces\n\nWork closely with Architects, BA, and PM to gather technical requirements, assist in designing end-to-end integration strategies and reusable components\n\nTechnical Skill: Need to hve:\n\n.NET Core API, MS SQL Server, Azure Services (APIM, Functions, Event Hub, Service Bus, Event Grid, Storage),\n\nPowerShell, Python\n\nExp: 8 to 10 years\n\nQualifications\n\nGraduate with Engineering and IT specialization",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=37c38f2aa95bd1aa",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "4 days ago"
    },
    {
        "JobTitle": "DR Consultant",
        "Company": "Kyndryl",
        "Location": "Mumbai, Maharashtra",
        "Description": "Who We Are\n\nAt Kyndryl, we design, build, manage and modernize the mission-critical technology systems that the world depends on every day. So why work at Kyndryl? We are always moving forward – always pushing ourselves to go further in our efforts to build a more equitable, inclusive world for our employees, our customers and our communities.\n\nThe Role\n\nAre you passionate about solving complex problems? Do you thrive in a fast-paced environment? Then there’s a good chance you will love being a part of our Software Engineering – Development team at Kyndryl, where you will be able to see the immediate value of your work.\n\nAs a Software Engineering - Developer at Kyndryl, you will be at the forefront of designing, developing, and implementing cutting-edge software solutions. Your work will play a critical role in our business offering, your code will deliver value to our customers faster than ever before, and your attention to detail and commitment to quality will be critical in ensuring the success of our products.\n\nUsing design documentation and functional programming specifications, you will be responsible for implementing identified components. You will ensure that implemented components are appropriately documented, unit-tested, and ready for integration into the final product. You will have the opportunity to architect the solution, test the code, and deploy and build a CI/CD pipeline for it.\n\nAs a valued member of our team, you will provide work estimates for assigned development work, and guide features, functional objectives, or technologies being built for interested parties. Your contributions will have a significant impact on our products' success, and you will be part of a team that is passionate about innovation, creativity, and excellence. Above all else, you will have the freedom to drive innovation and take ownership of your work while honing your problem-solving, collaboration, and automation skills. Together, we can make a difference in the world of cloud-based managed services.\n\nYour Future at Kyndryl\nThe career path ahead is full of exciting opportunities to grow and advance within the job family. With dedication and hard work, you can climb the ladder to higher bands, achieving coveted positions such as Principal Engineer or Vice President of Software. These roles not only offer the chance to inspire and innovate, but also bring with them a sense of pride and accomplishment for having reached the pinnacle of your career in the software industry.\n\nWho You Are\n\nYou’re good at what you do and possess the required experience to prove it. However, equally as important – you have a growth mindset; keen to drive your own personal and professional development. You are customer-focused – someone who prioritizes customer success in their work. And finally, you’re open and borderless – naturally inclusive in how you work with others.\n\nRequired Technical and Professional Experience\n\n7-10 years of experience working as a software engineer on complex software projects.\nExcellent coding skills and solid development experience (Java, Python, .Net etc.) with debugging and problem-solving skills.\nSoftware development methodologies, with demonstrated experience developing scalable and robust software.\nExperienced in relational and NoSQL databases, data mapping, XML/JSON, Rest based web services.\nKnowledge of architecture design - Microservices architecture, containers (Docker & k8s), messaging queues.\nDeep understanding of OOP and Design patterns.\n\nPreferred Technical and Professional Experience\n\nBachelor's degree in computer science, related technical field, or equivalent practical experience.\nCertification in one or more of the hyperscale's (Azure, AWS, and Google GCP) - otherwise, you can obtain certifications with Kyndryl.\nExperience with DevOps tools and modern engineering practices.\n\nBeing You\n\nDiversity is a whole lot more than what we look like or where we come from, it’s how we think and who we are. We welcome people of all cultures, backgrounds, and experiences. But we’re not doing it single-handily: Our Kyndryl Inclusion Networks are only one of many ways we create a workplace where all Kyndryls can find and provide support and advice. This dedication to welcoming everyone into our company means that Kyndryl gives you – and everyone next to you – the ability to bring your whole self to work, individually and collectively, and support the activation of our equitable culture. That’s the Kyndryl Way.\n\nWhat You Can Expect\n\nWith state-of-the-art resources and Fortune 100 clients, every day is an opportunity to innovate, build new capabilities, new relationships, new processes, and new value. Kyndryl cares about your well-being and prides itself on offering benefits that give you choice, reflect the diversity of our employees and support you and your family through the moments that matter – wherever you are in your life journey. Our employee learning programs give you access to the best learning in the industry to receive certifications, including Microsoft, Google, Amazon, Skillsoft, and many more. Through our company-wide volunteering and giving platform, you can donate, start fundraisers, volunteer, and search over 2 million non-profit organizations. At Kyndryl, we invest heavily in you, we want you to succeed so that together, we will all succeed.\n\nGet Referred!\n\nIf you know someone that works at Kyndryl, when asked ‘How Did You Hear About Us’ during the application process, select ‘Employee Referral’ and enter your contact's Kyndryl email address.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=9cd145b97176e534",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "2 days ago"
    },
    {
        "JobTitle": "Python Django backend developer(3-4+yrs)- vile parle",
        "Company": "Tech Turmeric IT Services",
        "Location": "Mumbai, Maharashtra",
        "Description": "*Python Django Backend developer(3+ yrs)*\n\n*Client office: Vile parle west*\n\nUrgent requirement :\n\n2 open positions for Python Django backend developer\n\n- minimum 3+ years of experience with Django\n- ⁠should be very very good with backend development in python DJANGO . No compromise on this .\n- ⁠expert with api development\n- ⁠should be willing to join immediately\n- ⁠willing to work from vile Parle office 6 days working\n\nresumes can be shared to mittal@techturmeric.com\n\nJob Types: Full-time, Permanent\n\nPay: ₹50,000.00 - ₹90,000.00 per month\n\nSchedule:\n* Day shift\n* Monday to Friday\n* Weekend availability\n\nWork Location: In person",
        "Salary": "₹600,000 - ₹1,080,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=d7afec9f1e9493ea",
        "JobType": [
            "Permanent",
            "Full-time"
        ],
        "PostedDate": "4 days ago"
    },
    {
        "JobTitle": "Django Developer (Immediate joiner)",
        "Company": "Sankey Business Solutions Pvt Ltd.",
        "Location": "Thane, Maharashtra",
        "Description": "*About Us:*\n\nSankey Solutions is a technology solutions and IT consulting firm providing IT and digital transformation services. Solving high-level business problems of the clients using advanced software and methods. Started in 2015 with a team of 4 and has grown to a team of 200+ employees with offices in India, Singapore, and the UK. We work to develop innovative technology solutions with the latest technology in the field of Web Mobility, Application Services, AI, Big Data, Machine Learning, and Predictive and Prescriptive modelling.\n\n*Role: Django Developer*\n\n*Responsibilities:*\n* Design, implement and maintain Python applications using the Django framework\n* Work with development team to identify and create software solutions\n* Write reusable, testable, and efficient code\n* Perform the debugging, testing, and improvement of application performance\n* Document and maintain software functionality\n* Participate in design and code reviews\n* Integrate user-facing elements developed by front-end developers with server-side logic\n* Ensure security and data protection settings\n* Stay informed of emerging technologies\n* Co-operating with the front-end developer in the process of building the RESTful API\n* Familiarity with database technologies such as MySQL, Neo4J, and MongoDB is a plus.\n\n*Soft skills: *\n* Should have Excellent Communicaton and direct interaction with Client on daily basis.\n* Should grasp things quickly on new technologies and implement it for Project requirements.\n* Handle resources and get hands on to solve technical problems faced by the delivery team.\n* Maintain comprehensive knowledge of industry standards, methodologies, processes and best practices.\n\n*Requirements:*\n\n*Role:* Back-end developer Job Qualifications: Only IT graduate (Technical background)\n\n*Experience:* 2 to 3 years\n\n*Job Location(s):* Thane\n\n*Industry Type IT*: Software, Software Services Functional Area IT Software: Application Programming, Maintenance\n\n*Employment Type:* Full Time, Permanent\n\nIndustry: IT Services and IT Consulting\n\nEmployment Type: Full-time\n\nJob Type: Full-time\n\nPay: ₹500,000.00 - ₹1,100,000.00 per year\n\nBenefits:\n* Health insurance\n* Life insurance\n* Provident Fund\nLocation Type:\n* In-person\nSchedule:\n* Day shift\n\n\n\nApplication Question(s):\n* What is your notice period?\n* Will you be able to travel to Thane ?\n* Currently are you serving the notice period ?\n\nWork Location: In person",
        "Salary": "₹500,000 - ₹1,100,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=1931ba57f9719bdc",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "4 days ago"
    },
    {
        "JobTitle": "Python/Django Developer",
        "Company": "Vishleshan Software Solutions Pvt. Ltd.",
        "Location": "Mumbai, Maharashtra",
        "Description": "Job Description: \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  Build new products with. Write effective, scalable code.  Develop back-end components to improve responsiveness and overall performance.  Integrate user-facing elements into applications.  Test and debug programs.  Improve functionality of existing systems.  Assess and prioritize feature requests Good Oral and Written Communication Skill. Positive Attitude towards Work.  Coordinate with internal teams to understand user requirements and provide technical solutions.  Work experience as a Python Developer.  Ability to move fast and deliver code for Web Based Applications.\n\nRequirements: \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  Work across the entire stack to build test and ship new user-facing product.  Should have Knowledge of object-relational mapping (ORM).  Should have Working knowledge of Linux/Unix Based OS.  Will be Adept in working with RDBMS/NoSQL databases.  Sound knowledge to build RESTFUL APIs.  Ability to code following best practices with unit testing.  Must have knowledge of git(Version control).  Familiarity with front-end technologies (like JavaScript and HTML).  Tech stack will be Python, Postgresql MySQL, BootStrap, AngularJS, Amazon EC2, Amazon S3, Google Analytics, Amazon Cloud Front, GitHub.  Coordinate with internal teams to understand user requirements and provide technical solutions  Oracle Database  WCF Web Services  Innovative in Web Creations, API  Good to have knowledge on JavaScript, Angular, or any frontend languages.\n\n Good to have experience on Azure/ AWS including deployments.  Knowledge of Python is a plus Educational Qualifications\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  B.E./B.Tech/  M.Tech, MCA/ BCA/ BSc-CS/ BSc-IT  Bachelor’s degree in Computer Science or equivalent experience.  Strong skills in communication, personal effectiveness, quality and common sense, detail oriented.  Work effectively and professionally as a team player.  Self-starter, motivated.  Sense of ownership and hands on approach to problem solving.  Work independently and within team as well as work effectively under pressure, tight deadlines.  Dedication to fostering an inclusive culture and value diverse perspectives.\n\nCompany Name:\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ Vishleshan Software Solutions Pvt. Ltd. www.vishleshan.net Company Profile\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ Founded in 2003, ‘Vishleshan,’ in Sanskrit means analysis and synthesis. It is the process of examining something and breaking it down in order to see what it consists of. This is exactly what we stand for – instead of simply reacting to our customer’s requirements we take a step back and analyze their business problems and break them down and solve them by creating new digital business models. True to our name, we use convergent and divergent development processes to achieve results for our customers. Vishleshan is a lean and agile organization with a vision of long-term association with our customers. We have been a trusted partner to some of the most respected global brands across multiple industries.\n\nJob Types: Full-time, Internship\n\nPay: ₹240,000.00 - ₹420,000.00 per year\n\nLocation Type:\n* In-person\nSchedule:\n* Day shift\n* Monday to Friday\n\nWork Location: In person",
        "Salary": "₹240,000 - ₹420,000 per year",
        "JobURL": "https://in.indeed.com/viewjob?jk=b1b1c848492ab4fa",
        "JobType": [
            "Full-time",
            "Internship"
        ],
        "PostedDate": "4 days ago"
    },
    {
        "JobTitle": "Associate - Full Stack AI Developer",
        "Company": "JPMorganChase",
        "Location": "Mumbai, Maharashtra",
        "Description": "JOB DESCRIPTION\n\nYou are a strategic thinker passionate about driving solutions in AI oriented Full Stack development, you have found the right team.\n\nAs a Full Stack AI Developer – Associate in our MIS and Platforms team, you will spend each day defining, refining, and delivering set goals for our firm.\n\nJob Responsibilities:\n\nScope, prioritize and co-ordinate activities with the product owners. Partner with product owners teams to identify strategic solutions.\nIdentify key data sources that can make business impacts.\nDesign and develop data mining queries from large data sets (Both Structured and Unstructured). Experienced in conversion of data into information.\nDemonstrate proficiency in application programming with AI skills.\nEmploys scaling & automation to data preparation techniques.\nTransform business problems into solutions using application development utilizing AI technologies.\nAssist technical and non-technical end users in how to leverage and interpret the analysis.\n\nRequired qualifications, capabilities and skills.\n\nBachelor’s Degree in, Data science Computer Science, or Engineering.\nExperience Required: Minimum 5 years in full stack/application development with alteast 2 years in Data/AI related projects and self-starter, attention to details and results orientated, able to work under minimal guidance. Uses pertinent data and facts to identify and solve a range of problems within area of expertise.\nProvides explanations and information to others on topics within area of expertise.\nHarness the power of Linux and Create Application Programming Interfaces (APIs) in Python and .net and integrate into web server tools such as Nginx, Uvicorn or similar tools.\nCreate dynamic websites using the Model-View-Controller software design pattern, Django, jQuery, CSS, Bootstrap and Expert in developer tools such as GIT, Jupyter notebook, Cloud Foundry etc.\nAbility to handle, clean, visualize and analyze big data and Support Data Scientist on solutions using NumPy, Pandas, Sklearn, Matplotlib, Seaborn etc.\nHands on experience with PySpark/PySQL stack. Experience on building data extraction pipelines and proficiency in data querying skills on SQL (Snowflake, Databricks)\n\nPreferred qualifications, capabilities and skills.\n\nDifferent field of study, with significant professional experience in BI and Analytics Development, is acceptable.\nGood communication and analytical skills\nABOUT US\n\nJPMorganChase, one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. We also make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as mental health or physical disability needs. Visit our FAQs for more information about requesting an accommodation.\n\nABOUT THE TEAM\n\nJ.P. Morgan Asset & Wealth Management delivers industry-leading investment management and private banking solutions. Asset Management provides individuals, advisors and institutions with strategies and expertise that span the full spectrum of asset classes through our global network of investment professionals. Wealth Management helps individuals, families and foundations take a more intentional approach to their wealth or finances to better define, focus and realize their goals.",
        "Salary": "Not specified",
        "JobURL": "https://in.indeed.com/viewjob?jk=b495336d45bb0d5a",
        "JobType": [
            "Full-time"
        ],
        "PostedDate": "4 days ago"
    }
]